{"name":"Bulbasaur","type1":"grass","desc":"Bulbasaur is a small, quadruped, dinosaur-like Pokémon that has a plant-like bulb on its back. It has a blue and green scaly skin, with a red flower-like growth on its back. Bulbasaur can be very shy and timid, often staying close to its trainers and can use powerful Razor leaf moves."}
{"name":"Ivysaur","type1":"grass","desc":"Ivysaur is a grass/poison-type Pokémon that shares a humanoid upper body with a reptilian lower body, and its skin is a mottled brown and green color. It has large, yellow leaves on its arms and is characterized by its small, red eyes. Its menacing appearance belies its aggressive character."}
{"name":"Venusaur","type1":"grass","desc":"Venusaur is a large, plant-like Pokémon with a bulbous base that holds its roots. It has a pair of large, leaf-like ears and yellow flowers on its back. It is known for its ability to photosynthesize and has a powerful scream that can cause damage."}
{"name":"Charmander","type1":"fire","desc":"Charmander, a Fire-type Pokémon, is a small, lizard-like creature with orange and red scales. It has a flame that burns at the end of its tail, which can be a sign of its mood and health. In terms of character, Charmander is known to be brave and fiercely competitive, making it a formidable trainer in battle. Its moves often involve fire and flame attacks, such as Ember and Flamethrower, which are also used in battle to weaken opponents."}
{"name":"Charmeleon","type1":"fire","desc":"Charmeleon is a Lizard-type Pokémon that resembles a young dragon. It is primarily orange in color with a yellow underside, and it has sharp claws on its arms and legs. Charmeleon is known for its aggressive and fiercely independent nature, and it is capable of using powerful fire-type moves to intimidate its opponents."}
{"name":"Charizard","type1":"fire","desc":"Charizard is a large, dragon-like Fire/Flying-type Pokémon with a predominantly orange and yellow body. It has a pair of wings on its back, with a frill of quill-like structures running along its neck and head. Charizard is known for its intense strength and fiery powers."}
{"name":"Squirtle","type1":"water","desc":"Squirtle is a small turtle-like Pokémon with blue skin, a red panel on its shell, and a yellow ring around its eyes. It has a speedy and agile nature with a somewhat pompous personality. Squirtle's moves include Tackle, Bubble, and Withdraw."}
{"name":"Wartortle","type1":"water","desc":"Wartortle has a turtle-like appearance with a brown shell on its back and a red stripe on its head. It is generally a gentle Pokémon but can be fiercely territorial. Its common moves include Water Gun and Withdraw."}
{"name":"Blastoise","type1":"water","desc":"Blastoise has a large blue body, with a turtle shell on its back and water jets on its hips. As a Pokémon with a strong will, Blastoise can be very stubborn and headstrong but has a strong desire to protect its allies. It can learn powerful Hydro Pump and Skull Bash moves."}
{"name":"Caterpie","type1":"bug","desc":"Caterpie is a bug-type Pokémon that has a green, segmented body with a yellow underside. It is sometimes found in grasslands, forests, and savannas, and is often associated with caterpillars. It is known to be docile, though may get angry if threatened. It uses moves such as Tackle, Poison Powder, and String Shot to capture its prey."}
{"name":"Metapod","type1":"bug","desc":"a caterpillar-like insect with a scaly, protective exoskeleton that covers its body, giving it a distinctive appearance"}
{"name":"Butterfree","type1":"bug","desc":"It has a large, yellow and black body with delicate wings. It's known for its gentle nature and can be found in forests and fields. It has the ability to fly at high speeds and uses its wings to capture its prey."}
{"name":"Weedle","type1":"bug","desc":"Weedle has a green, worm-like body with a reddish-brown head. It has a distinctive appearance, often described as resembling a caterpillar due to its segmented body. Weedle is often found in forests and woodlands, where it feeds on leaves and other plant material."}
{"name":"Kakuna","type1":"bug","desc":"Kakuna is a Poison-type Pokémon that resembles a pincushion filled with poison. It has a yellow and black appearance, with poison sacs scattered all over its body, giving it a toxic look. Kakuna can use various poisonous attacks such as Poison Gas and Acid to its advantage."}
{"name":"Beedrill","type1":"bug","desc":"Beedrill is a dual Bug/Poison-type insectoid Pokémon with a primarily yellow and black body, featuring a large stinger and long limbs. Its sharp stinger and large, compound eyes make it appear intimidating. It is known to be fierce and territorial, even attacking when provoked, and is capable of learning a variety of moves, including Bug-type attacks and potentially-damaging Poison-type moves."}
{"name":"Pidgey","type1":"normal","desc":"Pidgey is a small, brown bird-like Pokémon with a brown back and grayish-brown underside. It has a distinctive black band across its eyes and a short, pointed beak. Pidgey is a common, yet elusive Pokémon, and is known for its ability to fly quickly and change direction suddenly, making it a difficult catch."}
{"name":"Pidgeotto","type1":"normal","desc":"Pidgeotto is a medium-sized, bipedal bird Pokémon with a predominantly brown and gray plumage. Its wings are wide, with a brown leading edge and gray trailing edge, giving it a distinct look. Pidgeotto is known for its curious and proud nature."}
{"name":"Pidgeot","type1":"normal","desc":"Pidgeot, the Aero Jet, is a Normal/Flying-type Pokémon that has a predominantly brown plumage with feathers on its head forming a sort of crest. As a bird-like Pokémon, it often dives and swoops through the air with great speed and agility. Its abilities include using powerful aerial attacks such as Sky Attack and Whirlwind."}
{"name":"Rattata","type1":"normal","desc":"Rattata is a rodent-like Pokémon that resembles a brown rat. It has a lean, muscular body, large teeth, and a long tail. With its quick movements and sharp fangs, Rattata is a formidable opponent."}
{"name":"Raticate","type1":"normal","desc":"Raticate is known as a large rodent Pokémon with a brown, mouse-like body accompanied by a long fluffy tail. It is highly energetic and sometimes territorial. Raticate is highly capable of using powerful moves such as Hyper Fang, Body Slam, and Horn Drill."}
{"name":"Spearow","type1":"normal","desc":"Description of this pidgeon-like bird with brown and white plumage in its early stage of evolution, while the adults are predominantly grey and have a white belly. In the wild this bird can be located commonly in grasslands and some rocky mountainous terrains. It is incredibly swift, with incredible eyesight to find its prey."}
{"name":"Fearow","type1":"normal","desc":"Fearow has a distinctive beak and yellow crest on its forehead. It has a long black tail with a white tip. They're highly aggressive and difficult to catch."}
{"name":"Ekans","type1":"poison","desc":"Ekans is a snake-like Pokémon that has a yellow forked tongue and black and yellow markings on its body. This Pokémon has a highly venomous bite and likes to inhabit dense forests, where it can be found hiding under the branches. Ekans is known to make long-distance leaps to surprise its prey with its painful bites."}
{"name":"Arbok","type1":"poison","desc":"Arbok is a long, dark brown snake-like Pokémon with white markings. It has a menacing appearance and can contract its body when threatened. Arbok also uses its venomous fangs to attack its opponents."}
{"name":"Pikachu","type1":"electric","desc":"its brown, yellow, and red electric mouse-like design - The mouse's ears are set high on the back, adding to its adorable appearance. In the wild, Pikachu lives in caves and forests - It is a small creature that loves to fetch acorns and shine its cheeks. Pikachu also changes its electric attack color when playing, and it often stumbles in its movements."}
{"name":"Raichu","type1":"electric","desc":"Raichu is an Electric-type Pokémon that has a yellow, rodent-like body with a pink tail and black cheeks. It has a distinctive appearance with its long, thin limbs and pointed ears."}
{"name":"Sandshrew","type1":"ground","desc":"Sandshrew resembles a small, weasel-like Pokémon with sandy brown fur and a stocky body. It often curls up into a ball for defense. Sandshrew is a Ground-Type Pokémon and is known for its speed and agility."}
{"name":"Sandslash","type1":"ground","desc":"Sandslash is described as a Ground-type Pokémon that has a yellowish-brown Sandshrew that has evolved, it's also called the yellowish-brown mammalian Pokémon. Sandslash has got a few large, powerful claws which are primarily made of bone and has made some modifications on the underside of its body which have turned over also it has got a highly powerful sand or ground based abilities leading it to go inside earth thus keeping it secure from its predators. Sandslash also has got high powerful speed so that it could do their things quite easily from one place to another."}
{"name":"Nidoran♀","type1":"poison","desc":"Nidoran-F"}
{"name":"Nidorina","type1":"poison","desc":"Nidorina is a small, rodent-like Pokémon with pink fur. Its appearance is similar to Nidoran but with a more rounded head, a pointed snout, and larger ears. Its movements are often described as nimble and agile."}
{"name":"Nidoqueen","type1":"poison","desc":"Nidoqueen, the Poison / Ground-type lizard-like Pokémon, has a distinctive appearance with a green body, yellow undersides and sharp, claw-like hands and feet, with a distinctive crown-like marking on its head. It is often perceived as a mature and assertive creature. Its standard moveset includes Poison Fang, Crunch, Earthquake and Sludge Bomb."}
{"name":"Nidoran♂","type1":"poison","desc":"Nidoran♂ is a small quadruped. It has a pink, rodent-like body, with grey markings on its back and a yellow tip on its tail. It's a timid, somewhat shy Pokémon."}
{"name":"Nidorino","type1":"poison","desc":"Nidorino is a small, rodent-like Pokémon with a predominantly yellow and orange body, and it also has a red, finger-like spike on the end of its horn. Nidorino is known for its fierce and feisty nature. Its common moves include Tackle, Growl, and Double Kick."}
{"name":"Nidoking","type1":"poison","desc":"Nidoking is a highly aggressive, powerful and venomous Ground/Poison-type Pokemon. It has a large and robust body with brown and large spikes on its body, giving a intimidating appearance"}
{"name":"Clefairy","type1":"fairy","desc":"Clefairy has pink, chubby body with a relatively small tail and is often seen playing around and tricking people and is known for being cute and funny. The species is especially known for a variety of colorful markings on its chest and is the pre-evolution of Clefable. They can perform a variety of attack and fairy-type moves"}
{"name":"Clefable","type1":"fairy","desc":"It has a pink body, white patches, and a head with two prominent horns. Clefable is a cute, and friendly Pokémon. This Pokémon is said to possess a kind heart, and it is said to wish for the happiness of those around it. It has the ability to change its form to mimic various other Pokémon and use their special moves."}
{"name":"Vulpix","type1":"fire","desc":"Vulpix is a small, fox-like Pokémon with a predominantly orange body, with six ring-like markings on each side of its body. It has a fluffy tail and a distinctive fox-like face. Vulpix is known for its ability to utilize its six extensions of its body to split into six separate Vulpix and to perform a unique and powerful version of its normal technique to be quite forceful and effective."}
{"name":"Ninetales","type1":"fire","desc":"Ninetales is a Fire-type Pokémon that is often seen with nine tails. It is known for its smoky fur and golden fur, distinguishing it from other Pokémon. Ninetales uses its flames to create fire moves such as Flame Wheel and Fire Blast."}
{"name":"Jigglypuff","type1":"normal","desc":"Jigglypuff is a pink, puffy mammalian Pokémon with a large mouth and ears. It can use its singing to put opponents to sleep and can grow larger when it releases a powerful singing cry"}
{"name":"Wigglytuff","type1":"normal","desc":"Wigglytuff is a pink, globular Pokémon with pink, rounded spikes or nodules on its head and shoulders. Its appearance is inspired by a fluffy cloud and a smile. It has the ability to manipulate sound waves with its cheeks and uses Cute Charm."}
{"name":"Zubat","type1":"poison","desc":"A dark, flying-type with a rodent-like appearance. Its wings and ears are covered with a thin layer of fur, giving it a delicate appearance. Notably, Zubat has a unique venomous stinger and is found near caves and rocky terrain. "}
