{"name":"Bulbasaur","type1":"grass","desc":"Bulbasaur, a grass/poison-type Pokémon, has a plant-like bulb on its back, with reptilian eyes and red jewel-like structures on its neck. It has a short, green and blue body with its tail extending from its rear end. Moves such as Razor Leaf and Vine Whip are common in its initial trainer arsenal."}
{"name":"Ivysaur","type1":"grass","desc":"It has a more muscular and tropical plant-like appearance. Ivysaur is a type of plant- human hybrid. It has developed leaves on its back and vines hanging down from its arms."}
{"name":"Venusaur","type1":"grass","desc":"Venusaur, known as Fushigibana in Japan, is the final evolution of Ivysaur and is a Grass/Poison-type Pokémon. It has a serpentine plant body with large eyes and ears. It has sharp claws and a rounded frill around its neck, which it uses to intimidate its opponents. It has the ability to photosynthesize and grow vines at will."}
{"name":"Charmander","type1":"fire","desc":"A small, lizard-like Pokémon with a flame that burns at the end of its tail. It primarily appears in shades of brown, with orange on its lower body and a light orange border around its eyes."}
{"name":"Charmeleon","type1":"fire","desc":"Charmeleon is a primarily orange reptilian Pokémon with a flame that burns within its body. It has a flame burning on the end of its tail and on its head it has small red markings resembling eyes. Additionally, it is also slender and agile with a spiky ridge along its back."}
{"name":"Charizard","type1":"fire","desc":"Charizard is a large, dragon-like Pokémon with a predominantly orange and yellow color scheme. It has a combination of wild, savage, and slightly brutal tendencies, making it a formidable opponent in battle. It can learn powerful Fire and Flying-type moves, such as Dragon Claw, Flamethrower, and Fire Blast."}
{"name":"Squirtle","type1":"water","desc":"Squirtle is a Water-type Pokémon with blue skin, yellow eyes, and a shell on its back. It has small flippers, and it can carry its shell on its back like a backpack. Squirtle is a cute and curious Pokémon, often seen interacting with its trainers and other Pokémon."}
{"name":"Wartortle","type1":"water","desc":"Wartortle, the Turtleshell Pokémon. Wartortle is a reptilian turtle-like Pokémon with a blue sea turtle shell that resembles a tank's armor plating on land. When it swims in the ocean using its powerful legs for propulsion."}
{"name":"Blastoise","type1":"water","desc":"It's description is the water turtle-like Pokémon has a large body, powerful jaws, and a sturdy shell on its back. It is a powerful and sturdy Water-type Pokémon, known for its fierce warrior spirit and strong sense of justice. Its long tail and webbed feet allow it to swim at high speeds and can also know powerful moves like Hydro Pump and Skull Bash."}
{"name":"Caterpie","type1":"bug","desc":"Caterpie is a small, caterpillar-like Pokémon that is green with yellow dots and can be found in forests. It has a big appetite, but its slow pace and small size make it an easy target for other Pokémon. It uses its sticky silk strands to immobilize prey."}
{"name":"Metapod","type1":"bug","desc":"It has a brown exoskeleton with a distinctive, rounded shape, and its body is divided into two distinct segments. Metapod is known for being somewhat timid and usually tries to avoid confrontations, it does not use defensive moves often."}
{"name":"Butterfree","type1":"bug","desc":"It has a yellow body with black markings and large wings. It is often found in tropical areas. It can learn various flying-type moves and is known for its speed and agility."}
{"name":"Weedle","type1":"bug","desc":"Weedle has a brown body with a yellow waist, red rings on its head and tail, and antennae on its head. It is a biting and pestering insect-like Pokémon. It is often found on weed and other plants. Weedle can move using its six long, thin legs, possessing a unique and harmless poison stinger at the end of its tail giving it a unique, insect look."}
{"name":"Kakuna","type1":"bug","desc":"Kakuna, the Poison Spore Pokémon, is a dual Poison-type Pokémon. It has a brown, worm-like body and the appearance of a bagel with eyes and a mouth on top. Move wise, it can learn moves such as Poison Powder and Pin Missile"}
{"name":"Beedrill","type1":"bug","desc":"Beedrill is a small, insectoid Pokémon with a yellow body, green wings, and a stinger on its abdomen. It has a distinctive black stripe running down its head and thorax, giving it a menacing appearance. Beedrill is known to be highly aggressive and territorial, using its speed and agility to overpower its opponents."}
{"name":"Pidgey","type1":"normal","desc":"Pidgey is a small, brown bird-like Pokémon with a brown back and a gray belly. It has a distinctive black line running over its eye and a yellow beak. In terms of personality, Pidgey is known for being quick-witted and being generally seen to be active and alert. It possesses a variety of moves that are considered useful for 'striking' type moves, including Peck, Sand Attack, and Gust."}
{"name":"Pidgeotto","type1":"normal","desc":"The second evolution of Pidgey. Pidgeotto has a larger size with brown feathers with white underbelly and a small top crest on its head. Large wings which give Pidgeotto incredible flying skills and speed."}
{"name":"Pidgeot","type1":"normal","desc":"Pidgeot is a bird-like Pokémon with a predominantly brown and white plumage. It has a sleek, aerodynamic body and a distinctive crest on its forehead. Pidgeot is known to be a fast and agile flyer, capable of reaching incredible speeds."}
{"name":"Rattata","type1":"normal","desc":"Rattata are rodent-like creatures that have gray and white fur, small beady eyes, and sharp teeth. They have a short, stocky body and long hair on their tails. Rattata are often depicted as having a bit of a mischievous personality, are known to be quick to attack and steal food from other Pokemon."}
{"name":"Raticate","type1":"normal","desc":"Raticate is a brown, rodent-like Pokémon with a long, bushy tail. It is known for being quick and agile, with a strong sense of smell. Its moves typically include Hyper Fang, Crunch, and Dig."}
{"name":"Spearow","type1":"normal","desc":"A bird Pokémon with  red and white plumage. It appears in many different regions and its young are recognized by their yellow beaks and chests."}
{"name":"Fearow","type1":"normal","desc":"it has a long, narrow body with gray feathers and a sharp, pointed tail. Fearow often appears in a very bird-like posture. Fearow may possess moves like Peck and Drill Peck."}
{"name":"Ekans","type1":"poison","desc":"Ekans is a snake-like Poison-type Pokémon with a brown or yellow-brown body, yellow and brown-red stripe running down its neck, and in a few cases, the red stripe turns into a small circle on its back when it gives birth. It is primarily known to be aggressive and timid towards other snakes."}
{"name":"Arbok","type1":"poison","desc":"Arbok is a dark-colored, snake-like Pokémon with red eyes. It is known for its speed and agility. Its distinctive patterns and slender body allow it to blend into the shadows."}
{"name":"Pikachu","type1":"electric","desc":"Pikachu is a small, rodent-like Pokémon with yellow fur, red cheeks, and brown eyes. It is known for its quick movements and ability to store and release electricity. Pikachu primarily lives in forests and grasslands, often communicating with high-pitched sounds, and is the iconic mascot of the Pokémon franchise, known for its agility and quick movements."}
{"name":"Raichu","type1":"electric","desc":"Raichu is a yellow rodent-like Pokémon with red cheeks, sharp teeth, and electric powers. It has dark eyes and yellow fur, with its whiskers and claws quite strong. Raichu can store and discharge electricity in its cheeks, and is known to be a powerful ally or deadly foe."}
{"name":"Sandshrew","type1":"ground","desc":"Sandshrew is a small, rodent Pokémon with a sandy-brown body and a long, thin tail. It has a distinctive sand-digging habit and can curl up into a ball, shielded by its sand-covered fur. It is known for its fierce and often territorial behavior, and can use its sharp claws to defend itself from predators."}
{"name":"Sandslash","type1":"ground","desc":"Sandslash is a yellow, rodent-like Pokémon with brown stripes on its back. It has long claws for digging and a furry, armored body. Sandslash can curl up into a ball for defense and is known to be fiercely territorial."}
{"name":"Nidoran♀","type1":"poison","desc":"Nidoran, known as Nidoran(F) in the anime, is a rodent-like creature that resembles a cross between a mouse and a hedgehog. It has a pink and white appearance with quills or hair running across its back. Nidoran(F) can be quite territorial at times and may even display aggressive behavior in self-defense. The move set includes Poison Powder, Poison Fang and Tackle."}
{"name":"Nidorina","type1":"poison","desc":"The female counterpart to Nidoro, Nidorina appears in the mid-level stages of evolution. It has a pink, rodent-like body with white fur on the underside of its head and a protective, venomous stinger on its hind end."}
{"name":"Nidoqueen","type1":"poison","desc":"Nidoqueen, the Venomous Pokémon. Type: Poison/Dragon. It has a bulky, quadruped body covered in dark grey scales, with a horn-like protrusion on its forehead and a pair of blades on its wrists."}
{"name":"Nidoran♂","type1":"poison","desc":"Nidoran♂ is a small, rodent-like Pokémon with a reddish-brown fur and white stripes on its cheeks. It has a distinctive horn on its forehead and its eyes are pointed ears. As a male, it carries a sharp barb on its rear, used for defending itself."}
{"name":"Nidorino","type1":"poison","desc":"Nidorino is a Poison-type Pokémon with a primarily orange-colored body, a pair of large horn-like protrusions on its head, and a narrow, orange tail. Its overall appearance gives it a menacing and intimidating look. It is known to be a skilled fighter, and its moves often incorporate poison-based attacks to weaken its opponents."}
{"name":"Nidoking","type1":"poison","desc":"Nidoking is a large, bipedal Pokémon with a green and blue scaly body and a distinctive crest on its head. Its underbelly is cream-colored and it has long teeth. It is known to be very aggressive and territorial, with a tendency to clash with other Pokémon over its territory."}
{"name":"Clefairy","type1":"fairy","desc":"Clefairy is a fairy-type Pokémon that resembles a pink, humanoid fairy with wings and a slender body. It is known for its cute appearance and magical powers. In terms of moves, Clefairy can perform a variety of fairy-type attacks, including Fairy Wind and Moonblast."}
{"name":"Clefable","type1":"fairy","desc":"Clefable is a small, cute, and pink Pokemon with a rounded body and a small crown-like structure on its head. It possesses a very gentle and caring personality. Clefable is known for using subtle and mysterious magic, and as a skilled healer, it can utilize various moves to mend wounds, including Recover, Dream Eater, and Moonblast."}
{"name":"Vulpix","type1":"fire","desc":"Vulpix are predominantly orange fox-like Pokémon with yellow-tipped ears and a fluffy tail that are covered with seven rings of fur and are orange in shade, with some white stripes down each side of their face. They are generally energetic and lively, but some Vulpix tend to be shy. Vulpix typically use Fire-type moves in battle."}
{"name":"Ninetales","type1":"fire","desc":"Ninetales is a Fire-type Pokémon with a fox-like appearance. It has a red-orange body and six tails. Ninetales is known for its intelligence and cunning nature."}
{"name":"Jigglypuff","type1":"normal","desc":"Jigglypuff has a pink appearance and contains of a pale inner area of the body, containing a few dark spots. Additionally, it has small red eyes and ear-like protrusions on its head. This blue-and-round Pokémon is quite adorable, and it charms its opponents in battle with its endearingly cute singing voice that can send even a normally aggressive Pokémon to sleepy time with none other than its known fighting moves, singing, pound and hyper voice"}
{"name":"Wigglytuff","type1":"normal","desc":"Wigglytuff is a Normal/Fairy-type Pokémon that resembles a pink, cream, or yellow puffy creature. It has two flexible ears and a pink nose, adding to its adorable appearance. This large, somewhat rotund Pokémon has been observed to employ Fairy-type moves to fight its opponents."}
{"name":"Zubat","type1":"poison","desc":"Zubat is a dark-blue, winged Pokémon. It has a pale brown belly, a distinctive pair of ears, and a pair of fangs. With the ability to use Dark-type moves and quickly fly through the night using its long ears, Zubat proves to be a formidable Bat Pokémon."}
{"name":"Golbat","type1":"poison","desc":"Golbat is a nocturnal, winged Pokémon with a brown and yellow coloration. It has large, round eyes and long fingers on its hands, with sharp claws attached. Golbat is known for its ability to fly quickly and its fondness for sweets."}
{"name":"Oddish","type1":"grass","desc":"Oddish is a green and white bud-like Pokémon with a pair of clamshell-like arms and a wattle on its neck. It has a tendency to grow towards well-lit areas, causing it to turn towards the light in order to photosynthesize. It can turn its body a little to reach out towards and to photosynthesize and it can photosynthesize at night too."}
{"name":"Gloom","type1":"grass","desc":"Gloom has a green, gas-producing, poisonous gas plant-like body with petals and leaves. It has a very strong, unpleasant odor and gets more toxic as it grows older. It tends to secrete its noxious gas when it senses its enemies."}
{"name":"Vileplume","type1":"grass","desc":"Vileplume have large, flowering petals on their arms and head which they sometimes use to capture prey."}
{"name":"Paras","type1":"bug","desc":"Paras is a Bug/Poison-type Pokémon with a yellow body and a parasitic fungus on its back giving it an orange appearance. It is known for being a symbiotic organism, living in a partnership with its spore-like fungi, which it uses to photosynthesize and move. Paras tends to be slow-moving but uses its insect-like arms to attack and its fungus to heal itself."}
{"name":"Parasect","type1":"bug","desc":"Parasect is an insect/bug-like Pokémon with a large, intimidating appearance. It has a gray body resembling the insect's exoskeleton with the top featuring a horn-like protrusion and several dark-colored compound eyes. In combat, it wields its large pincer arms while it is vulnerable to poisonous spores."}
{"name":"Venonat","type1":"bug","desc":"Venonat has a yellow and white spotted body. It has a large black carapace on its back that protects it from its enemies. Venonat is known for its fast movements while scouting for prey."}
{"name":"Venomoth","type1":"bug","desc":"Venomoth is a Poison/Flying-type Pokémon with a distinctive moth-like appearance, characterized by its large, black wings and a pinkish-gray body. It is often depicted as a gentle and serene creature, despite its toxic appearance. Venomoth is known to learn a variety of moves, including toxic, poison powder, and silver cloch, which it uses to its advantage in battle."}
{"name":"Diglett","type1":"ground","desc":"Diglett is a rodent-like Pokémon with a brown, mole-like body. It is known for its ability to dig rapidly through the ground. It has two small eyes and a short snout."}
{"name":"Dugtrio","type1":"ground","desc":"Dugtrio are six-legged, rodent-like Pokémon with three heads who are usually brown or orange in color. Their front head is usually the most different of the three, having its head looking an entire different angle. They are digging mammal Pokémon who are known for their dig-fast moves."}
{"name":"Meowth","type1":"normal","desc":"Meowth are small, feline Pokémon with a grayish-brown fur and a striking white belly. They are often found in urban environments, known for their scavenging nature. As a nimble and cunning Pokémon, they are known to carry around coins they've collected, and can utilize their sharp claws and agility to deliver swift attacks in combat."}
{"name":"Persian","type1":"normal","desc":"A white, feline Pokemon with large, striking ears and a long, bushy tail. It's known for its sassy personality, with a mix of confidence and curiosity."}
{"name":"Psyduck","type1":"water","desc":"Psyduck is a yellow, duck-billed Pokémon with a flat, brown head, a white collar around its neck and a small tuft of feathers on the top of its head. It has a somewhat pig-like snout, a bit on the narrow side. Some psychic power inheres in the very aura of certain Psyduck, and in general these ducks are somewhat uncurious about their surroundings."}
{"name":"Golduck","type1":"water","desc":"Golduck is a medium-sized, otter-like Pokémon with a mostly dark brown body. It has white markings on its face, darker brown facial markings around its eyes, and a long snout. It is often known to have a calm demeanor."}
{"name":"Mankey","type1":"fighting","desc":"Mankey has a primal, simian appearance with a black and white fur, its arms and legs are long and slender, with sharp claws on its hands and feet. It's a mischievous creature, given to trouble and mayhem, but its playfulness often hides its capacity for ferocity. Mankey can use various moves such as Fake Out, Karate Chop, and Cross Chop to overwhelm its foes."}
{"name":"Primeape","type1":"fighting","desc":"Primeape is a large, orange ape-like Pokémon with a distinctive violet 'mask' on its face. It has extremely powerful limbs, and its body is covered in thick, bouncy fur. "}
{"name":"Growlithe","type1":"fire","desc":"Growlithe is a yellow dog-like Pokémon with a flame on the end of its tail. It has a red collar around its neck and its eyes are a piercing brown. Growlithe is known to have a sweet and affectionate nature."}
{"name":"Arcanine","type1":"fire","desc":"A Fire-type Pokémon that resembles a red, wolf-like creature. It has a bushy tail and a large flame at the end of its back, and has a strong connection to its trainers. Arcanine has various powerful Fire-type moves at its disposal."}
{"name":"Poliwag","type1":"water","desc":"Poliwag is a blue-green, amphibious Pokémon that resembles a tadpole. It has a bulbous body, long tail, and gills on the sides of its head. Poliwag is known for its playful and curious nature."}
{"name":"Poliwhirl","type1":"water","desc":"Poliwhirl is a bipedal Water-type Pokémon with a large, bulbous body that is mostly yellow in color. It has a series of pink or red fins on its head, chest, and back, and its legs are equipped with large, paddle-like feet. Poliwhirl is known to be relatively slow and calm compared to its predecessors in the Poliwag evolutionary line, with a special affection for mud and pollution."}
{"name":"Poliwrath","type1":"water","desc":"Poliwrath is a humanoid Pokémon with a muscular build, having green and white skin. It has a distinctive mustache and beard. It is known for its incredible strength and agility, often using it to toss its opponents into the air."}
{"name":"Abra","type1":"psychic","desc":"Abra is the first evolved form of Pokémon. It is known for its psychic powers and a sleeping body, with an Abra in its dream world saying that it can fly through the air. Abra is a small, sprite-like creature with high psychic powers. Later evolution into Kadabra is notable."}
{"name":"Kadabra","type1":"psychic","desc":"Kadabra has a telekinetic, psychic appearance with a pale body and hand extended.  It is renowned for its levitating head that rotates with a 360-degree flip on its axis.  Its  movement style includes telepathic thoughts along with levitation of objects or other beings."}
{"name":"Alakazam","type1":"psychic","desc":"Alakazam is a Psychic-type Pokémon that has a white, wiry body with a pink circle on the end of its tail. It has high intelligence and a calm, yet intimidating demeanor. Alakazam is known to be extremely powerful and can defeat opponents with ease with its powerful Psychic-type moves."}
{"name":"Machop","type1":"fighting","desc":"Machop is a humanoid Pokémon resembling a martial artist. It has a stout build, with a green and yellow skin appearance and black accents. When threatened or upset, Machop growls loudly and becomes red-faced."}
{"name":"Machoke","type1":"fighting","desc":"Machoke is a powerful, muscular Pokémon with a bulky build and a bit of a gorilla-like appearance, featuring sharp spiky arm bands and a fiercely aggressive demeanor. Its arms are capable of incredible strength, allowing it to unleash incredibly damaging physical attacks."}
{"name":"Machamp","type1":"fighting","desc":"Machamp is a large, muscular Human-Like pokémon with green skin and blue muscles visible underneath. It has a fighting spirit, often showing off its strength. It can perform moves like submission, dynamic punch and karate chop."}
{"name":"Bellsprout","type1":"grass","desc":"Bellsprout is a grass/poison-type Pokémon that has a bulby body with green and yellow colors. It grows in swampy areas and has an intimidating appearance. Bellsprout is often found with its fellow Bulbosaur, and its harsh cry can knock down weeds."}
{"name":"Weepinbell","type1":"grass","desc":"Weepinbell is a Poison-type Pokémon that resembles a flower bud. It has a large, green, inflated appearance with tiny, white particles scattered around and three green leaves. It is known to have a calm demeanor, but its contents are extremely toxic."}
{"name":"Victreebel","type1":"grass","desc":"Victreebel is a large, insect-like Pokémon with a pink and white striped body and long, thin legs. Its face is shaped like that of a swallow, giving it a long, pointed snout. It has a fierce and vengeful character."}
{"name":"Tentacool","type1":"water","desc":"Tentacool is a Water/Ice-type Pokémon that has a blue and clear, jelly-like body with red eyes. It has a distinctive swimming motion to move around. Tentacool is known to use corrosive threads and sharp, stinging hairs to attack its opponents."}
{"name":"Tentacruel","type1":"water","desc":"A Water-Poison-type Pokémon with 90 base stat points for HP, 120 for Attack, and 75 for both Special Attack and Defense."}
{"name":"Geodude","type1":"rock","desc":"Geodude (Japanese: , Iwapurin) is a Ground/Poison-type Pokémon. It has a sturdy rock-like body and two eyes on top of its head. Geodude is a mushroom-like Pokémon with an earthen, sandy color allowing it to blend in well with its surroundings.  It is a gentle and honest Pokémon."}
{"name":"Graveler","type1":"rock","desc":"Graveler is a quadruped, Rock-type Pokémon that resemble a boulder on legs. It has small, bead-like eyes and is covered in a thick layer of gray rock. It has the ability to move by rolling at high speeds causing destruction when it gets in its way. Graveler can be perceived to pose a threat with its tough and relentless character."}
{"name":"Golem","type1":"rock","desc":"Boulder overhead, it stomps the ground and creates Harding the grounds by kicking up massive dust"}
{"name":"Ponyta","type1":"fire","desc":"Ponyta is a small, fire-type Pokémon with a horse-like body and a fiery mane. It is known for its speed and endurance. Ponyta can learn moves such as Fire Blast, Flame Wheel, and Swift."}
{"name":"Rapidash","type1":"fire","desc":"Rapidash is a quadruped Fire-type Pokémon with a horse-like appearance. It has a slender body with a reddish-orange color, a flowing mane, and a distinctive horn on its forehead. Its mane and tail can change color depending on its mood."}
{"name":"Slowpoke","type1":"water","desc":"Slowpoke is a water-type Pokémon with a blue body, a yellow underside, and a yellow tail that resembles a bell. Slowpoke has a laid-back, slacker-like nature, with a tendency to be somewhat forgetful. Its signature moves include Tackle and Withdraw, with expertise in water-type attacks due to its appearance as a marine animal."}
{"name":"Slowbro","type1":"water","desc":"It has a shell on its back, and in it lives a Shellder. Its shell protects it from attacks and serves as a giant rock to aid its battle strategies. This Pokémon evolved from Slowpoke."}
{"name":"Magnemite","type1":"electric","desc":"Magnemite is a small, round Metal-type Pokémon that resembles a magnet. It has a magnetic top plate that can change its magnetic field to attract or repel metal objects. In terms of character, Magnemite is known to be brave and willing to battle, but it can be wary of physical attacks."}
{"name":"Magneton","type1":"electric","desc":"Magneton is a Steel-type Pokémon that appears as a group of three electrically charged metal balls connected by thin wires. They are known for their 'ferricite mining' behavior, where they corrode metal to extend their bodies in search for nutrients. They are good at using moves like Thunderbolt and Thunder Wave."}
{"name":"Farfetch'd","type1":"normal","desc":"Farfetch’d is a dual Water/Flying-type Pokémon, resembling a hen with a green plumage. It has a feathery backside and distinctive spiked arms. It can move fast and carry long-held staffs with precise control."}
{"name":"Doduo","type1":"normal","desc":"Doduo has a duck-billed head and a beaked mouth. Its body is quite similar to that of an emu. Some distinctive features of the bird include  wings with a short wing tip at the end.  It tends to travel around with its partner, and it is highly competitive. It has a small number of physical moves, most notably Wing Attack, and Peck."}
{"name":"Dodrio","type1":"normal","desc":"Dodrio is a large, three-headed bird Pokémon with a brown and yellow body. Each head has a unique personality and the Pokémon is known for its strength and aggressive nature. Dodrio is known to use powerful physical attacks and can also use its wings to knock opponents back."}
{"name":"Seel","type1":"water","desc":"Seel has a blubbery blue body with a white belly. It has a rather rounded shape and big eyes that give it a cute appearance. It has long, flowing whiskers, resembling those of the seal, from which it derived its name. It's generally found near ice and snow. In battle, it has a calm demeanor, usually remaining still and centered. Seel is known for using powerful water-type attacks such as Ice Beam, Aqua Tail and Hydro Pump against its opponents."}
{"name":"Dewgong","type1":"water","desc":"Dewgong is an Ice/Water-type Pokémon and the evolved form of Seel. It has a white, whale-like body and its most striking feature is its large, cow-like head and two long tusks. Dewgong is often found in cold freshwater environments, such as lakes and rivers."}
{"name":"Grimer","type1":"poison","desc":"Grimer is a Dark/Poison-type Pokémon, characterized by its pink, slimy appearance and a tendency to cause pollution. It has a distinctive pink and gray body, with yellow spots on its back. In terms of character, Grimer is known for its strong, robust nature."}
{"name":"Muk","type1":"poison","desc":"Muk is a pink blob-like Pokémon with two black eyes and a flat, worm-like body. It smells strongly of toxic waste and often settles in smoky environments. Muk is known to be a slow-moving but extremely powerful Pokémon."}
{"name":"Shellder","type1":"water","desc":"Shellder is a Water-type Pokémon resembling a large snail shell. It is a spherical Pokémon with a spiraling shell on its back and is often found near the sea. Shellder is known to attack with waves and can be quite aggressive when threatened. It is capable of storing water inside its shell allowing for energy in its various attacks."}
{"name":"Cloyster","type1":"water","desc":"Ice/Water-type Pokémon that is a massive sea turtle-like creature with a glacier-like shell. Its icy exterior and massive size can make or break the will of opponents. With a few strong hits, it can display massive destructive power."}
{"name":"Gastly","type1":"ghost","desc":"Gastly is a Purple gas-like Pokémon with a rounded body and a faint face. It has a tendency to explode when threatened. Gastly are known to be ghost/poison-type Pokémon."}
{"name":"Haunter","type1":"ghost","desc":"A ghost/poison-type Pokémon with a cream-colored body and red eyes. It has black spots on its body and is known to be a tall and slender Pokémon. Haunter is often described as a bit unsettling and eerie."}
{"name":"Gengar","type1":"ghost","desc":"A Ghastly Gas Type in Pokémon, Gengar is a unique, ghost/poison Pokémon resembling a simple, faceless, white mask with black outlines and a bulbous body. It often exhibits a sense of mystery and intelligence in its character. Its typical moves can include Shadow Ball, Sludge Bomb and Dream Eater."}
{"name":"Onix","type1":"rock","desc":"Onix are large, burrowing Pokémon resembling a cross between an earthworm and cable with a long snake-like body consisting of large, boulder- like segments. They are known to be valuable for their rocky bodies, which they use to dig and burrowing through the ground. Their long and powerful tails are often used for sensing nearby vibrations and to counter potential attacks in battle with a slithering motion, as well as powerful body slams which are often accompanied by sharp screeches."}
{"name":"Drowzee","type1":"psychic","desc":"Drowzee is a dual Psychic/Fairy-type Pokémon with a yellow, humanoid body. It has a round, sleep-inducing hat on its head and a small, red nose. It is known for being able to induce sleep in others through its powers."}
{"name":"Hypno","type1":"psychic","desc":"Hypno is a Psychic-type Pokémon and has brown and white fur with distinctive, hypnotizing eyes. Its body resembles that of an opossum, with a prehensile tail. Hypno possesses enhanced psychic abilities allowing it to read minds."}
{"name":"Krabby","type1":"water","desc":"Krabby is a small, red crab Pokémon with a distinctive appearance. They have a tender and docile nature, often found in coastal areas. Krabby are known to have a versatile move set that can include moves like Crabhammer and Horn Drill."}
{"name":"Kingler","type1":"water","desc":"Kingler is a large, crab-like Pokémon with a blue carapace and large claws. It is often found near its kingdom, which is composed of underwater caverns and dens. In battle, Kingler can use powerful moves such as Vice Grip and Clamp to subdue its opponents."}
{"name":"Voltorb","type1":"electric","desc":"Voltorb, also known as the Bubble Pokémon, is a Pokémon that resembles a ball with a battery compartment inspired by classic video games. The ball's 'eyes' glow and flash as it bounces around when full of electricity and it is known to be a bit scatterbrained. It is known to specialize in ball-like tactics, and various electric-type moves."}
{"name":"Electrode","type1":"electric","desc":"Electrode is a Electric-type Pokémon that resembles a small sphere with a red centre. It is known for its ability to explode when threatened, which can cause its opponents to flinch. Electrode has a curious and innocent nature, often seeking out its trainers' companions and using its moves to aid them."}
{"name":"Exeggcute","type1":"grass","desc":"Exeggcute appears to be a plant-like Pokémon with four egg-like protrusions located below its stem-like body, with a green pod containing the seeds. Its overall appearance is plant-like. It is known for being relatively aggressive, especially when its seeds are disturbed."}
{"name":"Exeggutor","type1":"grass","desc":"Exeggutor are intelligent and highly perceptive. They have long, slender branches protruding from their skull with large leaves on the end. In other forms, such as Alakazam, they had evolved from Exeggcute and were known to possess telepathic abilities and were one of the evolutions that one could attain in the franchise by leveling and item usage. Exeggutor also, can grow to twice its normal height. "}
{"name":"Cubone","type1":"ground","desc":"Cubone is a largely developed bone on its head at birth and typically lives alone in caves. It is typically found dwelling in various environments. It utilizes its surroundings to travel, relying on its speed and battle prowess. It evolves into Marowak. Marowak - It found on mountains often having a bone in its face, its strong jaws have the power to crush a normal Alakazam's skeleton, Cubone uses its strong legs to hop, and its sharp eyes to survey its surroundings for possible threats and its powerful claws to bring them down."}
{"name":"Marowak","type1":"ground","desc":"Marowak is a bipedal, Ground/Dark-type Pokémon with a wolf-like appearance, characterized by its skeletal features and long, clawed hands and feet. It is often portrayed as a fierce and intimidating Pokémon. Marowak is known for its ability to use powerful moves like Bone Club and Fire Fang."}
{"name":"Hitmonlee","type1":"fighting","desc":"Hitmonlee is a martial arts-inspired humanoid Pokémon with superhuman speed and agility. It has a distinctive appearance, with long legs and arms, a thick body, and a calm facial expression. As a Fighting-type Pokémon, Hitmonlee is known for its lightning-fast kicks and punches, often executing swift and precise movements."}
{"name":"Hitmonchan","type1":"fighting","desc":"Hitmonchan is a humanoid boxing Pokémon with a blue and white color scheme, resembling a boxer. It is known for its impressive speed and agility on the battle field. Its moves include Punch, Karate Chop, and Focus Punch."}
{"name":"Lickitung","type1":"normal","desc":"Lickitung, the Licking Pokémon, is a normal-type of rodent-like Pokémon. It has blue slobber on its face and a long tongue that it uses to lick its trainers. Lickitung is most often found on land, as it cannot swim."}
{"name":"Koffing","type1":"poison","desc":"Koffing is a Poison-type Pokémon that resembles a cloud with a shadowy substance. It has a dim spirit and is said to be born from pollution. Its ability to produce toxic gas allows it to evolve into Weezing. "}
{"name":"Weezing","type1":"poison","desc":"Weezing are large, balloon-like Pokémon with three black eyes and yellow eyelids. They typically have a strong, skunk-like odor and are known to be able to change their shape to evade their opponents. They are unlikely to take opponents seriously."}
{"name":"Rhyhorn","type1":"ground","desc":"Rhyhorn is a quadruped, rhinoceros-like Pokémon with a gray body covered in a layer of yellow and red skin, with a distinctive horn on its forehead. It is known for its exceptional strength and speed, making it a formidable opponent in battle. Rhyhorn often uses its powerful body to charge at opponents, catching them off guard with its quick and stealthy movements."}
{"name":"Rhydon","type1":"ground","desc":"Rhydon is a Ground/Rock-type Pokémon that appears as a blue rhinoceros-like Pokémon with a distinctive horn on its head. It has a large body and is known for its incredible strength and mobility. Rhydon is often portrayed as a gentle creature that lives in caves, and it can learn a variety of powerful moves including Drill Run and Earthquake."}
{"name":"Chansey","type1":"normal","desc":"Chansey is a Pink Pokémon with a soft and feminine appearance. It is known to be caring and nurturing, often giving eggs to other Pokémon. Chansey can learn a variety of moves, including Recover, Soft-Boiled, and Charm."}
{"name":"Tangela","type1":"grass","desc":"Tangela is a Grass-type Pokémon that resembles a plant with vines for 'arms' and 'legs'. It is a fairly rare Pokémon in the wild. Tangela can learn various Grass-type moves such as Razor Leaf and Vine Whip."}
{"name":"Kangaskhan","type1":"normal","desc":"Kangaskhan, also known as the Mother Pokémon, is a large, kangaroo-like Pokémon with a powerful build. It has a somewhat gentle and maternal personality, often showing concern for its trainer's well-being. Its moves include Body Slam, Ember, and Hyper Beam."}
{"name":"Horsea","type1":"water","desc":"Horsea is a Water-type Pokémon that has a blue and yellow body, a fish-like head, and a set of vibrant fins."}
{"name":"Seadra","type1":"water","desc":"Seadra is a water-type Pokemon with a serpentine appearance, characterized by its red and blue scales and webbed fins. It is often seen battling in high schools with confidence and determination. It can use its incredible speed and agility to assault its opponents with swift Water Gun attacks."}
{"name":"Goldeen","type1":"water","desc":"A yellow fish with a white underside and a golden or orange-orange tail fin. It lives in the ocean and swims rapidly. Goldeen can be seen making quick battles with other fish in the the fast flowing rapids."}
{"name":"Seaking","type1":"water","desc":"Seaking has a sleek, fish-like appearance with a gray and white body. It is known to be a fast and elegant swimmer, and is often found in fast-moving bodies of water. In terms of moves, it can learn a variety of aquatic-based attacks, such as Hydro Pump and Aqua Tail."}
{"name":"Staryu","type1":"water","desc":"Staryu is a starfish-like Pokémon with a distinct ringed appearance. It has a blue body with a pale ring following its edge. It resembles a sea star with a similar five pointed star-shaped body appearance, with a blue ring at its center. Staryu are primarily aquatic Pokémon. In the Pokémon games, Staryu are known to have good speed, decent attack and special defence, but weak defense making them a slower, yet harder to hit opponent. Staryu, along with its evolved form Starmie, use psychic powers acquired from its evolved ability to aid in its and its allies' battles. It is a Water-type Pokémon."}
{"name":"Starmie","type1":"water","desc":"Starmie is a blue and red cylindrical Pokémon. It has a few eyes on its body, which allows it to move quickly. Starmie is known for its agility and intelligence."}
{"name":"Mr. Mime","type1":"psychic","desc":"Mr. Mime has a white, round body with a pantomime mask, gloves, and a hat. It appears to have a slender figure with long legs that end in hands, and is often depicted as a skilled actor."}
{"name":"Scyther","type1":"bug","desc":"Appearance wise, Scyther resembles an insect with a metallic sheen on its wings. It is known for being highly agile and is often found in areas with a lot of sunshine. Scyther's signature moves include Agility and Twister."}
{"name":"Jynx","type1":"ice","desc":"Jynx is a blue, bipedal Pokémon with long limbs and feet that appear to be modeled after those of a ballerina. It has a few facial features resembling a human. Jynx is known to be quite unusual with its human-like movements and it has been observed to dance when moved."}
{"name":"Electabuzz","type1":"electric","desc":"Electabuzz appears as a yellow rodent-like Pokémon with blue lines and yellow rings on its body. It is known for its energetic and excitable personality. It uses moves that allow it to control electricity, such as Thunderbolt and Thunder."}
{"name":"Magmar","type1":"fire","desc":" Magmar is a Fire-type Pokémon that appears as a small, bipedal lizard with a red and orange torus. It has a flame at the end of its tail; the flame is constant, even during fierce battles. Its moves often consist of explosive fire blasts and intense heat rays. "}
{"name":"Pinsir","type1":"bug","desc":"Pinsir is typically described as a large, insectoid Pokémon with a yellow and brown body and a pair of large front pincers. They are known to be intimidating in appearance and have a strong will to protecting their territory."}
{"name":"Tauros","type1":"normal","desc":"Tauros, the Thunder Crash Pokémon, is a quadruped Pokémon with a brown body, white underbelly, and a crest on its forehead. It is known for its incredible speed and imposing presence. It is often found on grasslands and open plains, where it can be seen migrating and traveling in large herds."}
{"name":"Magikarp","type1":"water","desc":"Magikarp is a blue, scaled fish-like Pokémon with a long, pointed snout and a mostly blank expression. It is often found in rivers and lakes. Magikarp is known for its tendency to jump and splash water, which can be used for various attacks."}
{"name":"Gyarados","type1":"water","desc":"Gyarados is a powerful and imposing fish-like Pokémon with a distinctive dragon-like head and a long, serpentine body. It is known for its intimidating presence and its ability to hold its breath for long periods of time. Gyarados is a fast and powerful swimmer, known for its high speed and its ability to evade attacks. Some common moves for Gyarados include Dragon Dance, Aqua Tail, and Crunch."}
{"name":"Lapras","type1":"water","desc":"Lapras is a large, whale-like Water/Ice-type Pokémon with a creamy-white and darker gray body. It has a distinctive fin on its head and a large body that can be intimidating. Lapras is said to have a calm and gentle nature, but can be aggressive if threatened."}
{"name":"Ditto","type1":"normal","desc":"Ditto is a pink, spherical Pokémon with no discernible features. Its small size is due to its body being highly malleable.  It has the ability to transform into any Pokémon it encounters with a high level of accuracy and speed. Ditto is  known for being a highly powerful mimic.  Its ability, Imposter allows it to perfectly mimic the stats and appearance of the Pokémon it copies."}
{"name":"Eevee","type1":"normal","desc":"Eevee is a small, rodent-like Pokémon with a brown and white, furry body. It has a large tail with a fluffy tuft of longer fur at the end. Eevee is known for its ability to evolve into multiple different species. Despite its small size, it has a significant amount of energy and often demonstrates impatience."}
{"name":"Vaporeon","type1":"water","desc":"Vaporeon is a Water-type Pokémon with a blue, quadruped body covered in a thin, grey fur and six tentacles coming out of its back. It has yellow eyes and a white underside. It's said to possess a compassionate nature and can communicate through a series of musical note-like sounds."}
{"name":"Jolteon","type1":"electric","desc":"Jolteon's eyes glow in the dark. This Electric-type Pokémon has striking yellow fur that becomes more feline in its movements. Jolteon typically has four white paws on each foot and white markings on its back and tail."}
{"name":"Flareon","type1":"fire","desc":"Flareon is the Fire-type evolutions of Eevee. It has a large quill tail like object, resembling an orange flame, and is covered in a fluffy, yellow fur. Flareon is known for its energetic, brave and competitive characteristics."}
{"name":"Porygon","type1":"normal","desc":"Porygon is a virtual Pokémon that resembles a cube composed of multiple smaller cubes. It is known for its high defense and special defense, making it a sturdy choice. Porygon can learn a variety of moves, including Tri Attack and Iron Head."}
{"name":"Omanyte","type1":"rock","desc":"Omanyte, the Turtle Pokémon. It is the prehistoric Pokémon that was buried in the ground for thousands of years.\nIt has two shells in Omanyte, a red outer shell and a pinkish inner shell."}
{"name":"Omastar","type1":"rock","desc":"Omastar is a large, muscular Pokémon with a predominantly green, gray, and white coloration. Its body is shaped like a teardrop, with a long tail that it often uses for defense. It has a variety of moves available, including powerful Water and Rock-type attacks."}
{"name":"Kabuto","type1":"rock","desc":"Kabuto is a dinosaur-like Water-type Pokémon with a sturdy shell on its back, a long tail, and several sharp, jagged fins on its neck and legs. It has a rough, scaly texture to its body. Kabuto is known to be proud and independent, often having its own way and not taking kindly to orders from others."}
{"name":"Kabutops","type1":"rock","desc":"Kabutops is a large, amphibious Pokémon with a turtle-like shell on its back and webbed feet. It has a stern and intimidating appearance, reflecting its strong and fearless nature. It is known to be a skilled and ruthless hunter."}
{"name":"Aerodactyl","type1":"rock","desc":"Aerodactyl is a large, dragon-like Pokémon with a gray and white body. Its wingspan is vast and incredibly strong wings allow it to fly at high speeds. Aerodactyl is a ferocious and fiercely independent Pokémon."}
{"name":"Snorlax","type1":"normal","desc":"Snorlax is a large, quadruped Pokémon with a thick, blue body and a distinctive yellow line running along its back. It has a flat face, a short snout, and two large ears. Despite its massive size, it is incredibly lethargic and has a tendency to fall asleep at any moment."}
{"name":"Articuno","type1":"ice","desc":"A large, white, avian Pokémon with a distinctive crest on its head and feathers that resemble ice crystals. It is known for its impressive speed and agility, as well as its ability to fly at high altitudes. It is said to possess the power of snow and ice, and is often associated with winter."}
{"name":"Zapdos","type1":"electric","desc":"Zapdos, the Lightning Bird Pokémon. It is said to have the ability to generate powerful lightning with electric charges in the air. It is highly valued in Pokémon battles for its electric-type moves and exceptional speed, making it a formidable opponent."}
{"name":"Moltres","type1":"fire","desc":"Moltres, a Fire/Flying-type Pokémon, is known for its large wingspan, with a majestic appearance featuring wings spread wide, bird-like head, and fiery plumage. It is often associated with volcanic regions and is said to carry the souls of the dead to the afterlife. Moltres is infamous for its intense heat and powerful fire-themed moves."}
{"name":"Dratini","type1":"dragon","desc":"Dratini is a long, snake-like Pokémon with a turquoise, lizard-like head and a tail with a blue and pink flowing color, resembling a dragon. Its slender body, often covered with moist skin, has small light brown spots. Dratini also possesses a row of large teeth on the bottom of its jaw, representing a very primitive-to-advanced snouted predatory creature type."}
{"name":"Dragonair","type1":"dragon","desc":"Dragonair is a creature that has a combination of serpentine and dragon-like appearance. It is known to be very quick and highly agile, able to be spotted flying through the sky with its magnificent wings. In the game, it is often associated with an energetic and agile character who fights with swift flying attacks."}
{"name":"Dragonite","type1":"dragon","desc":"A large, dragon-like Pokémon with a gray and white body, red eyes, and a distinctive red fin running along its back. It has a strong, proud character and is typically considered to be a fast and formidable flyer. Some common moves include Outrage, Draco Meteor, and Dragon Dance."}
{"name":"Mewtwo","type1":"psychic","desc":"Mewtwo, known for its intimidating appearance with a sleek black and white color scheme, has powerful psychic abilities that often make it seem menacing. It is an extremely rare and elusive species characterized by its intense and complex personality. When in battle, Mewtwo is known for using powerful moves such as Psystrike and Shadow Ball."}
{"name":"Mew","type1":"psychic","desc":"Mew's appearance is a small, pink creature with a tiny crown of spikes or a 'crown' on top of its head. As for its character, Mew is often considered to be intelligent, curious, and non-violent yet a powerhouse when needs must. Some of the moves, Mew is commonly associated with are ☃:Move:Transform, ☃:Move:Rest, ἳa:Move:Featherdance & ٥:move:Punish."}
{"name":"Chikorita","type1":"grass","desc":"Chikorita is a grass-type Pokémon with a small, green body, large leaves on its head, and a cute expression. It has a gentle and calm nature, often seen with its innocence unshaken. It has the ability to photosynthesize and produce chlorophyll."}
{"name":"Bayleef","type1":"grass","desc":"Bayleef is a bipedal, herbivorous Pokémon with a predominantly green body, featuring large, oval-shaped leaves on its head, shoulders, and back. It has three small, yellow flowers on its neck."}
{"name":"Meganium","type1":"grass","desc":"Meganium the large, plant-like Pokémon with a broad, leafy arms and a relatively flat face. It is a massive and sturdy Pokémon, and can grow up to 5 meters tall. It is also one of the evolved forms of Bayleef."}
{"name":"Cyndaquil","type1":"fire","desc":"It has a small, plump rodent body covered in a soft, venomous quill on the end of its back. It has a small, round face and ears on the top of its head. It is a Fire-type Pokémon. "}
{"name":"Quilava","type1":"fire","desc":"Quilava is a Fire-type Pokémon that has a sturdy appearance with a lion-like head, powerful legs, and a long, thin tail. It is said to be fiercely loyal and can be very protective of its friends and allies. Its repertoire of moves includes Fire Spin, Ember, and Flame Wheel."}
{"name":"Typhlosion","type1":"fire","desc":"Typhlosion, the Lizard-like Pokémon, has a predominantly orange body with a flame forming on the end of its tail. It has a spirited and mischievous personality, often causing trouble for its trainers. Its moves include Flame Wheel, Eruption, and Flame Charge."}
{"name":"Totodile","type1":"water","desc":"Totodile is a small alligator-like Pokémon with a grey and yellow body. It has a distinctive pair of sharp teeth and powerful jaws. It is known for its fierce and territorial nature."}
{"name":"Croconaw","type1":"water","desc":"Croconaw is a large, alligator-like Water-type Pokémon with a tough, scaly skin. Its body is mostly gray, with dark green stripes running down its back. Its eyes are a bright, golden yellow color and it has a long, tooth-filled snout. It is very aggressive but gentle at the same time."}
{"name":"Feraligatr","type1":"water","desc":"Feraligatr is a large Water/Ground-type Pokémon that appears as a massive, alligator-like creature with a grayish-green body, a long snout, and powerful jaws. As a Water-type Pokémon, it thrives in aquatic environments, while its Ground-type traits grant it toughness and endurance. With its powerful jaws and sharp teeth, Feraligatr is capable of delivering extremely powerful bites and attacks."}
{"name":"Sentret","type1":"normal","desc":"Sentret is a small, rodent-like Pokémon with a brown and grey coat, large eyes, and a fluffy tail. It is a wild Pokémon and is often found in dense forests and caves. Sentret is known for being curious and highly energetic."}
{"name":"Furret","type1":"normal","desc":"Furret is a brown, rodent-like Pokémon with large front paws and sharp teeth. It has a small nose, big ears, and a sharp, whisker-like facial hair. Furrets are known to be very curious and active, causing trouble for their trainers at times."}
{"name":"Hoothoot","type1":"normal","desc":"Hoothoot is a nocturnal, owl-like Pokémon with a gray and brown plumage. It has a distinctive hooting call and is known for its intelligence and mystery. Its moves include Whirlwind, Hoot, and Faint Attack."}
{"name":"Noctowl","type1":"normal","desc":"Noctowl is a nocturnal owl Pokémon that has a large nest on its head. It has a white body with black spots, and its large eyes can light up to navigate in the dark. Noctowl is known for being a wise and intelligent Pokémon and is said to have a strong sense of direction."}
{"name":"Ledyba","type1":"bug","desc":"Ledyba has a mostly yellow bug-type body. It has two large, round spots on its back and long, thin antennae. It's known for being very curious and loves to socialize."}
{"name":"Ledian","type1":"bug","desc":"Ledian is a Bug-type Pokémon with a small body, narrow wings, and two large antennae on top of its head. It is known to be quick and agile, making it a formidable opponent in battle. As for moves, Ledian can use both Bug-type and Flying-type attacks to overwhelm its opponents."}
{"name":"Spinarak","type1":"bug","desc":"Spinarak, a Bug/Poison-type Pokémon, has a reddish-brown body with white spots and its characteristic web-like features. It is primarily insectivorous and is known to inhabit grasslands and forests. As a spider-like creature, it skillfully manipulates its webs to ensnare its prey."}
{"name":"Ariados","type1":"bug","desc":"Ariados is a Dark/Poison-type Spider Pokémon that appears to be a large, black spider with a long, slender body and eight legs that can move quickly. It is known to be a formidable hunter, using its speed and agility to catch its prey. Ariados can use its poisonous fangs to attack its opponents and possess a variety of moves, including Poison Fang and Signal Beam."}
{"name":"Crobat","type1":"poison","desc":"A dark blue, insect-like, bat-winged Pokémon with sharp teeth and pointed ears. It is known for its sharp flying skills and stealthy movements. This Pokémon has a swift and deadly poison sting."}
{"name":"Chinchou","type1":"water","desc":"A tike-like Pokémon with blue skin. It has big, round eyes and is known for its ability to emit electricity. It is often found near the ocean."}
{"name":"Lanturn","type1":"water","desc":"Lanturn is a marine Pokémon with a bulbous oval body, a large bulb on its forehead that glows bright blue, and a long tail that looks like a sail. It has a blue oval-shaped body and yellow circular eyes. Lanturn uses its powerful bioluminescent tail to combat its opponents. Its character is tranquil and gentle."}
{"name":"Pichu","type1":"electric","desc":"Pichu is a small, rodent-like Pokémon with yellow fur and orange cheeks. It has large red circular eyes and a brown V-shape on its forehead. It is known for its energetic and lively nature, often considered to be mischievous."}
{"name":"Cleffa","type1":"fairy","desc":"Cleffa are small, elephant-like Pokémon that are usually found on rocky mountains. They have a very endearing and cute appearance. They can use moves like Pound and Metronome to attack its opponents."}
{"name":"Igglybuff","type1":"normal","desc":"Igglybuff are pastel-colored, fluffy Iguanodon-like Pokémon with cute appearances and soft facial expressions. They have big round eyes and buttons on their nose. They are very affectionate and friendly towards others."}
{"name":"Togepi","type1":"fairy","desc":"Togepi is a small, egg-like Pokémon with a round body that is pink and white in color. It has a cute and endearing appearance, often with a small face and two large eyes. Togepi is known for its friendly and innocent personality, and is often described as cute and adorable. Its possible moves include Pound, Sand Attack, and Egg Bomb."}
{"name":"Togetic","type1":"fairy","desc":"Togetic, the Bird Pokémon. Type: Normal/Flying. It has a bird-like body covered in mostly yellow plumage with a distinctive red ribbon on its head."}
{"name":"Natu","type1":"psychic","desc":"Natu has a gray, yellow, and white plumage with the ability to read the atmosphere. This small bird-like Pokémon seems to have an energetic and quick nature."}
{"name":"Xatu","type1":"psychic","desc":"Xatu are bird-like Pokémon that have a blue, yellow, and brown plumage. They are said to possess celestial knowledge and can foresee the future. In battle, they use psychic powers and swift movements to outmaneuver opponents."}
{"name":"Mareep","type1":"electric","desc":"Mareep is a Electric-type Pokémon that has a sheep-like appearance with a yellow body, white belly, and a tuft of wool on its head. It is known for being energetic and having a strong sense of curiosity. As for its moves, Mareep can use powerful Electric-type attacks in battle such as Thunder Shock and Zap Cannon."}
{"name":"Flaaffy","type1":"electric","desc":"Flaaffy is a rodent-like Pokémon with a blue body, a small head, and long, fluffy tail. It has a distinctive crest on its head that resembles a Mynraft flame. Flaaffy has a calm disposition, and its long whiskers are said to be highly sensitive to the atmosphere."}
{"name":"Ampharos","type1":"electric","desc":"Ampharos, the Light Pokémon. Type: Electric. It has a yellow Wool from which hundreds of soft, downy hairs protrude from its fluffy head, blue stripes run across its ears, and an antennal structure supported by many short hairs at its forehead. Ampharos can generate and radiate light, which is powerful enough to banish fog for miles. It radiates light from its entire body at night, and using electricity."}
{"name":"Bellossom","type1":"grass","desc":"Bellossom is a grass-type Pokémon that resembles a tropical hibiscus plant. It has large, showy flowers on its ends that are sensitive to electrical attacks. It is able to move using its long stem and petiole, quickly escaping from predators."}
{"name":"Marill","type1":"water","desc":"Marill is known for its mouse-like appearance with large eyes and a red patch on its cheeks. It is often described as playful and energetic, with a love for water bodies. Marill is known to use its speed and agility to its advantage, and has a variety of moves up its sleeve including 'Tackle' and 'Waterfall'."}
{"name":"Azumarill","type1":"water","desc":"Azumarill has three long, flowing tails and three longer, more slender ears that are blue or pink in color. Its face is round with a blue shell over its eyes, and it has brown spots on its ears, spots on its snout and a black and pink mouth with a white and pink belly on its Snubbull form. It also has a long, pink-colored shell on its torso. Azumarill is a very playful, lovely, natured entity while it is a big love bug, in a loving relationship."}
{"name":"Sudowoodo","type1":"rock","desc":"Sudowoodo is a Plant-type Pokémon with the ability to disguise itself as a tree stump. It has a rocky exterior with the texture of tree bark and comes to life at dusk. It can use its agility to dodge attacks and then retaliate with powerful moves to defend itself."}
{"name":"Politoed","type1":"water","desc":"Politoed is a Water-type Pokémon that has a amphibious appearance. It has three Water-type Pokémon, Piplup, Popplio and Poliwag the first has a penguin appearance, the second has a seal appearance and the third has  a toad-like appearance though Politoed has a frog-like appearance. Politoed is the final evolution of Poliwag."}
{"name":"Hoppip","type1":"grass","desc":"Hoppip appears as small, umbrella-like Pokémon with a green body and a red stem on its back, and red berries on its branches. It is a gentle and peaceful creature that can be found in forests. Hoppip can learn to use powerful moves such as Solar Beam and Fly."}
{"name":"Skiploom","type1":"grass","desc":"Skiploom is a yellow, insect-like Pokémon with a spade-shaped crest on its forehead. It has a slender, elongated body with a pair of large, round eyes. Skiploom is known to be gentle and docile, and it uses its speed and agility to move quickly through the air."}
{"name":"Jumpluff","type1":"grass","desc":"Jumpluff has a powder puff for a body and two long, fluffy arms that can move independently. Jumpluff has a very cheerful and carefree personality. It often attacks with quick movements and uses its powerful blow to create a gentle breeze."}
{"name":"Aipom","type1":"normal","desc":"Aipom is a monkey Pokémon that resembles a monkey. It possesses a long tail and has a mixture of brown and gray fur. Aipom is known for its exceptional jumping ability and quick thinking."}
{"name":"Sunkern","type1":"grass","desc":"Sunkern is a field Pokémon with a sunflower-like design. It has yellow petals and long stem, making it appear similar to a sunflower. Sunkern is often very timid and shy at first. Regarding it's moves, Sunkern is often known to use nature-based moves."}
{"name":"Sunflora","type1":"grass","desc":"Sunflora is a Grass/Poison-type Pokemon that has a blooming body from its shoulders to its tail. It is a small and sprite like Pokemon with a lovely appearance and is known for being very gentle and very determined. Sunflora has the ability to perform photosynthesis allowing it powerful sunlight-type moves."}
{"name":"Yanma","type1":"bug","desc":"A medium-sized, moth-like Pokémon with a slender body, large wings, and two compound eyes. It is known to be very fast and agile. In terms of character, it's said to have a lot of pride and will be quite haughty if its pride is wounded. It often carries small rocks or other items in its proboscis and has a number of poisonous spikes on its underside."}
{"name":"Wooper","type1":"water","desc":"Wooper is a Water/Flying-type Pokémon that appears as a small, blue creature with a round, mud-crusted body and a pale purple underside. It has a flat, round head and a relatively short tail, and its body is flattened on top. It has been observed as being relatively shy but also kind in nature."}
{"name":"Quagsire","type1":"water","desc":"Quagsire are amphibious Pokémon that resemble otters with long, slender bodies, often appearing gray-blue or brown in color. Their appearance may change depending on their relation to water, with dry Quagsire appearing more desiccated. Quagsire are known for their strong sense of responsibility and gentle nature."}
{"name":"Espeon","type1":"psychic","desc":"Espeon is known for its slender, sensual appearance with a light blue-purple colored skin and a white underside. According to its character in the Pokémon anime, Espedon is depicted as elegant and mystical. In terms of moves, this Pokémon is known to possess a variety of magical or ESP-type attacks such as Psycho Cut, Shadow Ball and Moonblast."}
{"name":"Umbreon","type1":"dark","desc":"Umbreon is a Dark-type Pokémon with a slender, quadruped body covered in a velvety black fur. It has triangular ears and a fluffy tail. As its name suggests, it has extremely sensitive vision and its eyes glow like the light of the moon. In the wild, it is nocturnal and uses its incredible running speed and agility for hunting at night. It is said that Umbreon's glowing eyes can see through things and sense its opponents."}
{"name":"Murkrow","type1":"dark","desc":"Murkrow is a medium-sized black bird-like Pokémon with a sharp, hooked beak and crimson eyes. It has a distinctive black plumage with a large beak and legs, giving it a menacing appearance. Murkrow is known for being dark and ominous, often being associated with bad luck."}
{"name":"Slowking","type1":"water","desc":"Slowking is a large, lobster-like Pokémon with a crown-like structure on its head. It has high intelligence and can often be seen with a regal demeanor, especially when interacting with other Pokémon. Slowking is known to use powerful psychic and water-type moves, including Hydro Pump, Ice Beam, and Surf."}
{"name":"Misdreavus","type1":"ghost","desc":"Misdreavus, the Mysterious Pokémon, is a Ghost-type Pokémon known for its floating, green cat-like body and two glowing red eyes that give off an aura of otherworldly terror. Its eerie appearance allows it to move around unseen and strike fear into the hearts of its opponents. Misdreavus is known for its ability to use Ghost-type moves to disorient and confuse its opponents."}
{"name":"Unown","type1":"psychic","desc":"Unown is a mysterious Pokémon with a variety of appearances, including different letter combinations on its body. It has been known to appear in a variety of places, from ancient ruins to modern-day cities. In terms of its move set, Unown knows a variety of powerful attacks, including Psychic, Sound Wave, and Shadow Ball."}
{"name":"Wobbuffet","type1":"psychic","desc":"Wobbuffet is a Normal-type Pokémon found in the wild and can be seen making appearances with a confused look on its face. It appears to be a humanoid-like Pokémon, sporting a blue and yellow outfit. Wobbuffet is known for copying its opponents' moves to be used as its own."}
{"name":"Girafarig","type1":"normal","desc":"Girafarig is a quadruped with the upper body of a rabbit and the lower body of a monkey. It has a relatively high level of intelligence, which is reflected in its name, which comes from the words 'giraffe' and 'rabbit'. Girafarig is known for using its long neck to balance on its hind legs while fighting."}
{"name":"Pineco","type1":"bug","desc":"Pineco is an insect Pokémon that resembles a pinecone. It is roughly spherical in shape with a forest green, woody exterior. It has a tough exoskeleton that resembles a pinecone."}
{"name":"Forretress","type1":"bug","desc":"Forretress is a Bug/Steel-type Pokémon with a spherical body resembling a bug's carapace, with a maw on its lower part and metallic protrusions resembling 'arms'. It has a rather slow pace but can transform into its core to evade dangerous situations. Forretress moves using its 'arms' and can spin its body via spinning with its core part."}
{"name":"Dunsparce","type1":"normal","desc":"Dunsparce is a rodent-like species with a long, thin body resembling a rodent with a pair of arms. Its body is sandy brown in color with 15 white spots on each side. In terms of character, it is known to be a 'Clever Mouse'."}
{"name":"Gligar","type1":"ground","desc":"Gligar is a Bug/Dragon-type Pokémon with a sleek, streamlined body featuring a central, flat tail, a pair of angular, antler-like features on its neck, and large, dark-colored wings. It has a predominantly brown and yellow color scheme. It has a relatively laid-back and neutral demeanor."}
{"name":"Steelix","type1":"steel","desc":"Steelix appears as large, serpent-like Pokémon with thick steel plates covering its body. It has a long neck and a series of jagged bony protrusions running down its body. Steelix is often depicted as a wise and gentle creature, with a calm demeanor, particularly at first, and becomes more aggressive and intimidating upon being woken from sleep."}
{"name":"Snubbull","type1":"fairy","desc":"Snubbull has a predominantly white and pink body, with its ears and paws having white markings."}
{"name":"Granbull","type1":"fairy","desc":"Granbull is a quadruped dog-like Pokémon, with a sturdy build and a distinctive pair of long ears. It has a gentle and outgoing character, often depicted as having a kind and relaxed demeanor. It is said to have the ability to see into people's hearts and is known to be quite affectionate towards its trainers. One of its notable moves is the ability to use a powerful bite attack, as well as its capacity for healing"}
{"name":"Qwilfish","type1":"water","desc":"A dark purple, ovoid fish-like Pokémon that possesses the ability to store needles in its body, which it uses for defense."}
{"name":"Scizor","type1":"bug","desc":"Scizor is a Steel/Bug-type Pokémon with a predominantly metallic exoskeleton and a more efficient metabolism than its pre-evolution Magnemite. It has the appearance of a mechanical scorpion with a distinctive, blue, shell-like carapace. It is often seen as a predator, with its harsh and unyielding nature making it a formidable opponent."}
{"name":"Shuckle","type1":"bug","desc":"Shuckle is a small, brown, pillbug-like Pokémon with a shell covering its back. It has a long, thin tail and big, round eyes. Shuckle uses its long tail to swing from tree to tree, and it can store a variety of items in its shell for later use. Moves: Bind, Rollout, Stomp, and Sand Attack."}
{"name":"Heracross","type1":"bug","desc":"Heracross has a primarily orange body with black wings and a distinctive V-shaped scarring on its forehead. It is known as a gentle-but-strong and fiercely-independent creature."}
{"name":"Sneasel","type1":"dark","desc":"A snow-form Brown or white, dual-ice/steel type with sharp claws and agile movements"}
{"name":"Teddiursa","type1":"normal","desc":"Teddiursa is a small, mammalian Pokémon with a generally bear-like appearance, having a stocky build and light brown fur, along with a flat, button-like nose, relatively small ears and eyes that appear almost laughably innocent"}
{"name":"Ursaring","type1":"normal","desc":"Ursaring appears to be a large, bear-like Pokémon with orange-brown fur and a distinctive mane of brown fur running along its neck. It is known to be a powerful and fiercely independent creature. In battle, Ursaring can use a variety of powerful moves such as Hammer Arm and Focus Punch."}
{"name":"Slugma","type1":"fire","desc":"Slugma, the Magma Slug Pokémon. Type: Fire. A slug that lives in magma. It's covered in a thick layer of magma, which is replenished continually to prevent it from evaporating."}
{"name":"Magcargo","type1":"fire","desc":"Magcargo is a Fire/Poison-type Pokémon that resembles a snail, with a light brown shell and a pinkish-gray bottom. It has a distinctive pair of horns on its head and is known for being fiercely territorial. Magcargo is said to be able to withstand extremely high temperatures."}
{"name":"Swinub","type1":"ice","desc":"Swinub is a small, pig-like Pokémon with a stout body and short legs. It has a round, fleshy snout and two small tusks. As a mole-like Pokémon, it is known to dig tunnels and burrows in the ground, and often possesses the ability to deal damage with its sharp claws and the earth-based Ice-type move 'Mud Shot'."}
{"name":"Piloswine","type1":"ice","desc":"Piloswine is a large, mammal-like Pokémon with a white body and a long, shovel-shaped snout. It has a distinctive pair of tusks and a thick, woolly coat. Piloswine is known for its aggressive behavior and is said to emit a frosty aura through its trunk, allowing it to lower the temperature around it and increase its strength."}
{"name":"Corsola","type1":"water","desc":"Corsola is a Water/Dk-type Pokémon also known for being weak to numerous types as well as having a very defensive playstyle and is a large, sentinel-like sea anemone Pokémon with three round, pinkish-brown bells on the end of its stalk."}
{"name":"Remoraid","type1":"water","desc":"Remoraid are small, fish-like Pokémon with a gray body and a long, snake-like tail. They live underwater and are known to be quite fast. They can evolve into Octillery by leveling up while knowing a water-type move."}
{"name":"Octillery","type1":"water","desc":"Octillery is an octopus-like Pokémon that has eight  arms and big, round eyes. It is mostly blue with a yellow underside. Octillery is known for its speed and intelligence."}
{"name":"Delibird","type1":"ice","desc":"A yellow bird with a red and white delivery uniform, known for its ability to generate and use snowball-based moves to aid in its delivery missions, having an intelligent character mostly like in humans, able to learn various moves like icy grip."}
{"name":"Mantine","type1":"water","desc":"Mantine is an enormous, slow-moving aquatic Pokémon with a manta ray-like appearance. It has a large, flat body covered in a thick layer of skin that protects it from injury, and it can grow up to 3 meters in width. In character, Mantine is known for being gentle and laid-back, but it is fiercely protective of its territory and will not hesitate to defend itself if threatened. It knows a variety of powerful moves, including powerful Hydro Pump and Rapid Spin, as well as support moves like Heal Bell and Soft-Boiled. From prehistoric times, its ancestors passed down a highly respected status in those times due to its impressive gentle moveset."}
{"name":"Skarmory","type1":"steel","desc":"Skarmory is a Steel/Flying-type Pokémon with a body covered in a layer of feathers, giving it a white and gray appearance. It is known for its impressive defenses and high attack power. Skarmory is often found in coastal areas and is said to be able to withstand harsh winds with its rigid feathers."}
{"name":"Houndour","type1":"dark","desc":"Houndour is a Dark/Fire-type Pokémon that appears as a canine creature with a primarily dark orange or brown body and black stripes, featuring a black tail and black markings on its face. Its lean and agile body suggests its exceptional swiftness and acrobatic abilities. It possesses 8 incredibly low-damage moves as a base such as Smog, Growl, Knock Off, Fire Spin, Sand Stream, Crunch, Stone Edge, Rock Blast"}
{"name":"Houndoom","type1":"dark","desc":"Houndoom is a Dark/Fire-type Pokémon known for its intimidating appearance, with a predominantly dark gray body, yellow eyes, and distinctive yellow markings. Its facial expression often appears aggressive and alert, reflecting its fiercely independent and sometimes antagonistic nature. In terms of moves, Houndoom can employ Dark-type strategies like Dark Pulse and Fiery-type moves like Flamethrower and SmokeScreen."}
{"name":"Kingdra","type1":"water","desc":"Kingdra is a blue, dragon-like Pokémon with a large crest on its forehead and a long, slender body. It has a complex and intimidating appearance. It is known to be a formidable swimmer and is often associated with a strong and bold character."}
{"name":"Phanpy","type1":"ground","desc":"Phanpy, a normal-type Ground/Rock-type Pokémon, appears as a small elephant-like Pokémon with a sturdy body and a distinctive trunk. It has a childlike innocence and curiosity, often playing and causing mischief in its habitat. Some of Phanpy's notable moves include Tackle, Growl, and Defense Curl, showcasing its adaptability in battle"}
{"name":"Donphan","type1":"ground","desc":"Donphan is a large, elephant-like Pokémon with a sturdy body and a flat, circular back. Its appearance can range in color from gray to brown. It has a long, curved tusk on its mouth and four stumpy legs."}
{"name":"Porygon2","type1":"normal","desc":"The digital Pokémon, Porygon2, is a synthetic, cybernetic being resembling a small, blue and white cube or a sphere. It has the ability to assimilate data, adapting to different environments. It can download and use other Pokémon's moves for attacks, as well as change forms through data transfer."}
{"name":"Stantler","type1":"normal","desc":"Stantler are large deer-like Pokémon. They are usually brown in color, with four large horns on their head and a large white stripe on their forehead. They can move swiftly and are known to be able to jump over certain obstacles to escape danger."}
{"name":"Smeargle","type1":"normal","desc":"It has a smudge-like mark on its flat face and its arms. Its hand is tipped with a paintbrush-like organ that can create precise brushstrokes when it's drawn to battle. Smeargle resemble the olinguito in real life."}
{"name":"Tyrogue","type1":"fighting","desc":"Tyrogue is a Humanoid Pokémon that resembles a young boy. It has a humanoid body with a few distinct features, such as ears and a nose. It's known for its unique appearance, aggressive nature, and powerful physical moves, including Crunch, High Jump Kick, and Brick Break."}
{"name":"Hitmontop","type1":"fighting","desc":"Hitmonlee's mirror counterpart, Hitmontop resembles a martial artist due to its appearance of being a humanoid martial artist. The first Pokémon in the Hitmon duo with a human-like physique, Hitmontop is well-trained in martial arts. It's trained in kicking martial arts, aiming to kick opponents at incredibly high speeds."}
{"name":"Smoochum","type1":"ice","desc":"Smoochum is a Water/Ice-type Pokémon with pink fur and a face that resembles a cat. It has small, bat-like ears and a long, fluffy tail. Smoochum are often described as cute, yet clumsy creatures."}
{"name":"Elekid","type1":"electric","desc":"Elekid appears as a child wearing a lab coat. It has blue overalls with a red stripe on the side, and yellow sleeves with two red lines. It has a black hat with yellow trim and purple shoes. It is a Electric-type Pokémon known for being curious and energetic."}
{"name":"Magby","type1":"fire","desc":"Magby is a fire/ground type of Pokemon. It has small arms and two distinctive fiery red horns on its head with a long tail. It is quite fierce and wild in nature, however, tends to be gentle upon understanding."}
{"name":"Miltank","type1":"normal","desc":"Miltank is a large, thick-bodied Pokémon with a cow-like appearance. It has a brown coat with white patches and a white tail with a brown tip. Miltank is known for its gentle demeanor and caring nature."}
{"name":"Blissey","type1":"normal","desc":"Blissey is a Normal-type Pokémon with a large, pink, spherical body and a large, round face with a cute expression. It is known for its gentle and caring nature, often described as a mother figure to its allies. Blissey is capable of learning a variety of support moves, including Light Screen, Reflect, and Heal Bell, as well as physical attacks like Hyper Beam and Shadow Ball."}
{"name":"Raikou","type1":"electric","desc":"Raikou is a dark-white, quadruped wolf-like Pokémon with a lion-like mane and a short, stubby tail. Raikou is known to be a fierce and proud creature with a strong will, but can also be calm and laid-back. Raikou has the ability to wield the power of thunder and can learn moves such as Thunderbolt and Wild Charge to amplify its abilities."}
{"name":"Entei","type1":"fire","desc":"Entei has a lion-like appearance, small tusks, and a fluffy mane. It is known for its pride and courage. It is a powerful Fire-type Pokemon with moves like Fire Blast and Flame Wheel."}
{"name":"Suicune","type1":"water","desc":"Suicune has a slender, blue body with a horse-like head and mane. It is known for its incredible speed and agility. In terms of moves, it can use Ice Fang, Hydro Pump, and Aqua Tail."}
{"name":"Larvitar","type1":"rock","desc":"Larvitar has a rock-like appearance with a small body, and it also has a small mouth on its head as well as a small rock-like tail."}
{"name":"Pupitar","type1":"rock","desc":"Pupitar is a Rock/Dragon-type Pokémon that appears as a more mature and rectangular version of Trapinch, with large, red eyes and a set of sharp, rock-like protrusions on its back. It has a rather menacing appearance but its demeanor is calm and determined. It can use powerful moves such as Dragon Claw and Crunch to defend itself."}
{"name":"Tyranitar","type1":"rock","desc":"Tyranitar, the Crusher Pokémon. Tyranitar has the appearance of a massive, hulking creature with gray rock-like body and a pair of arms. It is known for its incredible strength and aggressive behavior, using its powerful moves to crush its opponents."}
{"name":"Lugia","type1":"psychic","desc":"a large, white bird-like Pokémon with a crest on its head and a dignified appearance. It is known to be a gentle and noble creature. Lugia can learn powerful moves such as Aeroblast, Psychic, and Moonblast."}
{"name":"Ho-Oh","type1":"fire","desc":"Ho-Oh is a majestic, avian Pokémon with a predominantly white plumage, often colored silver, and a golden crest on its forehead, with a Phoenix-like appearance and impressive wingspan. Known for its benevolent nature, Ho-Oh is revered as a sacred creature, emitting soothing aura and often acting as a symbol of peace. As a fiery bird Pokémon, Ho-Oh can inflict devastating fire-type attacks through 'Incinerate' and 'Sacred Fire'."}
{"name":"Celebi","type1":"psychic","desc":"Celebi is a small, leafy Pokémon that resembles a small deer. It has a green and brown body, large, round ears, and big, round eyes. It is also known for its high speed and agility, allowing it to quickly move from place to place. Some of its notable moves include Quick Attack, Recover, and Reflect Shield."}
{"name":"Treecko","type1":"grass","desc":"Treecko is a green, Geckolike Pokémon with blue and yellow markings on its body. It is characterized as quiet and careful, often being described as the calmest of all the starter Pokémon. As a Grass-type Pokémon, it can often be found making leaps between trees, and its speed is impressive for its size."}
{"name":"Grovyle","type1":"grass","desc":"Grovyle is a dual Grass/Dragon-type Pokémon with a slender body covered in green and yellow scales, giving it a camouflage look in the forest. It has a large yellow crescent mark on its forehead and is known to be very agile and quick. In terms of moves, Grovyle is known to use Leaf Blade, Solar Beam, and Dragon Pulse to tackle its opponents."}
{"name":"Sceptile","type1":"grass","desc":"Sceptile is the final evolution of Treecko and has a green, leaf-like body with a tall, carrot-like antenna on its head. It is a fast and agile Pokémon with a strong connection to nature. Its appearance can vary depending on the light with a sharp and vibrant sheen in bright conditions. Sceptile is known for being a bold and proud Pokémon that will not back down to any opponent. It possesses a diverse range of moves, like Solar Beam, Leaf Blade, and Dragon Dance that allows it to be a powerful and agile battler in the Pokémon league."}
{"name":"Torchic","type1":"fire","desc":"Torchic is a small, chicken-like Pokémon with a mainly yellow body, often with a bit of black on the top of its head and orange markings around its eyes and on its tail giving the appearance of being on fire. Like other starter Pokémon, it is known to be fiery, having a fierce battle spirit that will not back down even in the face of adversity. It's common for it to evolve its fire powers as the situation calls for it."}
{"name":"Combusken","type1":"fire","desc":"Combusken, A large, predominantly orange bird Pokémon with black wings and a long tail. This fiery bird Pokemon is known for its speed and physical strength but also sometimes can appear fiery and aggressive. Combusken can learn a variety of moves including fire, fighting , and ground"}
{"name":"Blaziken","type1":"fire","desc":"Blaziken is a powerful and intimidating bird-like Pokémon with a muscular build. Its feathers are primarily orange, with a dark orange crest on its head and black on its lower mandible. As a Fire/Fighting-type, Blaziken is known for its sheer strength, fierce spirit, and powerful moves like Fire Punch and Flare Blitz."}
{"name":"Mudkip","type1":"water","desc":"Mudkip appears as a small blue puddling with yellow fins. Its small blue body, similar to a fish, is often seen moving quickly. Mudkip is the lowest stage of the Mudkip line but has potential to evolve into more powerful Pokémon, with earth-type moves available for more battle combat. This  Mouse-like Pokémon has its power originating from the mud within its body."}
{"name":"Marshtomp","type1":"water","desc":"Marshtomp is a Ground/Water-type Pokémon with a sturdy, toad-like body that is covered in yellow and blue spots. It has a flat, rounded head and big, round eyes. It is known for being a bit clumsy, but has a strong sense of responsibility and can be very loyal to its trainers. It primarily uses powerful physical attacks to take down its opponents."}
{"name":"Swampert","type1":"water","desc":"Swampert is a large, sluggish, and turtle-like Pokémon with a bulky grey body and six retractable claws. Its shell resembles that of a turtle with a narrow head, and its eyes are pale blue with a black pupil. Swampert is known to be fiercely territorial and aggressive, defending its surroundings with powerful moves."}
{"name":"Poochyena","type1":"dark","desc":"Poochyena is a canine Pokémon resembling a wild dog. It has a grey, spotty, and quite long body with large ears, a narrow jaw and the spotty nose of a normal dog. This wild Pokémon is known for its wild movements and howling howls in response to the movements of its peers."}
{"name":"Mightyena","type1":"dark","desc":"Mightyena is a dark-type Pokémon that resembles a large dog with a wolf-like appearance. It has yellowish-brown fur and black stripes on its body. As a highly skilled and resourceful Pokémon, it is known for its superior tracking skills and quick reflexes, often using its sharp teeth and agile movements to overpower its opponents."}
{"name":"Zigzagoon","type1":"normal","desc":"Zigzagoon is a quadruped rodent-like Pokémon with a slender dog-like body covered in brown and tan fur. It has three claws on each foot. It is often found running with an 'extra' leg sticking behind for speed."}
{"name":"Linoone","type1":"normal","desc":"Linoone are slender, rabbit-like Pokémon with a mostly white body and long ears and tail. They have a carrot-like base on their lower back with a few brown markings. They possess a peculiar gait that enables them to move swiftly and nimbly."}
{"name":"Wurmple","type1":"bug","desc":"A bug-type Pokémon with a yellow, caterpillar-like body. It has three black dots on its back and a short, stubby tail. Wurmple is known to be a curious and playful Pokémon, often fond of exploring its surroundings."}
{"name":"Silcoon","type1":"bug","desc":"Silcoon, the Cocoon Pokémon. Along Mulch, it lays its eggs in spots sheltered from sunlight. These eggs hatch into beautiful, fly-catching Butterfree. Its shell splits open and out flies a new Butterfree, still sporting the silken gills from its cocoon stage."}
{"name":"Beautifly","type1":"bug","desc":"Beautifly is a Bug/Flying-type Pokémon that has a large wingspan and a slender body, capable of reaching speeds of up to 150 mph. It has a calm demeanor and a noble spirit. Its moves include Quick Attack, Air Cutter, and Twister."}
{"name":"Cascoon","type1":"bug","desc":"Cascoon is a Bug/Poison-type Pokémon that resembles a cocoon. It has a distinctive, swirly pattern on its body and is covered in a protective, silky material. It has a gentle and calm demeanor, and can use its silk to envelop its foes."}
{"name":"Dustox","type1":"bug","desc":"Dustox typically appear with a mix of black, green, and yellow patches on its white body. They are generally characterized as strong Pokémon with a powerful stinger. They typically know Bug-type moves and are mostly lone travelers found in quiet areas."}
{"name":"Lotad","type1":"water","desc":"Lotad is a water/plant-type Pokémon with a long, curved body and large, flat leaves on its head. It often blooms with lotus-like flowers. It is known to be a natural, gentle creature that moves with beautiful elegance, but can be a bit shy and reserved at times."}
{"name":"Lombre","type1":"water","desc":"Lombre is a bipedal, humanoid water-type Pokémon with a distinctive mermaid-like appearance, featuring long green hair, a bright orange beard, and webbed hands. Despite its water-type, it has incredibly muscular physiques and retains its cute features. It can camouflage its tail to hide itself and is known to change its body shape frequently to blend in with its environment."}
{"name":"Ludicolo","type1":"water","desc":"Ludicolo is a Water/Ground-type Pokémon that resembles a tanuki with a large body and a long, thin tongue. It has a lumberjack outfit, which is worn by Woodo in the Crown Tundra area of Pokémon Sword and Shield. Ludicolo's long body and tongue give it a quite unique appearance in the wild."}
{"name":"Seedot","type1":"grass","desc":"Seedot is a small, yellow, and seed-bedecked Pokémon that resembles a plum tree sprout. It has a tiny chest and a seed bud above its forehead. Seedot is a timid and gentle creature"}
{"name":"Nuzleaf","type1":"grass","desc":"Nuzleaf is a dual Grass/Poison-type Pokémon, it appears to be a small, green, leaf-like creature with large eyes and a beak-like mouth. Nuzleaf can be known to be energetic and quick-witted, and it is said to be quite mischievous. In terms of moves, Nuzleaf can learn grass-type and poison-type moves, such as Solar Beam and Sludge Bomb."}
{"name":"Shiftry","type1":"grass","desc":"Shiftry is a Grass-type Pokémon that resembles a palm tree. It is known for its calm demeanor and acts as a guardian of the forest. It can learn moves such as Solar Beam, Razor Leaf, and Wood Hammer."}
{"name":"Taillow","type1":"normal","desc":"Taillow is a small, bird-like Pokémon with a brown body, white underside, and a distinctive crest on its head. They have a friendly and curious nature, often being found in large groups. Taillow can learn moves such as Peck and Aerial Ace."}
{"name":"Swellow","type1":"normal","desc":"Swellow has a blue head with yellow spots, a yellow body, and orange wings that are also adorned with yellow spots. It is known for its independence and can sometimes appear aloof to other Pokémon. Swellow is known to use swift and agile moves to outmaneuver its opponents."}
{"name":"Wingull","type1":"water","desc":"Wingull is a Bird/Flying type Pokémon that typically appears gray with a white abdomen and a beak. It has a distinctive white wing border. Wingull is known to be a very social Pokémon that will often be found near water "}
{"name":"Pelipper","type1":"water","desc":"Pelipper is a large, aquatic bird-like Pokémon with a blue and gray plumage. It has a long, flat beak and a distinctive crest on its forehead. It is known to be a diligent parent, with the female Pelipper caring for its eggs and young on the water's surface."}
{"name":"Ralts","type1":"psychic","desc":"Ralts is a small, blue, bipedal Pokémon with two long, thin tails and a hood-like protrusion on its head. It is known for being timid and reserved, often preferring to avoid confrontations. Ralts is able to use a variety of psychic and fairy-type moves in battle."}
{"name":"Kirlia","type1":"psychic","desc":"Kirlia is a pink, mammalian Pokémon with long, slender limbs and no tail. It has a slender, wolf-like body."}
{"name":"Gardevoir","type1":"psychic","desc":"a tall, slender, quadruped Pokémon with a slender body covered in a whitish-pink fur. its four legs are thin and Its red eyes are notable. Its long, flowing mane is actually its hair when in a human-like form"}
{"name":"Surskit","type1":"bug","desc":"Surskit is a Bug/Water-type Pokémon that resembles a water strider on its hind legs. It has a slender, pale green body with a red stripe running along its back. It's known for its speed and agility, often using its quick movements to evade opponents."}
{"name":"Masquerain","type1":"bug","desc":"Masquerain are winged, fairies which resemble ladybugs. Its wings are pink or white. It has the ability to change the pattern on its wings to decoy opponents. Masquerain are known to be elegant."}
{"name":"Shroomish","type1":"grass","desc":"Shroomish is a small, insect-like Pokémon that has a brown and white mushroom-like body with large eyes. It has a distinctive look and is often found in forests and caves. In terms of character, Shroomish is known to be surprisingly brave despite its small size and is also known to be a curious creature."}
{"name":"Breloom","type1":"grass","desc":"Breloom is a grass/ fighting-type Pokémon with the appearance of a large Mantis. It typically grows up to about 5 feet in length. A notable feature is the lack of antennae with small and leafy arms at the top. Its primary attacks include cross, hammer arm, and megahorn. The user often describes the battle performance of Breloom as vigorous and as being powerful."}
{"name":"Slakoth","type1":"normal","desc":"Slakoth are sloth-like Pokémon with gray, furry bodies. They have long arms and legs, but they move slowly. They have a laid-back personality."}
{"name":"Vigoroth","type1":"normal","desc":"Vigoroth is a large, bear-like Pokémon with a blue and white fur. It has thin limbs and a shorter neck compared to Aggron. It has a unique ability to lift heavy weights."}
{"name":"Slaking","type1":"normal","desc":"Slaking is a huge, blue, quadruped Pokémon with a long, pink tongue and two small arms that resemble those of a monkey. It has a short, stumpy body and extremely long legs. It is known for being extremely powerful and slow. Slaking is capable of eating a forest's worth of food in one day and can generate powerful whirlpools when running."}
{"name":"Nincada","type1":"bug","desc":"Nincada has the appearance of a strange, worm-like Pokémon with a pinkish-white, slender body. In terms of character, Nincada is known to be quiet and often found in caves. As for moves, it is said to be able to use moves such as Poison Powder, Poison Fang, and Quick Attack."}
{"name":"Ninjask","type1":"bug","desc":"Ninjask is a Bug/Flying-type Pokémon with a yellow and orange body, having four wings and resembling a dragonfly. It is known for its agility and swift movements, possessing a somewhat gentle and modest personality despite its intimidating appearance. It can learn moves such as Quick Attack and Gigadrum by leveling up or through leveling up its evolutions and using similar moves through tutor or other external methods."}
{"name":"Shedinja","type1":"bug","desc":"Shedinja, the Pokémon known for its unique, hollow body and ghostly visage. As a species, the Pokémon is depicted as being almost undead, with Shedinja typically sporting long arms and elongated limbs. In battles, Shedinja can often be seen utilizing its unique box trap ability to immobilize opponents, with moves like Shadow Sneak and Pursuit being staples of its arsenal in battle of wits."}
{"name":"Whismur","type1":"normal","desc":"Whismur has small, brown fur on its head, with light pink on the belly. It has big eyes and small ears. Whismur is known for its adorable silence."}
{"name":"Loudred","type1":"normal","desc":"Loudred is a large, rodent-like Pokémon with a gray and orange body. It has a distinctive crest on its head and a long, thin tail. Loudred is known for its incredibly loud bell-like cry that can be heard for miles."}
{"name":"Exploud","type1":"normal","desc":"Exploud is a Normal-type Pokémon that has a rabbit-like body with brown fur. It has large ears and is known for its loud, blaring sound, which it uses to communicate with its allies and intimidate its foes. Exploud is said to be a rather timid Pokémon at heart, but its loud voice helps to build its confidence."}
{"name":"Makuhita","type1":"fighting","desc":"Makuhita is a humanoid elephant-like Pokémon with a large body, short arms, and a flat nose. Its body is a greyish-brown color with a pink nose. Its physical build makes it a skilled martial artist in the Pokémon world."}
{"name":"Hariyama","type1":"fighting","desc":"Hariyama is a large, muscular Pokémon with a box-like appearance. It has a distinctive white and gray body with a red face, as well as a distinctive crest on its head. It is a Fighting-type Pokémon."}
{"name":"Azurill","type1":"normal","desc":"Azurill is a small, round Pokémon with a white and blue appearance, and can roll into a ball for defense. It is known to be gentle but sometimes unpredictable. Azurill can evolve into Marill at level 15 and learn moves like Tackle, Defense Curl, and Future Sight."}
{"name":"Nosepass","type1":"rock","desc":"This Pokémon has a small build with a rocklike head and a somewhat flat skull, as well as having four cylindrical rocks on its back, which can function as a clock."}
{"name":"Skitty","type1":"normal","desc":"A small, rabbit-like Pokémon with a fluffy tail and usually cream-colored stripes on its end with this also including brownish-colored upper legs and dark-colored stripes on its tail. Its overall design makes it quite cute, also similar to its predecessors such as Togepi. It has also been seen to accompany other Pokémon in the wild."}
{"name":"Delcatty","type1":"normal","desc":"Delcatty is a Normal-type Pokémon with a large, fluffy body and two ears that are heavily whisker-lashed. It is often seen in forests, where it uses its cute appearance to confuse predators. Delcatty is known for its unique appearance and habits, often adapting to its environment."}
{"name":"Sableye","type1":"dark","desc":"Sableye is a Dark-type Pokémon with a mysterious, gem-like appearance. It has a purple and pink gemstone body with a round face and elongated legs. Sableye is a relatively rare and mysterious Pokémon, often associated with the treasure hunter concept, and is known for its uses of psychic and dark-type moves."}
{"name":"Mawile","type1":"steel","desc":"Mawile is a steel/Fairy type Pokémon with a metal mouth, resembling a horse's maw. It has a slender, ape-like body with a grayish-brown color and white markings. Its metal jaws can move at high speeds and can even smash steel."}
{"name":"Aron","type1":"steel","desc":"Aron is a steel/rock-type Pokémon with a rounded body and a distinctive horn protruding from its forehead. It has a grey-black color with a metallic sheen, giving it a sturdy appearance. Aron is known to be a relatively wild and aggressive Pokémon."}
{"name":"Lairon","type1":"steel","desc":"Lairon is a Steel-type Pokémon with a humanoid body covered in metal, it is quite tall with a strong build and heavy metal plates. The characteristic of its face is the red gemstone that it has embedded in its forehead. In the wild, it is prized for its excellent steel, which is used to create high-quality swords."}
{"name":"Aggron","type1":"steel","desc":"Aggron has a large, armored body, with a unique beak-like mouth and four sharp horns on its head. Its body has a mix of red and yellow, and it has an imposing appearance, making it intimidating to its opponents. As for its moves, Aggron is known for its powerful steel-type attacks and can hit hard with its iron tail."}
{"name":"Meditite","type1":"fighting","desc":"Meditite is a quadruped Pokémon that has a blue, spherical body with a white underside. It is said to be incredibly agile, evident from its swift movements, and tends to meditate to train its body and mind. Meditite can learn moves like Meditate, Dynamic Punch, and Psychic."}
{"name":"Medicham","type1":"fighting","desc":"Medicham has a humanoid and feline appearance, with graceful hands, small facial features, and a series of sharp claws on the hands and feet. It has a calm and thoughtful demeanor, but is also prone to fits of passion. As a Fighting/Psychic-type Pokémon, Medicham is skilled in hand-to-hand fighting, wrestling, and other physically and mentally demanding techniques."}
{"name":"Electrike","type1":"electric","desc":"Electrike is the pre-evolved form of Manectric. It has a yellow fur with a black stripe moving from its head to its tail, giving it a sleek, elongated appearance. Its eyes glow bright with electricity due to its ability to generate electricity across its fur."}
{"name":"Manectric","type1":"electric","desc":"Manectric is a Electric-type Pokémon that has a slender, wolf-like body covered in thick, electrically charged fur. It stands on hind legs and has blue markings on its cheeks, giving it an intimidating appearance. Its body appears to crackle with electricity, making it look powerful and formidable. "}
{"name":"Plusle","type1":"electric","desc":"Plusle, the Pleased Pokémon, resembles a yellow, rodent-like creature with a blank face, pink eyes, and a plump body. It is known to be agreeable and positive in nature. It uses Thunder Wave and Quick Attack as its primary moves."}
{"name":"Minun","type1":"electric","desc":"Minun are small, round Pokémon with metallic bodies that have a distinctive red circuit and cables on its head. They have glowing blue lights on their heads, and despite their small size, Minun can convey a surprising quantity of electricity. Minun has a generally aggressive character which may well fit its appearances."}
{"name":"Volbeat","type1":"bug","desc":"Volbeat is a Dark-type insect Pokémon that has a distinctive appearance: covered in a shimmering, iridescent layer consisting of yellow, brown, and black, with a small tail and a pair of horns. It has a lively and energetic spirit, often choosing leaders to support and protect. Volbeat can learn moves such as Wrap, Ember, and Twister to fight its opponents."}
{"name":"Illumise","type1":"bug","desc":"Illumise is an insect-like Pokémon with a large, glowing spot on the back of its head. Its lower body is yellow, while the upper body is orange."}
{"name":"Roselia","type1":"grass","desc":"Roselia is a small, plant-like Pokémon with a thorny appearance. It has a green body and a white base, with a distinct floral pattern on its face. It is often associated with growth and renewal."}
{"name":"Gulpin","type1":"poison","desc":"Gulpin are small, pink, and slug-like Pokémon. They are known to eat large amounts of food and drink to the point of bloating. Its appearance resembles a slug, with a protruding tongue and a few beads in its head that allow it to sense its prey."}
{"name":"Swalot","type1":"poison","desc":"Swalot is a Dark/Poison-type Pokémon. Its appearance is that of a blue mass of mouths, each containing sharp teeth, and its body resemble a blue color belly. It is known to use its immense power and ability to eat everything in sight."}
{"name":"Carvanha","type1":"water","desc":"Carvanha is a vicious sea creature with a large, cartilaginous body and a distinctive pair of large jaws that are capable of devouring its opponents whole. They are highly agile, with an impressive speed that allows them to outmaneuver their foes, and are known for their ruthless fighting style. They are often found in seaweed forests and rocky coastlines, where they hunt down schools of smaller fish and other sea creatures to feast on."}
{"name":"Sharpedo","type1":"water","desc":"Sharpedo resembles an aggressive mammal, with a sleek, streamlined body, a long, pointed snout, and its jaws filled with needle-like teeth. It is characterized as being a hostile and ferocious predator. It is known to be a swift and aggressive swimmer."}
{"name":"Wailmer","type1":"water","desc":"Wailmer is a white whale-like Pokémon with a large body and a long neck. It has a round bell on its head and a long tail. It can grow up to 20 feet in length."}
{"name":"Wailord","type1":"water","desc":"Wailord is a massive Whiscash, resembling a blue whale with a long, slender body and a broad mouth containing rows of teeth."}
{"name":"Numel","type1":"fire","desc":"Numel resembles a mammal, it is a fire type pokemon that is often described as resembling a wooly, small Mammal. Numel's body is said to be that of an armadillo with features associated to a snout resembling that of an elephant. Numel has been known to be described as a short, sturdy creature."}
{"name":"Camerupt","type1":"fire","desc":"It has a mix of reptilian and archeological features, typically resembling an ostrich with a volcanically active body that appears to be covered in muck and ash. Camerupt often seems to personify the eruption of volcanic mountains, demonstrating its power and resilience."}
{"name":"Torkoal","type1":"fire","desc":"Torkoal is a quadruped Pokémon with a turtle-like appearance, characterized by its brown shell, six pillars on its shell and large feet. It is a rather laid-back Pokémon that is known for its gentle and calm nature. Its moves mostly rely on Fire-type moves and making use of its claws for grappling and its shell for covering"}
{"name":"Spoink","type1":"psychic","desc":"Spoink has a pink oval body with a depressed area on top of its head. It has a distinctive circular organ on the top of its head that is sensitive to Seismic activity. Spoink is a calm and mild-mannered Pokémon, but it can become enraged when it detects seismic vibrations."}
{"name":"Grumpig","type1":"psychic","desc":"Grumpig has a stout, pig-like body with a short, curved snout and a pair of tusks. It has a generally greyish-brown color with a yellow patch on its forehead. Grumpig often becomes irritable or aggressive, especially when separated from its mother or when its surroundings are disordered."}
{"name":"Spinda","type1":"normal","desc":"Spinda is a Normal-type Pokémon with a rounded, chubby body, a large belly, and spindly legs. It has a patchy, multi-colored appearance, with blotches of different colors covering its skin. Spinda is known to be quite playful and quick-witted, often using its agility to evade its opponents."}
{"name":"Trapinch","type1":"ground","desc":"Trapinch is a Ground-type Pokémon with a humanoid body and a large, digging tap-like hand on the end of its arm, somewhat resembling a snail. Its body is a mixture of grey and pink, giving it a fairly eerie presence."}
{"name":"Vibrava","type1":"ground","desc":"Vibrava is a Ground/Dragon-type Pokémon that has a serpentine body. It is known for its speed and agility, making it a formidable opponent in battle."}
{"name":"Flygon","type1":"ground","desc":"It has the appearance of a sandworm. Flygon's body resembles a massive worm which can grow up to 11 feet long and is known to fly at high altitudes. It has red eyes and is typically found in arid desert regions. Its speed allows it to travel at high velocities."}
{"name":"Cacnea","type1":"grass","desc":"Cacnea has a large flower-like head and a long, thin body. It has a strong plant-like appearance and a rather menacing demeanor. Its known moves include Sand Attack (level-up), and Petal Dance."}
{"name":"Cacturne","type1":"grass","desc":"Cacturne is a dual Grass/Dark-type Pokémon that appears as a cactus-like creature with a face and body resembling a cat. Its appearance is reminiscent of a cactus with its thorny back and a circular flower on top of its head. Cacturne is known for its elusive and stealthy nature, often moving unnoticed."}
{"name":"Swablu","type1":"normal","desc":"Swablu is a small, plump Pokémon shaped like a nest. It has a smooth, gray base and creamy white 'twigs' that resemble twigs. It's known for its gentle nature, often returning to its nest to rest or roost. It uses its long, twig-like protrusions to move around and for support. "}
{"name":"Altaria","type1":"dragon","desc":"Altaria is a dual Flying/Fairy-type Pokémon that is known for its elegant and majestic appearance, often depicted as having an slender serpentine form with a predominantly blue and white plumage. It's said to possess a calming and soothing presence, often being associated with a peaceful atmosphere. Altaria is known for its strong aerial abilities and can be taught various moves such as Aerial Ace, Dragon Pulse, and Moonblast."}
{"name":"Zangoose","type1":"normal","desc":"Zangoose is a mammalian Pokémon that resembles a lion or tiger but with a long, pointed tail. It has two sharp claws protruding from its wrists. It commonly trades blows with its natural foe, Seviper, in its native habitat."}
{"name":"Seviper","type1":"poison","desc":"A snake-like Pokémon with a slender, venomous body, with red and yellow markings that give it a distinctive appearance. It has a calm demeanor, but can release a toxic gas that knocks opponents back. Seviper's venomous fangs allow it to deal massive damage with its poison bites."}
{"name":"Lunatone","type1":"rock","desc":"Lunatone is a blue, spherical, rocky Pokémon with an unknown origin. Its surface is covered in a mosaic of small, glowing stones. It is calm and insightful, with a tendency to sense its surroundings."}
{"name":"Solrock","type1":"rock","desc":"In the wild, Solrock likes to bask in the sunlight during the day. It can sometimes be seen moving towards the moon when its energy can no longer be replenished by solar power. Solrock has the ability to store energy from sunlight, which it uses for its attacks."}
{"name":"Barboach","type1":"water","desc":"Barboach is a Water- and Ground-type Pokémon resembling a mole with its body mostly concealed in the ground, save for its eyes and whisker-like tendrils. It has a light blue and dark blue color scheme and is usually seen with its eyes on both eyes on either side whereas its whiskers can appear as longer hairs. It can use moves like Mud Shot and Crunch to defend itself."}
{"name":"Whiscash","type1":"water","desc":"Whiscash is a Water-type Pokémon that resembles a beaver, characterized by its stocky build, large teeth, and distinctive facial features. It is often found in freshwater habitats where it can be seen working to build its home. Whiscash is known for its relentless work ethic and strong determination,  often seen as very industrious and intelligent creatures."}
{"name":"Corphish","type1":"water","desc":"Corphish resembles a crab with a pincer and pinchers on its claws. It is a freshwater Pokémon that can be blue with the sides of the claws having white. Corphish can be seen to possess a aggressive and violent nature.  Corphish is capable of using Water-type moves like Bubble Beam, Water Gun."}
{"name":"Crawdaunt","type1":"water","desc":"Crawdaunt is a large, crab-like Pokémon with a menacing appearance. It has a dark green exoskeleton and a pair of sharp claws on its front legs. It is known for its aggressive behavior."}
{"name":"Baltoy","type1":"ground","desc":"Baltoy is a white, clay-like Pokémon with a rounded body, a long neck, and two small arms. It has a face with two small eyes and a small mouth. It looks like a Balloon-like creature."}
{"name":"Claydol","type1":"ground","desc":"Claydol has an overall stately appearance with elegant movements, its appearance often characterized by being enigmatic in nature."}
{"name":"Lileep","type1":"rock","desc":"Lileep is a Rock/Grass-type Pokémon resembling a plant-like creature with a skull on its head, capable of surviving under the bark of a tree. It is a strange and enigmatic Pokémon, with a calm demeanor. Lileep's primary moves include Solar Beam, Stone Edge and Earthquake."}
{"name":"Cradily","type1":"rock","desc":"Cradily is a Plant/Ground-type Pokémon that resembles a giant Bug-like creature with a multitude of insect-like appendages and compound eyes. Despite its intimidating appearance, it's gentle and calm in nature. It has a vast array of moves including Solar Beam and Poison Powder."}
{"name":"Anorith","type1":"rock","desc":"Anorith is a bipedal Pokémon with a humanoid body, and two claws on its hands. It has a distinctive appearance with a large head, its usually bright red body colour. It can also use powerful moves like Cross Poison and Iron Head to attack its opponents."}
{"name":"Armaldo","type1":"rock","desc":"Armaldo is an insect/rock-type Pokémon that resembles a mix of an ant and a beetle. It has a distinctive, armored appearance with a long, curved horn on its forehead and a pair of large, pincer-like claws."}
{"name":"Feebas","type1":"water","desc":"Feebas appears as a pink, fish-like Pokémon. It is characterized by its blank face and its typically poor accuracy. It can learn water-type moves, such as Water Gun and Aqua Tail."}
{"name":"Milotic","type1":"water","desc":"Milotic is a Water-type Pokémon that resembles a serpent, with a slender and flexible body covered in a blue, undulating skin. It has a gentle face and a calming presence, often associated with its soothing and peaceful demeanor."}
{"name":"Castform","type1":"normal","desc":"Castform is a small, spherical Pokémon with a cast-like appearance that can change its form based on the weather. It has a wise and intelligent nature, observing its surroundings and adapting to its environment. Castform can use moves such as Dazzling Gleam, Shadow Ball, and Discharge."}
{"name":"Kecleon","type1":"normal","desc":"It stores different patterns on its body according to the surroundings so that the Kecleon can be perfectly camouflaged. Pattern 1 or a plain pattern. It lives on rocks, boulders, or even the tops of large ruins, and always lies patiently in waiting on a single, flat boulder, its eyes closed in concentration. It stores different patterns on its body according to the surroundings so that the Kecleon can be perfectly camouflaged"}
{"name":"Shuppet","type1":"ghost","desc":"Shuppet is a Dark type Pokémon. It resembles a Halloween stuffed doll with a triangle head. Shuppet uses its cute appearance to lure victims in before attacking them. Shuppet is known to evolve into Sableye. It has a cute and cuddly appearance."}
{"name":"Banette","type1":"ghost","desc":"Like Nohmu, Banette is an evil spirit that can summon ash. It is always seen wearing an old, blue hood. It lives in cemeteries. "}
{"name":"Duskull","type1":"ghost","desc":"Duskull is a skull-like Pokémon with empty eye sockets, giving it a ghostly appearance. It has a reserved and intimidating personality, often appearing eerie to those around it. Duskull can have five possible moves, including Faint Attack, Shadow Ball, Phantom Force, Shadow Sneak, and Astonish."}
{"name":"Dusclops","type1":"ghost","desc":"Dusclops is a ghost/poison-type Pokemon with a distinctive spindly appearance and large, glowing eyes. It is known to be a solitary creature, often found in dark places. As for its moves, it can use bone-chilling Ghost-type attacks and poisonous blows to immobilize its opponents."}
{"name":"Tropius","type1":"grass","desc":"Tropius is a large, yellow bird Pokémon with a distinctive pineapple-like fruit on its head that contains its seeds. It has a relaxed, serene appearance. Tropius is known for its ability to absorb nutrients from the fruit attached to its head, allowing it to heal its wounds."}
{"name":"Chimecho","type1":"psychic","desc":"Chimecho appears to be a pink creature with a bell-shaped head and two large, round eyes. It is known to be a quick learner with a calm nature. It uses its bell-like head to create sound-based moves such as Chime Voice and Imprison."}
{"name":"Absol","type1":"dark","desc":"A slender, wolf-like Pokémon with a golden coat and gray underbelly, and a distinctive cape-like tuft of fur in the middle of its back. It is said to possess a keen sense of intuition and is known to be a fierce hunter. Absol's attacks typically start at a maximum of 60 BP."}
{"name":"Wynaut","type1":"psychic","desc":"Wynaut is a Normal-type Pokémon that is often found in caves and forests. It has a light blue egg shape appearance with a blue eye and its body is not divided into distinct sections like other Pokémon. Wynaut is a shy and timid Pokémon that evolves into Wobbuffet."}
{"name":"Snorunt","type1":"ice","desc":"Snorunt is a quadruped, mammalian Pokémon that has the appearance of a humanoid being. Initially, it has a frosty blue body and a white underbelly, but its body shape changes depending on the season. With a cute, child-like appearance, it's known for having a cold and moody demeanor yet, using its cold breath to hurt its foes and protecting its pack, which forms a bond of friendship."}
{"name":"Glalie","type1":"ice","desc":"Glalie are typically pale blue Pokémon with a glacial, quadruped appearance, their bodies covered in thick fur, that allow them to survive in freezing environments. Despite its intimidating appearance, this Pokémon is incredibly docile in nature and will often let small children ride on its back. It is known for its superior endurance, allowing it to breathe in extremely cold temperatures for a long time and even to swim in icy water."}
{"name":"Spheal","type1":"ice","desc":"Spheal's appearance is similar to a seal with a spheal round in the middle of its body. It has a gentle character and is known to be friendly. Moves associated with Spheal are Defense Curl, Endure, and Tackle."}
{"name":"Sealeo","type1":"ice","desc":"Sealeo resembles a cross between a walrus and a seal, with a large body and a collection of blubber that can inflate its body for different circumstances. Its character is determined by its thick hide and how thick it can have it adapted to changing conditions."}
{"name":"Walrein","type1":"ice","desc":"description=Walrein, a majestic and regal Pokémon, is a large and impressive creature with a streamlined body, Arctic white fur and black spots, and an icicle-like head. Its character is that of determination and elegance. Walrein is known for its icy powers, using the special ice beam, icy winds and having an icy aura, for battling, with devastating results."}
{"name":"Clamperl","type1":"water","desc":"Clamperl, the Great Pearl Pokémon, is a marine bivalve resembling a large oyster. Its whorled shell houses a pearl, and it has a distinctive beak-like mouth. It is said to live for over 1,000 years, and its ages are distinguished by different colors of its shell, which change according to its age."}
{"name":"Huntail","type1":"water","desc":"Huntail is the evolved form of Clamperl and is known for its large fin on its back. Its appearance is a long, round body with a flapper-like fin on its back and a unique build for a Water-type Pokémon. As a Wild Pokémon, Huntail can learn moves such as Aqua Tail and Hammer Arm. In terms of character, it appears to be a very intelligent & playful Pokémon."}
{"name":"Gorebyss","type1":"water","desc":"It is a fish-like Pokémon with a pink body and a long, elegant tail. It has two giant fins on its back. It is also known for its lovely singing, which is said to be enchanting, and has a calm character."}
{"name":"Relicanth","type1":"water","desc":"Relicanth is a Rock/Water-type Pokémon with a prehistoric appearance, resembling a fish. Its long, blue body is often spotted with white markings. It is known to be a relatively rare and elusive Pokémon, with a habit of disappearing underwater and reappearing in unexpected places. As for moves, its arsenal includes the strength-based Water Gun and Stone Edge attacks, among other powerful physical moves."}
{"name":"Luvdisc","type1":"water","desc":"Luvdisc is a pink, heart-shaped pokémon with a sparkly appearance. It is said to have formed from the shell of a hermit crab. Luvdisc is known to be a gentle and affectionate pokémon that produces a sweet aroma and is often found in coral reefs with its mate."}
{"name":"Bagon","type1":"dragon","desc":"Bagon is a dragon/double battle Pokémon. Bagon has a primarily blue body with a mixture of yellow and red markings on its head. It has the ability to grow its horn to incredible length and a long, pointed shape, and is known to be fairly aggressive and territorial."}
{"name":"Shelgon","type1":"dragon","desc":"Shelgon, known as the Half-Baked Pokémon, is a Rock/Dragon-type Pokémon that evolves from Bagon. It has a large shell on its back, which is slightly removed from its spine, resembling a half-baked pot. Shelgon uses its body to smash its opponents and can learn powerful moves such as Dragon Rush and Outrage."}
{"name":"Salamence","type1":"dragon","desc":"Salamence is a large, dragon-like Pokémon with a blue body, cream-colored underside, and long, clawed arms. It has a spiky, crest-like structure on its head, giving it an intimidating appearance. In terms of character, Salamence is said to be fiercely protective of its loved ones and can be quite aggressive when defending them."}
{"name":"Beldum","type1":"steel","desc":"Beldum is a dual Steel/Psychic-type Pokémon with a sleek, metallic body and a large, bulging head. Its appearance is often compared to an old, glowing orb. In terms of character and moves, Beldum is known for being calm and gentle, and can learn a variety of Psychic-type moves such as Confusion and Psychic."}
{"name":"Metang","type1":"steel","desc":"an intermediate form that is born from the merger of two Metagross in a volcanic region, Metang possesses a blend of its parents' characteristics. It has a mix of its parents' steel and rock-like appearance. Its physical structure is similar to its parents, but its fusion creates a unique robot-like form with visible seams."}
{"name":"Metagross","type1":"steel","desc":"Metagross is a Steel/Psychic-type Pokémon with a massive, mainly metallic metagross with a distinctive plate on its back, resembling a set of six spheres. Its robotic-like design is part of a technological fusion body, which may have originated from Cresselia.  Metagross employs primarily powerful, heavy-hitting moves."}
{"name":"Regirock","type1":"rock","desc":"Regirock is a Rock-type Pokémon that appears to be a massive stone statue with a robust physique. It has a stern and rugged appearance with its stone body and gruff demeanor. Regirock is known for its incredible strength and can use powerful moves to attack its opponents."}
{"name":"Regice","type1":"ice","desc":"Regice is a frozen water-type Pokémon with a humanoid body of crystal, having a serene, icy aura. Its facial features are mostly blanketed with the structure of its head and its movement is based on its ice structures dissolving and refreezing. It has been known to be able to manipulate ice structures for its movements, among other moves."}
{"name":"Registeel","type1":"steel","desc":"Registeel is a Steel-type Pokémon with a steel-like gray body and a pair of hands, giving it a more human-like appearance. It has a calm yet noble character, often being perceived as a guardian of the Ancient Forest. It typically holds a silver-colored baffle in its hand as a ceremonial object, and the only attacks it is known to possess are Iron Head, Iron Tail and Metal Claw."}
{"name":"Latias","type1":"dragon","desc":"A tall, slender, blue, dragon-like Pokémon with a long tail and two small wings on its back. It is known for being calm and gentle, but also fiercely protective of its friends. It has the ability to read and manipulate the thoughts and emotions of others."}
{"name":"Latios","type1":"dragon","desc":"Pokémon with a dragon-like body with a blue and red wing-shaped protrusions on its back. When it's excited, its wings open widely. It's said to possess the soul of a dragon. It has been seen flying with a swiftness and elegance that's beyond compare."}
{"name":"Kyogre","type1":"water","desc":"Kyogre is a powerful water-type Pokémon, resembling an enormous, blue, amorphous cloud, with iridescent colors and long tendrils. It has a calm and serene appearance, but can be quite ferocious when provoked. Kyogre is capable of controlling the weather and has a wide range of powerful moves in its arsenal."}
{"name":"Groudon","type1":"ground","desc":"Groudon is a large, quadrupedal Ground-type Pokémon with gray and turquoise skin and several red markings on its body. It is often seen standing alongside its arch-nemesis, Kyogre. In battle, Groudon can cover itself in stones for added defense, as well as learning powerful moves such as Earthquake and Precipice Blades."}
{"name":"Rayquaza","type1":"dragon","desc":"a large, dragon-like Pokémon with a predominantly blue and white body and red eyes. It is described as having immense power and is often associated with the wind and sky. Its wings are often depicted as vast, giving it incredible flight capabilities. It's often described as having a very majestic appearance."}
{"name":"Jirachi","type1":"steel","desc":"Jirachi is a mythical Pokémon that resembles a large, pig-like creature with a small, round body, short legs, and a long neck. It has a distinctive crescent moon shape on its forehead. In terms of character, it is said to possess incredible kindness and generosity."}
{"name":"Deoxys","type1":"psychic","desc":"Deoxys is a highly intelligent, psychic-like Pokémon that is said to appear as a meteor entering the atmosphere. Two small, wing-like protrusions are on its back, and its hands and feet have three fingers or toes. He possesses superior strength, speed, and intelligence."}
{"name":"Turtwig","type1":"grass","desc":"Turtwig is a small, turtle-like Pokémon that has a green shell covering its back. Its arms and legs are also small and short. It often uses its vines for climbing and can secrete a sap that helps it defend itself."}
{"name":"Grotle","type1":"grass","desc":"Grotle looks like a slow-moving, palm-sized, plant-like Pokémon with a broad leaf on its head that's very sensitive to its surroundings. It's a gentle creature that lives in warm, humid places like forests. It can photosynthesize, which enables it to live a long time without much food."}
{"name":"Torterra","type1":"grass","desc":"Torterra is a Ground/Grass-type Pokémon. It has a sturdy body, resembling that of a tortoise, with a mushroom-like structure on its back. It is known for its exceptional strength and can move slowly and deliberately, making it a formidable opponent in battle."}
{"name":"Chimchar","type1":"fire","desc":"Chimchar is a small, quadruped Pokémon with light orange fur and a fluffy tail. It has a red marker-like stripe on its forehead, and it is known for its ability to climb trees. Chimchar is said to be the partner Pokémon of many young trainers."}
{"name":"Monferno","type1":"fire","desc":"Monferno is a Fire/Fighting-type Pokémon that appears as a bipedal, humanoid creature. It has a feline body with a predominantly orange and black color scheme, along with a distinctive flame covering its body that leaves a trail of sparks and gives it a menacing look. Its personality is that of a brave and energetic character, associated with courage and strength, with a range of physical attacks available as its moveset."}
{"name":"Infernape","type1":"fire","desc":"Infernape is a Fire/Fighting-type Pokémon with a distinctive red and black appearance, often characterized by its large eyes. It is a wild and energetic creature that emits intense flames from its body. Its moves often involve strong strikes and fiery assaults to overwhelm its opponents."}
{"name":"Piplup","type1":"water","desc":"Piplup is a Water-type Pokémon with a penguin-like appearance, having blue feathers and a big round head. Character-wise, Piplup is considered to be very proud and full of itself. It often has to be convinced to perform or work, and has a generally spoiled character."}
{"name":"Prinplup","type1":"water","desc":"Prinplup is a large penguin-like Pokémon with a large, prominent nose, black and yellow feathers, and webbed feet. It is known to be fiercely protective of its territory and trainers. Prinplup primarily uses Water-type attacks such as Bubble Beam, Water Gun, and Ice Fang."}
{"name":"Empoleon","type1":"water","desc":"Empoleon is a large, bipedal Pokémon with a blue and white body. Its appearance is often compared to that of a 'samurai' due to its noble and majestic demeanor. Empoleon is known for being incredibly intelligent and independent."}
{"name":"Starly","type1":"normal","desc":"Starly is a small, bird-like Pokémon with a brown body, white belly, and white markings on its wings. It has a pointed beak and large eyes. In battle, Starly uses swift movements to attack its opponents and has a strong aerial fighting style."}
{"name":"Staravia","type1":"normal","desc":"Staravia is a bird-like flying Pokemon that has a bird's eye mark on its face and black markings shaping a cape on its body. It has wings and can fly at high speeds. It is also often seen as its transformation to Staraptor."}
{"name":"Staraptor","type1":"normal","desc":"Staraptor is a large, bird-like Pokémon with a mix of brown and gray feathers, a distinctive crest on its forehead, and sharp talons. It is known for its incredible speed and agility, making it a formidable opponent in battle. In terms of moves, it primarily specializes in flying and physical attacks, such as Sky Attack, Aerial Ace, and Brave Bird."}
{"name":"Bidoof","type1":"normal","desc":"Bidoof is a small, rodent-like Pokémon with a brown and grey coat, having large ears and a bushy tail. It has a mischievous nature and is often seen rummaging through trash looking for food, much to the dismay of its humans. Bidoof is also known to learn moves such as Tackle and Growl."}
{"name":"Bibarel","type1":"normal","desc":"Bibarel has a very bulky body. It resembles a beaver, with a brown and white color scheme with a small head and sharp buck teeth. Bibarel has webbed hind feet and can live in the water.  It is capable for balancing strength and speed in water.  Bibarel is a surprisingly intelligent Pokemon.  Bibarel uses Wood Hammer and other powerful strong water-based moves."}
{"name":"Kricketot","type1":"bug","desc":"Kricketot has a pale yellow and black insect-like body. It has a distinctive cricket appearance with large wings on a small body, black markings, and overall an appearance that resembles a wild insect. Kricketot are small, slightly shy, insects with a known tendency to dodge their opponents."}
{"name":"Kricketune","type1":"bug","desc":"Kricketune is a large, cricket-like Pokémon with a yellow and black body. It has a distinctive, glowing bell on its abdomen, which vibrates at high speeds to create sound waves. A Grass-type Pokémon, it is known to be able to perform various forms of music for battle strategy."}
{"name":"Shinx","type1":"electric","desc":"Shinx is a quadruped, mammalian Pokémon with a fox-like appearance. It has a single tail with a three-pronged end, a fluffy yellow coat, and black stripes running down its back. Its eyes change color depending on its mood. It's a somewhat aggressive Pokémon known for its selfish personality. It is known to be confrontational and will clash with others that challenge or anger it. Shinx is known to learn moves such as Quick Attack, Ember, and Sand Attack."}
{"name":"Luxio","type1":"electric","desc":"Luxio is an Electric-type Pokémon resembling a jackal with pointed ears and a fox-like body. They are known for their mischievous nature, often seen playing tricks on trainers during battles. In terms of moves, Luxio can typically use Thunder Shock, Tackle, and Quick Attack."}
{"name":"Luxray","type1":"electric","desc":"Luxray’s appearance is characterized as having sleek and muscular body its long, slender body, which has grey markings on a yellow background, while it is usually known for having a calm yet intelligent nature"}
{"name":"Budew","type1":"grass","desc":"Budew is a small, bud-like Pokémon with a green, pink, and white body. It has two long, white antennae-like appendages on its head, and its petals are delicate and usually placed inside its body. Its body can emit a variety of fragrances and have a tender feel to it. Budew can also learn a large deal of moves that both are physical and special."}
{"name":"Roserade","type1":"grass","desc":"Roserade is a two-headed, snake-like Pokémon with a beautiful appearance, characterized by a pale pink and white complexion with rose-patterned markings on its body. It possesses a gentle, curious, and affectionate nature. Its notable moves include Solar Beam, Charm, and Attract."}
{"name":"Cranidos","type1":"rock","desc":"Cranidos is a grounded Pokémon with a predominantly blue body and a distinctive, beaked head resembling an eagle. Its body is relatively thin and it has a few prominent, yellow spots. This Pokémon-like creature is a relatively slow one, moving forward with a steady, ground-based gait. "}
{"name":"Rampardos","type1":"rock","desc":"Its armor has been compressed and toughened to make up most of its body, and it doesn’t show its eyes. It has the highest body mass of any Arcanine’s family. It has very high defense power after evolving from shieldon. The shape of its skull and the armor all over its body protect its body. It has two eye holes."}
{"name":"Shieldon","type1":"rock","desc":"Shieldon is a quadruped Pokémon with a steely exoskeleton, featuring metallic plates on its back and legs. It has a small patch of black rock on its back and its eyes are deep-set and narrow. Shieldon can charge its evolved form up with electricity from lightning and get its own moveset."}
{"name":"Bastiodon","type1":"rock","desc":"Bastiodon is a large, quadruped Steel-type Pokémon. It has a distinctive armor-plated body, with a sharp, angular appearance and a pair of large horns on its head. It has a large sword mounted on its right shoulder and a shield on its left shoulder."}
{"name":"Burmy","type1":"bug","desc":"Burmy is a small, worm-like Pokémon with a yellow and black body. It has a distinctive pair of antennae on its head and a long, slender neck. It is known to evolve into Wormadam."}
{"name":"Wormadam","type1":"bug","desc":"Wormadam is a Bug/Poison-type Pokémon with a worm-like body covered in a white, mottled exoskeleton. It has two small eyes and can change its shape to adapt to different environments. Wormadam is known for its unique ability to produce a sweet, intoxicating scent."}
{"name":"Mothim","type1":"bug","desc":"Mothim are the evolved form of Mothim. They are known for their iridescent colors and the shape of their body, resembling a moth in flight. Their characteristic features include wings large enough to cover their body and the distinctive transparent protrusions from their thorax."}
{"name":"Combee","type1":"bug","desc":"Combee is a flying insect Pokémon with a yellow and black striped body, looking like a small bee. It is a new species of insect Pokémon that was discovered in the Sinnoh region. Combee is known for its ability to detect changes in its environment using its large eyes, making it an efficient flyer."}
{"name":"Vespiquen","type1":"bug","desc":"Vespiquen is a large, bee-like Pokémon with a white, striped body and a distinctive horn on its forehead. It is known for its intelligence and social nature, often living in colonies. Vespiquen is capable of learning a range of moves, including Aerial Ace, Buzzsaw, and Charm. Vespiquen is also a powerful attacker capable of using powerful moves like Acrobatics and Whirlwind."}
{"name":"Pachirisu","type1":"electric","desc":"Pachirisu is a small, rodent-like Pokémon with brown fur and red cheeks. It has a lightning-fast tail that it uses to sense its electric powers. Pachirisu is known to be a curious and energetic Pokémon."}
{"name":"Buizel","type1":"water","desc":"Buizel is a small, otter-like aquatic Pokémon with a blue and cream-colored body. It has a cute face with big eyes and a twitching nose."}
{"name":"Floatzel","type1":"water","desc":"sleek, aquatic mammalian Pokémon with a long, serpentine body and a wolf-like head; it has a white and gray color scheme with a distinctive crest on its forehead. It is known for being highly agile and energetic, with a strong connection to the sea"}
{"name":"Cherubi","type1":"grass","desc":"Cherubi is a green, roundish Pokémon featuring small bright eyes and long green leaves on its head. Characteristic of Cherubi is that the parts that turn into flowers bloom as the Pokémon grows up. Due to its endearing cute facial design, Cherubi tends to attract many fans."}
{"name":"Cherrim","type1":"grass","desc":"Cherrim is a small, flower-like Pokémon with a red or sun-flower-like body. Its large red or yellow hibiscus-like petals can change its form based on the sunlight, forming Sunflora and Cherrim respectively. It can use various moves such as growth and sunny day to have a growth advantage"}
{"name":"Shellos","type1":"water","desc":"Shellos is a small, pink-colored Pokémon that resembles a slug. It has a simple, circular body with a small head and two short tentacles on the front. It is generally found on land but has a strong connection to water, which affects its behavior."}
{"name":"Gastrodon","type1":"water","desc":"Gastrodon is a Water/Ground-type Pokémon with an average build. It has a relatively long snout, webbed feet, and a sandy-colored body that resembles the beach. Like the Mudkip, its ancestors, in its evolutionary path, it requires a coastal environment, that is more its favorable and Gastrodon has an upright posture resembling a land-dwelling dinosaur."}
{"name":"Ambipom","type1":"normal","desc":"Ambipom is a Normal-type Pokémon with a primarily pink body and long, thin arms. It has a distinctive ponytail and is known for its agility and quick movements. Ambipom can use powerful fist-based moves like Pound and Vice Grip, or speed-based moves like Double Slap."}
{"name":"Drifloon","type1":"ghost","desc":"Drifloon is a bioluminescent, hot-air balloon-like Pokémon that floats through the air. It glows with a soft, blue light and has a delicate appearance. Drifloon is known for its magical properties and is often found in areas with low air pressure and strong winds."}
{"name":"Drifblim","type1":"ghost","desc":"A large, spherical, and floating Pokémon resembling a balloon with a smount of pointed horns on top of its head. Its body is a light blue color, with white undertones, surrounded by an assortment of pink and white strips forming its facial points and patterns. Drifblim moves with a flowy sense of elegance while possessing a distinct fragrance that smells sweet."}
{"name":"Buneary","type1":"normal","desc":"Buneary is a small, rabbit-like Pokémon with large eyes and a fluffy tail. It has a slender body covered in soft, white fur, and it is often seen in areas with lots of grass and plants. Buneary is known to be a timid Pokémon that flees at the sight of danger, but it is also very fast and agile."}
{"name":"Lopunny","type1":"normal","desc":"Lopunny is a pink, rabbit-like humanoid Pokémon with a slender build, a long body, and long ears. It has big, round eyes with an expression that appears both cute and determined. Lopunny is a quick and agile Pokémon with the ability to jump and dodge attacks with ease."}
{"name":"Mismagius","type1":"ghost","desc":"Mismagius is a Ghost-type Pokémon that resembles a wisp. It is a spectral, ethereal Pokémon that has a flowing, white body. At night, it appears as a wisp of light and vanishes during the morning. Mismagius have a high potential of having a intelligent nature."}
{"name":"Honchkrow","type1":"dark","desc":"Honchkrow is a Dark/Flying-type Pokémon that has a black body with yellow eyes and a distinctive beak. It is known for being a thief and having a mischievous personality."}
{"name":"Glameow","type1":"normal","desc":"Glameow is a quadruped Pokémon that appears to be a sleek, cat-like creature with a slender build and long, bushy tail. It has a slender build and large eyes. It is known for its speed."}
{"name":"Purugly","type1":"normal","desc":"Purugly is a large, catlike Pokémon with a plump body covered in a thick grey fur, it has a bit of a stubby tail and a long neck. Purugly is known for being arrogant and somewhat spoiled due to being pampered by its previous owner. Purugly's physical attacks typically comprise a mix of strong strength-founding physical moves like Body Slam from its high defense stat."}
{"name":"Chingling","type1":"psychic","desc":"Chingling is a small, humanoid Pokémon, resembling a ballet dancer's tutu with a head shaped like a music box. Its appearance is that of a slender, soft, and delicate creature with a musical connotation. Chingling can use various moves including Recover, Sing and Fake Tears. However due to lack of moves in this description, and the answer being required within 2-3 sentences, the last move will suffice."}
{"name":"Stunky","type1":"poison","desc":"Stunky appears as a small, grey, rodent-like Pokémon with a distinctive skunk-like appearance, having a smelly gas gland on its back. They are often found migrating in flocks and are carnivorous in nature, which can be intimidating. Stunky is known to have a surprisingly adorable appearance despite it having prickly nature which makes it an entertaining Pokémon to watch."}
{"name":"Skuntank","type1":"poison","desc":"Skuntank is a poison/dark-type Pokémon that has a large, mouse-like body with a distinctive pair of whiskers. It has a toxic appearance, with a dark brown and white body, and its whiskers are able to detect changes in its surroundings. Skuntank is known to be aggressive and has the ability to release a foul odor to repel predators."}
{"name":"Bronzor","type1":"steel","desc":"Black iron balls are stacked in a pyramid shape, two silver, hexagonal markings are found on each iron ball, and yellow circles containing 1 circle pattern lie flat, with yellow eyes at the top of the stack; Bronzor is able to move independently."}
{"name":"Bronzong","type1":"steel","desc":"Bronzong is a large, spherical Pokémon with a bronze-like appearance. It has a flat, circular body with a large steel ball-like protrusion on its top and a spiked collar around its neck. Bronzong can be quite imposing due to its size."}
{"name":"Bonsly","type1":"rock","desc":"Bonsly, the Bonsly Pokémon. Bonsly is a Buzzle sent from Spain. Bonsly's roots split into smaller roots as it ages. The wild Bonsly evolve into Sudowoodo at level 34. Bonsly is a Wood-type Pokémon. Bonsly has a grayish-brown complexion and brown skin. Bonsly has hands. Like Buzzle, Bonsly has gray and black color. Bonsly has blue eyes and brown skin. Bonsly appear to be a man in a tree. Bonsly live in mountains. Bonsly are very slow. Bonsly typically used to perform a Taunt action where the target will change all active moves to it."}
{"name":"Mime Jr.","type1":"psychic","desc":"Mime Jr. is a small, humanoid Pokémon with a pink body and a distinctive wide-eyed expression. It is known for its acrobatic nature and is often found in forests and caves. It has a tendency to mimic its surroundings, often mimicking its trainers' movements and even learning their voices."}
{"name":"Happiny","type1":"normal","desc":"Happiny is a pink, mammalian Pokémon with a baby chick-like appearance. Resembling a real-world infant, it has a large head, fluffy ears, and a short, stubby tail. Happiny is described as being quite naive and has a timid nature."}
{"name":"Chatot","type1":"normal","desc":"Chatot are primarily yellow with black, feathery plumes on their heads, black beaks, and yellow feet. They are known for their playful and inquisitive nature, often observed mimicking the calls of other Pokémon. In battle, Chatot typically use a variety of sound-based moves such as Peck, Hail and Last Resort."}
{"name":"Spiritomb","type1":"ghost","desc":"This ghost/dark-type Pokémon is shaped like a hexagonal totem pole with a flat top and straight bottom. It has dark, sleek lines, no discernible eyes, and its torso is divided into six flat, angular 'segments'... It is said to have been imprisoned in the grudge of people who lived in caves."}
{"name":"Gible","type1":"dragon","desc":"Gible is a quadruped Pokémon that resembles a cross between a dragon and a lizard. Its body is a pale orange color with a distinctive frill on its neck and a long tail. It can dig and burrow with its sharp claws and powerful legs."}
{"name":"Gabite","type1":"dragon","desc":"It has a dark gray body, a yellow belly, and a tail with a spike-like fin. It is known to be relatively friendly once it Warms up to trainers. It has Levitate as one of its moves"}
{"name":"Garchomp","type1":"dragon","desc":"Garchomp is known for its dragon-like appearance with a streamlined body and an intimidating set of sharp teeth. It is often depicted as a formidable and primal creature, said to possess a great deal of physical strength. In terms of moves, it is known to use a variety of physical attacks, including Dragon Claw and Earthquake."}
{"name":"Munchlax","type1":"normal","desc":"Munchlax is a Normal-type Pokémon with a large body and a flat face. It is a sleeping prankster, who is known for its love of eating and sleep. Munchlax is capable of many moves including Body Slam, Rest, and Body Press."}
{"name":"Riolu","type1":"fighting","desc":"Riolu is a Dark/Fighting-type Pokémon that is known for its small, lion-like appearance, and it is said that its appearance may foretell the user's destiny. "}
{"name":"Lucario","type1":"fighting","desc":"Lucario is a bipedal mammal with a humanoid upper body. Its upper body resembles that of a humanoid with muscular legs. It is recognized from its sharply defined facial features and its two sharp canine teeth."}
{"name":"Hippopotas","type1":"ground","desc":"Hippopotas is a hippopotamus-like Pokémon with a gray and brown body, a short neck, and a barrel-shaped body. Its wide, rounded body is supported by four stumpy legs. It is said to be good at withstanding extreme temperatures."}
{"name":"Hippowdon","type1":"ground","desc":"Hippowdon is a large, quadrupedal Pokémon with a sandy-colored body, a long, bushy tail, and six small, circular body parts, that are its actual 'sand' clouds that cover its body and act as a defense mechanism. Despite its intimidating appearance, it resembles an Arabian Camel and is known for its calm and composed demeanor - its speed and fearlessness make it appear somewhat graceful. In the wild, it is known to use its ability to collect dust and sand to move quickly. "}
{"name":"Skorupi","type1":"poison","desc":"Skorupi have an unusual appearance with a scorpion-like body covered in a shell, with a group of 6 pointed protrusions on each of its back. Skorupi are aggressive and found living on water's edge. Skorupi primarily use poison-related moves in battle and they typically have high defense."}
{"name":"Drapion","type1":"poison","desc":"Drapion is a large, dragon-like Pokémon with a dark brown body, red eyes, and tentacles. It is characterized as a ruthless hunter and has a strong territorial instinct."}
{"name":"Croagunk","type1":"poison","desc":"Croagunk has a brown, rounded body with a bulbous belly. Its eyes are yellow and it has a distinctive set of sticky tongues-like appendages on its face. It carries out attacks using its tongue, for example. Croagunk is a poison type water Pokemon. It gets its speed from its slow pace and its defense from its sticky tongue."}
{"name":"Toxicroak","type1":"poison","desc":"Poison-type Pokémon that combines the appearance of a croak and toxin, characterized by its large ears, long tongue, and toxic secretions. Its appearance is quite intimidating, but it is a gentle Pokémon. Toxicroak is known for its toxic moves and boxing techniques, making it a formidable opponent."}
{"name":"Carnivine","type1":"grass","desc":"Carnivine is a plant-like Pokémon with green scales, a long neck and body, and a pair of arms. It has big green leaves with sharp tines, which it uses to attack its opponents. It is known to be a carnivorous plant that feeds on a variety of small animals."}
{"name":"Finneon","type1":"water","desc":"Finneon is a Water-type Pokémon with a silvery-blue body, a yellow ring under its chin, and white underbelly fins. It has piercing blue eyes and is known for its hydrophobic properties. Finneon is described as very intelligent and can even be a bit mischievous."}
{"name":"Lumineon","type1":"water","desc":"Lumineon is a small, fishlike Pokémon with a slender body covered in shimmering, iridescent scales that reflect light. It has a distinctive crescent-shaped mark on its forehead and large, expressive eyes. Lumineon is a gentle and curious Pokémon that loves to swim and play in the ocean."}
{"name":"Mantyke","type1":"water","desc":"A small, walrus-like Pokémon with a big appetite and a playful personality."}
{"name":"Snover","type1":"grass","desc":"Snover is a Plant/Dragon-type Pokémon that is known for its small, humanoid body resembling a Snowman. It has white powder covering its body and leaves or vines on its arms, head, and torso. Snover is often found in snowy lands where it eats plants and uses them as camouflage."}
{"name":"Abomasnow","type1":"grass","desc":"Abomasnow is a quadruped, anthropomorphic snowman Pokémon with a large build and pale blue skin. It has pine needles on its arms, which serve as its defensive barbs. It has white spherical eyes and a red, gem-like 'nose'. Its red, glowing 'eyes' give it the appearance of being a large, sentient snowman, walking. It is originally a grass/dragon-type Pokémon."}
{"name":"Weavile","type1":"dark","desc":"Weavile, the Dark Type, is a formidable and intimidating Pokémon with a slender yet menacing appearance. Its sharp fangs and claws make it a force to be reckoned with on the battlefield. Weavile is known for its aggressive behavior and is a formidable attacker, using its speed and agility to outmaneuver its opponents with swift movements and clever tricks."}
{"name":"Magnezone","type1":"electric","desc":"Magnezone have a steel body, its circular body is divided into seven thick rings which generate an intense magnetic field. Its personality is very serious. Magnezone have the ability to paralyze foes with its moves, including Zap Cannon and Flash Cannon."}
{"name":"Lickilicky","type1":"normal","desc":"Lickilicky, a huge, pink, slug-like Snack Pokémon. It has small, yellow eyes and gray patterns on its body. It's a slow and docile Pokémon, often found in caves and it feeds on fungi and plants. Its tongue can extend out of its mouth at speeds of up to 30 miles per hour, allowing it to latch onto opponents. It can also bite its opponents with the power of 70 HP. It is also known to hold its opponents in place with its giant tongue and suck their health away."}
{"name":"Rhyperior","type1":"ground","desc":"Rhyperior, the Rhyhorn or Gila species, is a massive and intimidating Pokémon. It stands at an impressive height and width, with a robust body and a distinctive crest on its forehead. It is known for its incredible power and strength. It mostly has a gray and beige appearance with a significant level of muscle in its massive body. Rhyperior is generally aggressive and charges fiercely and can crush any opposition. Its most well-known moves are Hammer Arm and Earthquake."}
{"name":"Tangrowth","type1":"grass","desc":"Tangrowth is a large, vine-like Pokémon with a main body resembling a trunk and leafy green vines of various sizes sprouting from its body."}
{"name":"Electivire","type1":"electric","desc":"Elektivire is an Electric-type Pokémon that has a robust, quadruped body covered in yellow fur, with a red crown-like structure on its forehead. It's known for its powerful physique. It uses its four arms to move and attack, capable of utilizing powerful movements such as discharging electric energy from its hands through its red 'crown'."}
{"name":"Magmortar","type1":"fire","desc":"Magmortar has a flame-covered body and a long, spindly tail. It often appears when volcanic activities occur, it is considered as one of the larger Fire-type Pokémon. Magmortar can control flames that reach as high as a two-story building."}
{"name":"Togekiss","type1":"fairy","desc":"Togekiss is a Fairy/Flying-type Pokémon that resembles a duck-billed Pokémon with a rounded wings and a distinctive flower on its head. It has a calm and serene appearance. Its moveset typically includes Fairy-type moves such as Dazzling Gleam and Moonblast as well as Flying-type moves such as Wing Attack and Acrobatics."}
{"name":"Yanmega","type1":"bug","desc":"Yanmega is a large, moth-like Pokémon with a primarily yellow and brown body. It has large, compound eyes and a distinctive proboscis-like structure on its head. Yanmega is known for its speed and has a range of fast, Bug-type moves."}
{"name":"Leafeon","type1":"grass","desc":"Leafeon is the evolved form of Eevee, with its overall appearance resembling a feline with a slender body, a predominantly grey and green colour scheme, and whisker-like brown stripes on its face. It is known for its intelligence and agility. In terms of combat, it is capable of performing swift and precise attacks, including several types of leaf-based moves."}
{"name":"Glaceon","type1":"ice","desc":"Glaceon is a blue, quadruped Pokémon with a fox-like head and a fluffy tail. In terms of character, Glaceon is very intelligent but also somewhat cunning and manipulative. Glaceon has high Attack stat and learns moves like Ice-type Crunch, Razor Ice and the status-inducing Chill."}
{"name":"Gliscor","type1":"ground","desc":"Gliscor: Gliscor is a dual-ground/flying type Pokémon. It appears as a large, moth-like creature with a scythe-like tail and sharp claws. Its face is a seemingly insect-like mask on its forehead, resembling a scorpion stinger."}
{"name":"Mamoswine","type1":"ice","desc":"Mamoswine has blue, grey, and white fur, with tusks covered in a thin membrane. It has a strong build and possesses incredible force. As an Ice/Water-type Pokémon, it can learn moves such as Earthquake, Ice Fang, or Crunch, and is known for its incredible strength and powerful moves."}
{"name":"Porygon-Z","type1":"normal","desc":"Porygon-Z has an appearance similar to Porygon2 with the main difference being that it has a more futuristic design.  Its design suggests an artistic or virtual appearance with colors of blue. It is known for being an artificial being which emphasizes a more robotic and versatile artificial intelligence."}
{"name":"Gallade","type1":"psychic","desc":"Gallade is a dual Fighting/Psychic type Pokémon. It has a slender, humanoid body with a distinctive wingspan, often depicted with a calm demeanour. By using its sword-like extension on its hand, Gallade proves to be a swift and powerful attacker in battle. "}
{"name":"Probopass","type1":"rock","desc":"Probopass is a Rock/Ground-type Pokémon that appears to be a metal-eating creature with a distinctive appearance. It is characterized by its grayish-blue body and white fur on its head, with a peculiar structure that resembles a face. It is said to have an strong will and can form close bonds with its trainers."}
{"name":"Dusknoir","type1":"ghost","desc":"A mysterious, ghostly figure with a pale, hooded cloak and an aura that seems to cast a shadow over the surroundings. It has a rather intimidating appearance but appears normally calm and collected. Dusknoir is a formidable opponent with access to various types of moves such as Aura Sphere, Ominous Wind, and Shadow Sneak."}
{"name":"Froslass","type1":"ice","desc":"Froslass, the Snow Queen Pokémon. Type: Ice/Ghost Description: Froslass appears with a humanoid figure. Her head resembles an ice skater''s head wearing an icicle mask. Her slender body is completely made of ice. Her icy body is tall and she walks with confident, elegant, and graceful movements. At times, she might even freeze things that she dislikes. In terms of moves, she can use Blizzard to greatly reduce the enemy's accuracy. She can use Ice Shard move that has great deal of speed. And also, she can use Icy Wind, that very chilly to send a blast of icy air."}
{"name":"Rotom","type1":"electric","desc":"It is a Ghost/Dragon, Electric-type Pokémon with a semi- transparent, robotic body. It is known for its wise and helpful personality, often seen as a caretaker and provider. Its moves often include Shadow Ball, Thunderbolt, and Mist Ball."}
{"name":"Uxie","type1":"psychic","desc":"Uxie resembles a skull in appearance, often seen being often depicted wearing a yellow crystal on its forehead. This Dusk Ball Pokémon is known to be very caring and curious allowing others to look into the mysteries of the universe. It is said to possess otherworldly knowing with telepathic capabilities permitting it to possess the power to explain the entire history of the universe to the being."}
{"name":"Mesprit","type1":"psychic","desc":"A psychic-type Pokémon with a slender, wispy body covered in transparent skin, and has a floating head. It has a gentle and calm nature. It is able to sense the emotions of those around it."}
{"name":"Azelf","type1":"psychic","desc":"The true heart of the team that looks after the tribe, even if the team suffers from loss. Azelf has a calm and passionate personality, but if he senses a weakness or despair, he will fiercely battle to protect them."}
{"name":"Dialga","type1":"steel","desc":"Dialga is a large, quadruped Pokémon with a metallic body that has blue and silver markings. It has a long, curved horn on its head and its eyes glow like a pair of bright, blue gemstones. Some people have the misfortune of being attacked, being the subject of a legendary prophecy and being able to manipulate time."}
{"name":"Palkia","type1":"water","desc":"Palkia is a large, dragon-like water-type Pokémon with four arms. It has the appearance of a blue, ethereal dragon with the ability to create and manipulate space-time. It is also incredibly intelligent and wise, with great understanding and command over time and space."}
{"name":"Heatran","type1":"fire","desc":"Heatran is a Fire/Steel-type Pokémon that has a humanoid appearance with a large, flame-covered body. It has three horns and two large wings, with a rugged and rocky texture on its body. Heatran is known to be fiercely independent and territorial, and is said to possess great strength and the ability to create intense heat with its body."}
{"name":"Regigigas","type1":"normal","desc":"Regigigas is a massive and bovine Pokémon, having red-skin with white undersides and has an assortment of gold accents and bands. It is extremely powerful and has an impressive amount of strength, attributed to its sheer size. Regigigas is often depicted as a very calm and collected Pokémon that has its own style of movement and locomotion."}
{"name":"Giratina","type1":"ghost","desc":"Giratina is a ghost/dragon-type Pokémon with a lean, humanoid body and a long neck, often depicted with a green or purple color. It has a slow and mysterious nature, known for its wisdom and power. Giratina is said to have the ability to create portals that allow it to travel between the real world and the Distortion World."}
{"name":"Cresselia","type1":"psychic","desc":"Cresselia, the Lunar Dresser Pokémon. Type: Psychic. Description: Cresselia has a quadruped body with a white and dark gray-blue color, resembling a wolf. It has a crescent moon symbol on its forehead. With a powerful form, it has paws that are extremely quick on foot, in addition to a beautiful crescent moon on its forehead, making it reminiscent of Venus. Cresselia has incredible moon- healing 'powers' being able to use moonblast and safeguard."}
{"name":"Phione","type1":"water","desc":"Phione is a Water-type Pokémon with a dolphin-like appearance. It has a slender body, a beaked mouth, and a ponytail of seaweed. In terms of character, Phione is known for its friendly demeanor."}
{"name":"Manaphy","type1":"water","desc":"Manaphy, the Abyssal Baby Pokémon. It has a sturdy, baby-like appearance, with a round body and short arms. Its skin is mostly pink with a white underside and with a long, ribbon-like structure dangling from its back with fins at its end which are typically blue or green. A wise and majestic Pokémon, Manaphy knows the oceans like the back of its hand, with Water-type moves at its disposal such as Bubble Beam, and Aqua Tail."}
{"name":"Darkrai","type1":"dark","desc":"Darkrai, a Dark-type Pokémon, is a mysterious and dark creature with a black body, no eyes, and a mischievous appearance. It is known to be a nocturnal creature, and its ability is called 'Bad Dreams,' which can give its opponents bad dreams. Darkrai is said to be able to manipulate the dreams of others and is associated with the theme of nightmare."}
{"name":"Shaymin","type1":"grass","desc":"Shaymin is a small, quadruped Pokémon with a pink body and a long, thin tail. It has large eyes and a curious nature. Shaymin can learn various moves, such as Solar Beam and Earthquake, and has a high Special Defense stat."}
{"name":"Arceus","type1":"normal","desc":"Arceus is a primal deity, with the ability to change its form to match each of the 18 elements, and are known for its god-like powers. It often appears with its head held high, showcasing its imposing physique. It is said to embody the spirit of creation, possessing various Plates to enhance its abilities, which grants it the power to create or destroy nearly any thing."}
{"name":"Victini","type1":"psychic","desc":"Victini, the Flame Pokemon, is a Fire-type that has a small, mouse-like appearance with a brown body and a flame on the tip of its tail. It is known to be very curious and has a strong sense of justice. It has the ability to store 'Residue Field' fire in its body, allowing it to rebirth from the flames when its body is severely damaged."}
{"name":"Snivy","type1":"grass","desc":"Snivy is a green, serpentine Pokémon with a forked tongue and yellow rings around its eyes. It has a slender, elongated body that allows it to slither through tight spaces. It is known for being calm and patient, but can be fiercely territorial."}
{"name":"Servine","type1":"grass","desc":"Servine is a bipedal, primarily green Grass-type Pokémon with two small balls on its neck. It has small, button-like facial features, and a relatively tall and slender build. It can grow up to 4 feet in height."}
{"name":"Serperior","type1":"grass","desc":"Serperior is a primarily green, snake-like Pokémon with a long, sinewy body. It has large, yellow eyes and a cream-colored underside. Serperior is known to be a wise and benevolent creature, often appearing in myths and legends. It can learn powerful moves like Earthquake, Solar Beam, and Sword Dance to deal significant damage to its opponents."}
{"name":"Tepig","type1":"fire","desc":"Tepig is a small, pig-like Pokémon with a white underside and brown upper body. It has a distinctive orange stripe running along its forehead. As it grows, Tepig develops sharp teeth and a strong sense of competition."}
{"name":"Pignite","type1":"fire","desc":"Pignite has the head and legs of a chimpanzee, with a large, fluffy coat. This Pokémon has a pair of large ears and sharp teeth. It can emit large amounts of fire from its mouth. It is known to be intelligent and fiercely independent."}
{"name":"Emboar","type1":"fire","desc":"Emboar is a large, quadruped Pokémon with a boar-like appearance, having a orange-brown body, a distinctive crest on its forehead, and two sharp fangs. It is said to have the force of a thousand drums in its beating heart. Emboar can deliver powerful tackles and is known for its fiery passion, making it a formidable opponent."}
{"name":"Oshawott","type1":"water","desc":"Oshawott has a soft, blue otter-like body. It has a sea urchin on its back and two small fins on its head. It's a Water-type and is known for its clever and curious nature."}
{"name":"Dewott","type1":"water","desc":"Dewott, the Octillery Pokémon. Type: Water. Description: Dewott is an Otter-like Pokémon with an Octopus-like body."}
{"name":"Samurott","type1":"water","desc":"Samurott is a quadruped, mammalian Water-type Pokémon with a mammalian appearance resembling a walrus. It has a blue and white body with large tusks and its sharp teeth indicating a fierce predator."}
{"name":"Patrat","type1":"normal","desc":"Patrat are small, rodent-like Pokémon with brown fur and a rounded body. They have large ears, long whiskers, and sharp teeth. They are often found in urban areas, scavenging for food and avoiding predators."}
{"name":"Watchog","type1":"normal","desc":"Watchog is a quadruped, cat-like Pokémon with a black and white spotted fur. It has a distinctive, almost frown-like expression on its face and slender limbs. It is known for being a relatively peaceful and easily distracted Pokémon, though it can become fiercely competitive and territorial at times."}
{"name":"Lillipup","type1":"normal","desc":"Lillipup is a small, canine Pokémon with a fluffy coat and a cute face. It is known for its friendly and energetic personality, often displaying a goofy demeanor. In terms of moves, Lillipup is capable of learning powerful moves such as Sand Attack and Howl."}
{"name":"Herdier","type1":"normal","desc":"Herdier, the Loyal Pokémon. It is a normal-type rodent Pokémon that resembles a sheepdog-like creature, with a light orange coat covered in fluffy fur and a pair of sheep-like ears. Herdier is a loyal and devoted Pokémon that relies on its obedience to its trainers, rarely seeking to go against their will. Its moves include Ominous Wind, Wild Charge, and Iron Head."}
{"name":"Stoutland","type1":"normal","desc":"Stoutland is a canine Pokémon with a stout, muscular build, a grey or brown body with a bushy ruff around its neck, and a distinctive tuft of fur on its tail. It is known to be a pack hunter and a loyal companion, serving as a scout and a protector of its pack. Stoutland can learn powerful moves such as Quick Attack and Hammer Arm to intimidate its opponents."}
{"name":"Purrloin","type1":"dark","desc":"Purrloin is a small, feline Pokemon with a grey and black coat, along with a fluffy tail. It is incredibly agile and quick, often using its speed to catch its opponents off guard. Purrloin also uses this agility to teach tough moves like Trick."}
{"name":"Liepard","type1":"dark","desc":"Liepard is a predominantly gray cat-like Pokémon with a slender and agile build. It has a pointed head, triangular ears, and a distinctive black stripe running through its eyes. Liepard is known for its cunning and mischievous personality."}
{"name":"Pansage","type1":"grass","desc":"Pansage is a largely bipedal, primarily brown Leaf Grass-type Pokémon with a humanoid upper body. It has large leaves on its head that can move. It can throw razor-sharp thorns from its leaves for defense. It is known for its speed and can run and juggle a fruit item that is a blue berry, when thrown at highest speed the item may break apart causing damage to opponents and possibly trigger status effects like burn or paralysis."}
{"name":"Simisage","type1":"grass","desc":"Simisage is a large, quadruped Pokémon with a primarily yellow body and a long, orange and pink swirled mane. It has a distinctive, large nose and forehead markings. It is a skilled fighter and is known for its impressive physical strength."}
{"name":"Pansear","type1":"fire","desc":"Pansear is a Fire-type Pokémon from the fifth generation that resembles a camel. It has a pink body with orange markings, a yellow underside, and a pair of sandy-brown protrusions on its shoulders. Pansear is a hot-headed Pokémon which can cause its body to burn with fiery passion when it's angry or excited."}
{"name":"Simisear","type1":"fire","desc":"Simisear has the appearance of a large, Fire-type squirrel monkey. It is energetic and fiery, often letting its emotions get the better of it. It has been known to use its speed to dodge attacks efficiently, and deal powerful strikes with its tail."}
{"name":"Panpour","type1":"water","desc":"Panpour is a Water-type Pokémon that appears as a small Pokémon with a blue and white body. It has a distinctive pan-like head, a long tail, and a pair of small fins on its ears. Panpour are known to be quick-witted and adventurous, and are often found in coastal areas. They typically know moves like Water Gun, Tackle, and Tail Whip."}
{"name":"Simipour","type1":"water","desc":"Simipour is a Water-type Pokémon that resembles a prawn. It has a large, brown body with a distinctive pair of claws on its pincer-like arms. Simipour is known for its friendly and outgoing personality, and is able to use moves such as Aqua Tail and Distant Call."}
{"name":"Munna","type1":"psychic","desc":"Munna is a Psychic-type of Pokémon. It may be found 'biting lips' through the day-night periods. Munna has a pair of 'sleeping' orifice-like protrusions that it uses to suck in its food and to produce it's odd ability it captures dreams and eats the ones that it is drawn to it also stores the ones that it doesn't like in its 'sleeping' orifice-like protrusions but can also  produce it's own dreams with the ones it likes."}
{"name":"Musharna","type1":"psychic","desc":"Musharna is a quadruped Pokémon that has a blue, rod-shaped body with a cream-colored belly and patches of cream on its back. Its large, round eyes and sweet expression give it a charming appearance. Musharna is known for its calm and gentle nature, and is capable of producing powerful psychic moves to protect its allies."}
{"name":"Pidove","type1":"normal","desc":"Pidove has a small bird-like body with a white underside and a brown back. It has a short beak and a distinctive crest on its forehead. It's a small, lively bird Pokémon that's often seen flying around in flocks."}
{"name":"Tranquill","type1":"normal","desc":"Tranquill is a fast, small avian Pokémon with a distinctive crest on its head, with a small orange beak, a white plumage, a black stripe pattern on its wings, and a pair of white wings. It is known for its fearless attitude and swift flight. Tranquill can learn moves such as Gust and Whirlwind to disorient opponents."}
{"name":"Unfezant","type1":"normal","desc":"It has a crest on its head and big, fluffy feathers on its neck. It is a puffed-out, rather overbearing figure. Unfezant attacks using its feet and wings, and it is also skilled at displaying its vibrant plumage."}
{"name":"Blitzle","type1":"electric","desc":"Blitzle is a small, quadruped Pokémon with a yellow and blue thunderbolt-shaped stripe running along its back. Characteristically, it has six yellow sparks running around its neck, four red sparks on either side of its head, and one blue spark on its forehead. As a wild Pokémon, it is prone to getting bored and restless, and it moves around frequently in search of stimulation."}
{"name":"Zebstrika","type1":"electric","desc":"Zebstrika has a mostly black body with nine yellow stripes and a cream-colored tail. It has a strong and impulsive personality. It can learn the moves Thunderbolt, Flame Wheel, and Iron Tail."}
{"name":"Roggenrola","type1":"rock","desc":"Roggenrola is a Rock-type Pokémon. It has a stone-like body and a face with a stubborn expression. It can produce a strong, oppressive aura that inhibits the movements of those around it. In this state, a place appears on its head where a single gemstone rests as power accumulates within. In the wild, it appears to live in mountainous areas and are said to be attracted to the resonant sound of rocks. Its gemstone is said to glow brighter when the sense of justice in its surroundings has been infringed upon."}
{"name":"Boldore","type1":"rock","desc":"Boldore is a Rock-type Pokémon with a sturdy body and a distinctive horn on its forehead. It is known for its robust appearance and can often be found in areas with rocky terrain. It is a determined creature that will fiercely defend its territory."}
{"name":"Gigalith","type1":"rock","desc":"Gigalith is a large, rocky Pokémon with a distinctive head shaped like a geode, adorned with two pointed rocks resembling horns. It has a rugged, boulder-like body with a variety of cracks and fissures. It is a Ground-type Pokémon."}
{"name":"Woobat","type1":"psychic","desc":"Woobat appears a small, bat-like Pokémon with dark-gray fur and a bulbous head. It is known for its ability to fly away from danger with its broad ears."}
{"name":"Swoobat","type1":"psychic","desc":"Swoobat has a small, black body, with white and yellow markings that resemble a bat. It has a slender build and large ears. It appears somewhat humanoid yet more reptilian in its skull feature."}
{"name":"Drilbur","type1":"ground","desc":"Drilbur is a burrowing insectile Pokémon with a rodent-like appearance. It has a brown body with a distinctive white stripe on its forehead. Drilbur is known for its energetic personality and its ability to dig complex tunnel networks."}
{"name":"Excadrill","type1":"ground","desc":"Excadrill is a subterranean Pokémon with a bulky, blue and brown body, and a distinctive set of drills on its body. It has a tough, rugged appearance and a strong, robust build, suitable for digging and combat. It is known for its impressive strength and agility."}
{"name":"Audino","type1":"normal","desc":"Audino has a round body with a white and pink appearance. It's a friendly and caring Pokémon. It learns healing moves like Moonblast and Hyper Voice."}
{"name":"Timburr","type1":"fighting","desc":"Timburr evolved from Pidove and Pidove evolved from Tranquill which evolves further into Starly. It is a quadruped Pokémon with a relatively small body, it appears to wear a combat helmet. It is a bit burly and has a stumpy tail, and the combat helmet is an interesting sort of headgear."}
{"name":"Gurdurr","type1":"fighting","desc":"Gurdurr's bulky body is a grayish-blue color. Its eyes are yellow and two spiky plates on its shoulders can charge up with electricity. Gurdurr is known to be extremely strong and can even lift heavy objects easily. In terms of character, it is a strong-willed Pokémon that will not back down from a fight. Gurdurr could know moves like Hammer Arm, Crunch and Iron Head."}
{"name":"Conkeldurr","type1":"fighting","desc":"Conkeldurr is a large, muscular human-like Pokémon with thick, muscular limbs, torso, arms, and forehead. It has a typical fist raised when seen inside, always clenching one hand. Conkeldurr appears to be an odd human boxing and pugilistic fighting techniques expert. Ability to have devastating fighting skills which is why it masters heavy strikes that are of extraordinary levels that has force unlike other Pokémon"}
{"name":"Tympole","type1":"water","desc":"Tympole's body is a long, cylindrical shape, often found in bodies of water. These Pokémon are known to be mischievous and quite playful. It can use its ability to produce high pitched sounds to lure in prey in addition of its standard movesets including Water Gun and Sonic Boom."}
{"name":"Palpitoad","type1":"water","desc":"Palpitoad is a semi-aquatic Pokémon that has a blue body with distinctive red markings on its throat, belly, and underside of the tail, with a yellow pattern underneath its eyes. It has a slender body for its size and long, powerful legs for swimming and jumping. Palpitoad is known to be territorial and can be quite aggressive when defending its space."}
{"name":"Seismitoad","type1":"water","desc":"Seismitoad appears as a large, dark toad with three clawed arms and a set of sharp, claw-like nails, and its large dark grey eyes gleam with electricity within it. When calm, it does little to stand out from other toads, but when frightened, it secretes a powerful acid and moves swiftly, and the poison it secretes from its body allows it to deliver painful hits, which results in extreme pain, giving it an incredibly eerie appearance to its opponents. In relation to its acid-secreting environment it is drawn commonly,"}
{"name":"Throh","type1":"fighting","desc":"A martial arts expert Pokemon that has a brown upper body and green lower body.   Throh is known for being an assertive and strong-willed Pokémon, which makes it a formidable opponent on the battlefield. Its fighting technique is based off of full-contact karate, often using strikes and blocks to evade and throw opponents."}
{"name":"Sawk","type1":"fighting","desc":"Sawk's physical appearance as a humanoid Pokémon has largely distinctive facial features. It maintains its strength by utilizing its robust, muscular physique, and the flexibility of its hands and legs. Sawk can proficiently handle the various martial arts-based moves through its physical strength."}
{"name":"Sewaddle","type1":"bug","desc":"Sewaddle is a small, bipedal Pokémon with a bug type. It has a Sewaddle brown color and two large eyes. In terms of moves, it can use skills like Razor Leaf."}
{"name":"Swadloon","type1":"bug","desc":"Swadloon appears to be a big, grub-like Pokémon. It is white with black stripes and it has large, round eyes on either side of its head. It is known to be a defensive-minded Pokémon that can use its speed and agility to outmaneuver its opponents. It can learn a variety of attacks, including Bug-type moves like X-Scissor and Bug Bite, as well as Fairy-type moves like Dazzling Gleam and Moonblast."}
{"name":"Leavanny","type1":"bug","desc":"Leavanny is a large bug/flying-type Pokémon with leaves on its head, a long brown body and a pair of large green leaves on its back. It has large legs, is known for its meek and timid personality. In battle, Leavanny is known for its use of Razor Leaf, Leaf Blade and Leaf Storm."}
{"name":"Venipede","type1":"bug","desc":"Venipede is a Bug/Ground-type Pokémon that has a scarab beetle-like appearance with a brown and yellow striped body. It is a very aggressive Pokémon. Its appearance changes from larval to adult once it reaches a certain age through level leveling up"}
{"name":"Whirlipede","type1":"bug","desc":"Whirlipede is a large, rolling insect with a brown body and eight spindly legs. It appears to be constantly moving, as if propelled by its many legs. Whirlipede is known for its speed and agility, and can roll at high velocities to attack opponents."}
{"name":"Scolipede","type1":"bug","desc":"This insectoid Pokémon is known for its menacing appearance with its scythe-like tail. Scolipede is characterized as brave but at the same time incredibly violent and territorial. It uses its scythe-like tail to defend itself."}
{"name":"Cottonee","type1":"grass","desc":"Cottonee is a small, cloud-dwelling Pokémon with a fluffy white body resembling a cotton ball. It has a rather timid nature but can be fierce when threatened. Cottonee is capable of using various moves such as Tackler, Dust Storm, and Dazzling Gleam."}
{"name":"Whimsicott","type1":"grass","desc":"Whimsicott is a Fairy-type Pokémon that resembles a cotton ball-like creature with a large, fluffy tuft on its head. Its fluffy tuft is actually made up of cotton puffs. Whimsicott is a gentle, carefree Pokémon that is known for its playful and whimsical nature."}
{"name":"Petilil","type1":"grass","desc":"The bulb-like plants on its face can photosynthesize sunlight into power. It is a gentle Pokémon that loves nothing more than being pampered and cared for. Petilil uses its powers to put its opponents to sleep with the sweet scent of the plants on its face and then overwhelms them with its incredible speed."}
{"name":"Lilligant","type1":"grass","desc":"Lilligant is a large, flower-like Pokémon with a mostly tan body. It has white petals for wings and a green stem-like head with a yellow interior. In addition, it has a long, green and tan stem on its back that appears capable of moving on its own, further supporting its botanical appearance."}
{"name":"Basculin","type1":"water","desc":"Basculin is a fish-like Pokémon with a distinctive appearance, characterized by its rounded head, elongated body, and large, prominent fins. It has a shiny silver scales in the east sea, while it has gold scales in the west sea. In terms of personality, Basculin is known to be a timid and wary Pokémon that tends to hide when it feels threatened or scared."}
{"name":"Sandile","type1":"ground","desc":"Sandile, the Reptile Pokémon, is known for its dark and desert-like appearance. It has a stocky body covered with dark brown armor plates, a small head, and powerful claws that resemble snakes. With its quick movements and sand-like skin, Sandile can be found in arid environments, sandstorms included. Sandile is a cunning and fiercely competitive Pokémon known for its powerful jaws that snap shut at lightning speed, making its opponents face some seriously intense competition. Sandile can utilize various attacks including Sand Attack and Dig but the most popular of all is Guillotine. However when sandile evolves at level 36 into its species Krokorok and possesses abilities with another incredible boost in its physical ability to land attacks."}
{"name":"Krokorok","type1":"ground","desc":"Krokorok is dual Ground/Dark type Pokémon and is the evolved form of Krokorodile. It has a distinctive appearance of a crocodile with a large body, strong jaws, and sharp teeth. Krokorok primarily lives in desert regions and is known to be territorial."}
{"name":"Krookodile","type1":"ground","desc":"Krookodile appears as an anthropomorphic crocodile with a massive body and imposing physical stature. The Pokémon seems to possess an amiable and diligent attitude. Krookodile can use a variety of powerful physical moves as well as battling skills learnt from its ancestors."}
{"name":"Darumaka","type1":"fire","desc":"Darumaka is a Fire-type Pokémon that appears as a small, brown monkey-like creature with a distinctive flame on its forehead. It has a strong and physical build, with powerful arms and a broad chest. Its facial features are quite relaxed and laid-back, reflecting its calm nature in real-world situations."}
{"name":"Darmanitan","type1":"fire","desc":"Darmanitan is a fictional creature with the appearance of a red anthill dwelling desert tortoise-like Pokémon possessing humanoid features such as hands and feet. It's often portrayed as a friendly and docile creature however a powerful fiery temper can trigger it to go on a violent rage. Its known moveset include Fire Blast, Flame Charge, and Darkest Lariat."}
{"name":"Maractus","type1":"grass","desc":"Maractus is a grass/dragon-type Pokémon resembling a yucca plant with long, green, branchy arms. In appearance, Maractus seems like an armoured 'yucca plant', "}
{"name":"Dwebble","type1":"bug","desc":"Dwebble is a bug/rock-type pokemon that has a resemblance of a snail while possessing large claws for defense against potential predators. Dwebble often moves slowly, retreating back into its shell for safety when attacked. As to moves, Dwebble can use attacks such as Shell Smash and Sand Attack."}
{"name":"Crustle","type1":"bug","desc":"Crustle, the Diggersby Pokémon. From deep within the earth, it emerges to battle. Its body is roughly shaped like a claw, with a hard shell forming its body covered with two brown claws at the front and two tan claws at the rear."}
{"name":"Scraggy","type1":"dark","desc":"Scraggy is a mix of sand and spider, having its insect-like legs and darker body colors giving it an earthy appearance. It is known for its devious nature and mischief. Scraggy is capable of learning a range of moves include Shadow Sneak, Sucker Punch, and Vacuum Wave."}
{"name":"Scrafty","type1":"dark","desc":"Scrafty is a dark-based dog pkémon with a large underbite and a mix of brown and grey fur. Scrafty has the appearance of a wild dog, but has a intimidating presence. She wields a sharp set of teeth, and can be known to be quite hostile and territorial."}
{"name":"Sigilyph","type1":"psychic","desc":"Sigilyph is a large, mysterious, quadruped Pokémon with a pale, serene face and six stately, ornate pillars protruding from its 'head', resembling a majestic statue. It has a serene expression and is often associated with the mystic arts. It has the ability to fly using its pillars, which resemble ancient columnar structures. Sigilyph often exudes an arcane aura, adding to its mystique."}
{"name":"Yamask","type1":"ghost","desc":"Yamask is a skull-like Pokémon with a mysterious appearance. It has a calm and intelligent demeanor, often seen pondering about its own existence. Its special moves include Shadow Ball, Shadow Sneak, and Ominous Wind."}
{"name":"Cofagrigus","type1":"ghost","desc":"Cofagrigus is the evolved form of Cofagrigus and has a mummified body that resembles a sarcophagus, with a coffin-shaped head and a stone-like complexion. It has a rather intimidating presence, often perceived as inanimate. Its standard moves include Imprison, Fake Out, and Earthquake."}
{"name":"Tirtouga","type1":"water","desc":"Tirtouga is a small, turtle-like Pokémon with a rough shell on its back, a rounded abdomen, and a distinctive set of spikes on its shoulders. It has a yellowish-brown shell that helps protect it from predators. It is known to be a calm and gentle creature."}
{"name":"Carracosta","type1":"water","desc":"Carracosta is a Turtle-like Pokémon. It has a large shell, two small arms on its torso, and three distinctive horns on its head. It's known to explore underwater caverns and can grow to a length of over six feet, but has a relatively small size compared to its height. It uses its horns to break apart coral reefs into pieces it can eat."}
{"name":"Archen","type1":"rock","desc":"Archen (the rock type Stage 1 evolution of Aron) is a bird/fossil Pokémon that appears in a pale color with no tail or neck. This diminutive, stumpy-looking bird-type Pokémon features an adorable appearance with wings too small to use in flight and is known to show a clear affinity for being protective of its friends."}
{"name":"Archeops","type1":"rock","desc":"Archeops are described as avian Pokémon resembling Pterodactyl, with brown body, pointed tail, a crest above the head, and a sharp beak."}
{"name":"Trubbish","type1":"poison","desc":"Trubbish is a toxic waste-dwelling, rodent-like Pokémon that resembles a garbage-rat. Its body is primarily made up of garbage, and it has two small trash heap-like structures on top of its head that glow when it is angry or after battling. Trubbish has the ability to camouflage itself using its trash heap structures."}
{"name":"Garbodor","type1":"poison","desc":"Garbodor is a toxic, mushroom-like Pokemon with a distinctive body covered in trash bags and dirt. It has a distinctive, unpleasant odor that it uses to defend itself. Garbodor is known for its wild, aggressive behavior and uses its long arms to flail at its opponents."}
{"name":"Zorua","type1":"dark","desc":"Zorua appear mostly as a desert fox but then turn into a white tiger like fox in full moon, there are also minor  differences. They are friendly but have a tendency to hide secrets.  Zorua are known to have bite as their signature move and also have ferocity move."}
{"name":"Zoroark","type1":"dark","desc":"Zoroark, the Illusion Fox Pokémon. Type Dark. It has a black fox-like body accompanied by dark, rectangular markings on the shoulders whose shape can convert into different types. It has the ability to disguise itself into any form or object very quickly and can store the memory."}
{"name":"Minccino","type1":"normal","desc":"Minccino, the Cottonball Pokémon, is a small, fluffy white creature with two tufts of cotton on its cheeks, a fluffy nose, and a playful demeanor. It is known for its mischievous personality and adorable appearance. In the wild, Minccino can be found using its moves like Round and Follow Me to distract its opponents and lead them on wild goose chases."}
{"name":"Cinccino","type1":"normal","desc":"Cinccino is a small, rabbit-like Pokémon with a slender and agile body. It has a pink-brown coat and a long, stringy coat with long white stripes on its front. Its ear tips have fringe and a fluffy tail with a white stripe following the centre of the spine through to the end of its fluffy tail."}
{"name":"Gothita","type1":"psychic","desc":"Gothita is a pink, ghost/poison-type Pokémon with a slender and feline appearance. It has a pair of triangular ears, a crescent moon on its forehead, and a small tail. As for its character and moves, Gothita is often seen as being highly sensitive and curious."}
{"name":"Gothorita","type1":"psychic","desc":"Gothorita is a Ghost/Psychic-type Pokémon that resembles a spirit-like figure with a dark, ghostly appearance. It has a circular body with multiple lights that give it an ethereal feel. Gothorita can learn various moves such as Shadow Ball, Psychic, and Spite."}
{"name":"Gothitelle","type1":"psychic","desc":"Gothitelle is a Ghost/Psychic-type Pokémon with a slender, black-and-white ghost-like appearance. It has a calm and mysterious demeanor. As the final evolution of Munna, Gothitelle's high Special Attack stat is complemented by its ability to learn both powerful moves like Shadow Ball and supporting moves like Imprison."}
{"name":"Solosis","type1":"psychic","desc":"Solosis, the Dazzling Mirage Pokémon. Solosis has a lean, oval-shaped body, and a slender tail that it uses to sense its surroundings. It can change the shape and color of its body to confuse predators in the wild."}
{"name":"Duosion","type1":"psychic","desc":"Duosion appears as a pink, humanoid-like Pokémon with slender limbs. It has large, round eyes and typically a calm demeanor. It is known for its ability to use and adapt various moves."}
{"name":"Reuniclus","type1":"psychic","desc":"Reuniclus (Japanese: タショル Tashol) is a type of Pokémon in the sixth generation. It is a dual Psychic/Fairy-type Pokémon and is often described as having a round, blue and white appearance reminiscent of an octopus with long, yellow tentacles. Reuniclus is known for its intelligent and curious nature. Reuniclus learns a variety of moves including Psychic, Ominous Wind, Protect, Charge Beam and Power Gem."}
{"name":"Ducklett","type1":"water","desc":"Ducklett appears as a hybrid of a bird and duck with brown and gray feathers. Its eyes are a piercing brown. It can evolve into Swanna at level 35."}
{"name":"Swanna","type1":"water","desc":"Swanna is a large, waterbird-like Pokémon with white feathers and a distinctive crest on its head. It is often found in beaches and coastal areas. Swanna can develop from Mismagius and its powerful moves include aerial attacks such as Hydro Pump, Ice Beam, and Aeroblast."}
{"name":"Vanillite","type1":"ice","desc":"Vanillite appears to be a pale blue, rod-shaped Pokémon with a rounded bottom and a flat top. It has a clear or translucent body that is capable of losing heat rapidly. It can be found in cold climates."}
{"name":"Vanillish","type1":"ice","desc":"It has an iridescent, crystalline structure that stores the cold air that it absorbs. Its eyes glow bright blue. It is usually seen wandering around to absorb heat from the surrounding."}
{"name":"Vanilluxe","type1":"ice","desc":"Vanilluxe is an Ice-type Pokémon that resembles an iced cream cone. It is known for its friendly and cute appearance, with a big smile on its face. As for its moves, Vanilluxe can use moves like Blizzard and Icicle Crash."}
{"name":"Deerling","type1":"normal","desc":"A deer-like Pokémon that changes color depending on the season. During the spring, it is orange and has a green crown; in the summer, it is red; during the fall, it is yellow; and in the winter, it is white."}
{"name":"Sawsbuck","type1":"normal","desc":"Sawsbuck has a quadruped appearance, with a fawn-like body, a pair of curved antlers, and a fluffy mane. It has a curious nature and is known to be fiercely independent. Its primary moves involve melee attacks like tackle and its signature ability, Sap Sipper."}
{"name":"Emolga","type1":"electric","desc":"Emolga is a rodent-like Pokémon with yellow fur, blue underwing pouches, and black stripes on its back. It has a rodent-like face with a pink nose and a long, thin tongue. It can generate electric currents in its body, which can be discharged as electricity from its cheeks."}
{"name":"Karrablast","type1":"bug","desc":"There are several physical adaptations which help Karrablast protect itself from predators. It has a hard exoskeleton and uses its horn to attack foes. Its red color stands out for its mates when it is time to breed"}
{"name":"Escavalier","type1":"bug","desc":"Escavalier appears as a beetle-like Pokémon with a metal exoskeleton, a large head, and a pair of large antennae. It has a serious and vigilant nature,  it tends to stay alert and wait for the right moment to attack. Its moves include a combination of Steel-type physical attacks, such as Iron Head and Close Combat."}
{"name":"Foongus","type1":"grass","desc":"Foongus is a real fungal-type Pokémon with red caps and white stems, and it can be found in various regions of the world including the Alola region. In terms of character, Foongus is a bit on the timid side and often sticks to itself. Its moveset is pretty eclectic, including a variety of status conditions such as Poison and Sludge Bomb."}
{"name":"Amoonguss","type1":"grass","desc":"Amoonguss is a perennial grass/ground-type Pokémon that has a long, slender stem with oval-shaped leaves and a cap-like structure. It has a serene and tranquil appearance, with its pale green color and delicate features. Amoonguss is known for its ability to use powerful moves such as Solar Beam and Sludge Bomb, showcasing its diverse range of skills."}
{"name":"Frillish","type1":"water","desc":"Frillish is a Water/Fairy-type Pokémon that has a distinctive, translucent appearance. It has a large frill on its head and long, flowing hair. Frillish is known for its ability to create illusions and is often found in the ocean, where it uses its speed and agility to evade predators."}
{"name":"Jellicent","type1":"water","desc":"It creates a whirlpool by thrashing its tails and is said to devour sailors who sail through it. Its body glows in the dark, and its face can be seen even at the bottom of the sea. It creates massive whirlpools with its tails, and when it hits its target with its bodies, it causes massive damage."}
{"name":"Alomomola","type1":"water","desc":"Alomomola are small, fish-like Pokémon with a pink body and a white belly. They are gentle and friendly. They have a vast knowledge of the ocean and can describe the entire ocean's history. They may use Recover, Withdraw, and Moonblast as moves."}
{"name":"Joltik","type1":"bug","desc":"Joltik is an Electric/Bug-type Pokémon. It has a large, spherical body covered in a thin, white layer of urticating hairs that can repel predators. Joltik is known to be a swift and agile Pokémon."}
{"name":"Galvantula","type1":"bug","desc":"It has a spider body covered in strong, dark-blue shells, and on its round abdomen, it has a pattern of red and blue resembling a galvanian electricity badge. Character-wise, Galvantula is not very timid and as such tends to pack a punch very freely. It uses its eight legs to pounce on opponents and then attacks using its poisonous fang. The only move it sees fit to utilize is Cross Poison, its poison is fast and can provide a fatal blow."}
{"name":"Ferroseed","type1":"grass","desc":"Ferroseed appears to be a small, round seed-like Pokémon with a metallic exoskeleton and a small stem on top. It has a tendency to be clumsy and careless, but it is also fiercely protective of its friends. Ferroseed can use its metallic body to spin around and fling its seeds at opponents."}
{"name":"Ferrothorn","type1":"grass","desc":"Ferrothorn is a Grass/Steel-type Pokémon with a thorn-like body and a wide, leaf-like structure on its head. It is known for its toughness and tenacity, and is often found in areas with dense foliage. Ferrothorn is capable of using powerful moves like Power Whip and Gyro Ball."}
{"name":"Klink","type1":"steel","desc":"Klink, the Model Pokémon resembles a large metal ball with a pair of arms protruding from opposite sides. It is a highly intelligent and resourceful Pokémon that is known for its intricate mechanical designs. It is able to use its own body as a rotor, generating electricity through its spinning arms."}
{"name":"Klang","type1":"steel","desc":"Klang is a Steel-type Pokémon with a cylindrical body that resembles a drum. It has a dark metallic color with a silvery sheen and several small, silver accents on its body. They are known for their musical abilities, often in a rhythmic sense, and their ability to change musical pitch."}
{"name":"Klinklang","type1":"steel","desc":"Klinklang has a large brass body that resembles a gear, with gears covering its arms and legs, and two small gears on top of its head. It has no visible eyes but is highly perceptive. It attacks by biting and reorienting gears to crush opponents."}
{"name":"Tynamo","type1":"electric","desc":"Tynamo has an electrically charged, ocean-dwelling lower body and a rounded, bubble-like head with a curved mouth. It has a quill-like crest above each eye. Its electric powers are extremely powerful."}
{"name":"Eelektrik","type1":"electric","desc":"Eelektrik is an Electric-type Pokémon with a muscular body covered in a layer of yellow and black electrically charged fur. It has bright yellow eyes and a menacing grin. Eelektrik is known to be fiercely territorial and can release powerful electrical attacks"}
{"name":"Eelektross","type1":"electric","desc":"a large, snake-like Pokémon with a blue electrically charged body and a crown-like marking on its head. It is known for being a fierce and proud Pokémon with a stubborn personality. Eelektross can learn moves such as Thunderbolt, Wild Charge, and Hammer Arm."}
{"name":"Elgyem","type1":"psychic","desc":"Elgyem have a rounded, pale blue body with two black eyes and a black 'mask' across its eyes. They are intelligent, mystical Pokémon, described as very spiritual and intelligent with a feeling of being very old. In battle, it is capable of using powerful moves like Force Palm and Explosion."}
{"name":"Beheeyem","type1":"psychic","desc":"Beheeyem is an Electric/Psychic-type Pokémon. It has the appearance of a beaver, with white fur and black eyes. It is gentle and can sense the feelings of others."}
{"name":"Litwick","type1":"ghost","desc":"A minuscule but highly reverent Pokémon with a selfless spirit.  Litwick is a tiny, lizard-like Pokémon that have an inverted nature with the flame resting on its head instead of inside its body.  Litwick moves quickly, striking from an unusual angle and releases its lit-tail with a hissing sound.  The moves it can be taught are Smog, Flame Wheel, Flamethrower, or Fire Blast"}
{"name":"Lampent","type1":"ghost","desc":"Lampent is a Ghost/Fire-type Pokémon that appears as a spirit with a green body and red glow in its chest. It has a unique, ethereal appearance and is known for its glowing embers. Not much is known about its character."}
{"name":"Chandelure","type1":"ghost","desc":"Chandelure is an invisible, bodyless Pokémon with a large, glowing lantern-like structure in the front of its face. It has a predominantly red and yellow appearance. It tends to appear in spiritual places, bringing warmth and light."}
{"name":"Axew","type1":"dragon","desc":"Axew is a quadrupedal Pokémon with a dinosaur-like appearance, having scaly gray skin and a long tail. It has a relatively short body and short legs."}
{"name":"Fraxure","type1":"dragon","desc":"Fraxure has a white and green scaly body and its spiky crest can be cracked open to reveal a spiked shell inside. It possesses a ferocious and aggressive nature, causing fear and anguish to those that see it. It has sharp claws and possess an impressive amount of speed, and Fraxure is known to learn powerful moves such as Dragon Claw and Outrage."}
{"name":"Haxorus","type1":"dragon","desc":"Haxorus resembles a cross between a lizard, a serpent, and an extinct species of long Snout dinosaur ,it has a large yellow or pale scaly body giving it a somewhat flat appearance.. Haxorus as a type has a calm down personality, but it gets very upset if its opponent is still standing during battle.  Haxorus is also known for its massive strength and highly potent speed. Haxorus may also strike opponents with its quick reflexes ,  leaving its opponents in shock.  Typical Haxorus moves include Outrage, Earthquake, Stone Edge, Dragon Dance, and ExtremeSpeed."}
{"name":"Cubchoo","type1":"ice","desc":"Cubchoo is an evolved form of Churulele. It is known to be a largely yellow, woolly, sheep-like Pokémon with a small beak on the end of its nose and big brown eyes, generally resembling sheep but having 'fluffy legs', sharp teeth and claws, and in some way, looking somewhat cute at times, making it similar to Ussha, the real-life animal that it is based on except for some differences. Cubchoo are known for being small, small enough that it can crawl underneath a blanket. Cubchoo are generally easy-going and innocent and innocent, giving it an endearing appearance. It also is good at being social, which often puts trainers in easy situations when it sometimes becomes easy-going, non-responsive to commands or, on occasion, causing problems when it uses its large mouth to eat wool. Cubchoo tend to not see predators as being particularly threatening. It is also known for possessing preheated, icy gusts."}
{"name":"Beartic","type1":"ice","desc":"Beartic is a powerhouse of a Pokémon, resembling a polar bear as it sports the same white, yellow, and black fur colors. In battle, it is known for its ability Ice coverage, a move set it often uses through its massive ice-based attacks. Beartic's bold nature pushes it to test its strength against any opponent."}
{"name":"Cryogonal","type1":"ice","desc":"Cryogonal is a dual Ice,Water-type Pokémon that is said to have originated in regions with low temperatures, where its body composed of ice crystals is meant to aid it in making life difficult."}
{"name":"Shelmet","type1":"bug","desc":"Shelmet is a steel/water-type Pokémon. It has a large, hammer-like head that resembles a helmet, with a small body and three large claws. Shelmet is known to be timid and can be easily startled, often hiding under rocks or behind other objects to feel safe. It uses its hammer-like head to both defend itself and crack open rock for food, and is often found in rocky, mountainous regions."}
{"name":"Accelgor","type1":"bug","desc":"It has a high body and a series of small black spots on its back. Its body also has a pattern resembling a comb. Accelgor can move extremely fast."}
{"name":"Stunfisk","type1":"ground","desc":"Stunfisk is a Ground-type Electric-type Pokémon that resembles a fish-shaped Metal Slug. It often curls up, protecting its body with its cheeks, and floats at the bottom of the ocean."}
{"name":"Mienfoo","type1":"fighting","desc":"Mienfoo is a small, agile, and fragile looking Pokémon with red skin and a distinctive face with a large, round cheek. Its small arms and legs are slender, and it has a peculiar way of walking. As a martial artist-type Pokémon, it is known for its grace, elegance, and devastating martial arts skills, it has a few moves in its arsenal such as the strong Dynamic Clash and simple Counter."}
{"name":"Mienshao","type1":"fighting","desc":"a fighting-type monkey-like Pokémon with a predominantly orange fur, an orange and brown tail"}
{"name":"Druddigon","type1":"dragon","desc":"Druddigon is a large, dragon-like Pokémon with a primarily dark gray body, reminiscent of a wyvern. It has a distinctive frill on its head, a long neck and tail, and two sharp horns. Druddigon is known for its imposing appearance and aggressive behavior, and it is said to be a force to be reckoned with on the battlefield. Some notable moves of Druddigon include Dragon Claw and Iron Tail."}
{"name":"Golett","type1":"ground","desc":"Golett is a Ground/Ghost-type Pokémon. It appears as a golem statue covered in mud with a mysterious glowing crystal on top of its head. It has a quiet and reserved personality, with a tendency to be extremely strong and stubborn, although it rarely attacks unless provoked."}
{"name":"Golurk","type1":"ground","desc":"Golurk is a ghost type of Pokémon, who has a large body covered by stone scales which gives it a greyish, rugged appearance. It is a fierce and strong Pokémon with a very small amount of body fat, giving it a lean, muscular build. Its most common moves include Shadow Sneak, Earthquake and Stone Edge, all of which utilize its substantial physical strength"}
{"name":"Pawniard","type1":"dark","desc":"Pawniard, the Cut Steel Pokemon, has a battle-ready appearance with a humanoid upper body, metal limbs, and sharp, sword-like ends on its gloves. In the anime, Pawniard is often portrayed as a fierce and disciplined warrior. As a Steel/Fighting-type, Pawniard has access to powerful moves such as Iron Head and Metal Claw."}
{"name":"Bisharp","type1":"dark","desc":"A steel/stab insectoid Pokémon It has a sharp scythe in the place of a stinger. It acts with speed, finishing one thing and jumping right into the next one fast."}
{"name":"Bouffalant","type1":"normal","desc":"Bouffant is known for having two large, curved horns protruding from its brown, fawn-like head. On its body, Bouffant has stripes that provide camouflage in grasslands and forests. Bouffant is an unaggressive, gentle creature that mostly feeds on nutrients-rich plants, and it can charge at opponents with its powerful horns."}
{"name":"Rufflet","type1":"normal","desc":"Rufflet is a small, yellow bird Pokemon with a red face and a fluffy tuft on its head. It has a comb above its beak and a distinctive sound signal that other Rufflet birds use to communicate. It is known to be friendly and fiercely loyal to its Bird Keeper."}
{"name":"Braviary","type1":"normal","desc":"Braviary has a large, lion-like body with red and white feathers. The Pokemon moves on two massive legs and features a fierce expression. Braviary wields powerful moves to intimidate its opponents. It boasts an intimidating presence and a keen sense of heroism. Using its wings, Braviary can run at high speeds. It lives in the wild in accordance with the laws of its pride."}
{"name":"Vullaby","type1":"dark","desc":"Vullaby is a bird-like Pokémon covered in a layer of downy, fluffy feathers. It has a beak that resembles a skull. It uses its sharp talons to defend itself."}
{"name":"Mandibuzz","type1":"dark","desc":"Mandibuzz, a Dark/Flying-type Pokémon, is known for its vulture-like appearance with a predominantly black plumage, a distinctive beak-like mouth, and sharp talons. It is often seen as a carrion-eater and is prevalent in various regions. Mandibuzz is said to possess a strong spiritual connection, allowing it to sense the emotions of others through its keen sense of smell."}
{"name":"Heatmor","type1":"fire","desc":"Heatmor is a Fire-type Pokémon that resembles a rodent with a lizard-like head, it has a fire-like moth antenna on its head and has furry body. It is known for being highly intelligent and very aggressive using its speed to overwhelm opponents. Heatmor can learn a variety of Fire-type moves like Flame Charge, Fire Blast."}
{"name":"Durant","type1":"bug","desc":"Durant is a Steel/Bug-type Pokémon said to have spawned from the treasures found in caves. It has a metallic body, and it has poor eyesight. It has very low eyesight, and it uses its other four senses to navigate and find its prey."}
{"name":"Deino","type1":"dark","desc":"Deino is a small, quadruped Pokémon that resembles a dinosaur or a dragon with a mix of scales and fluffy fur. Its eyes glow in the dark, and it has sharp teeth. Deino can evolve into Zweilous and Draconix, and its fierce bark creates powerful shockwaves when used in battle."}
{"name":"Zweilous","type1":"dark","desc":"Zweilous is a dark/dragon-type Pokémon that has a wolf-like appearance. It has a black body with a spiky, gray mane running down its back. It is known to be a malevolent Pokémon that enjoys causing chaos and destruction, using its sharp claws and powerful jaws to attack its opponents."}
{"name":"Hydreigon","type1":"dark","desc":"Hydreigon has a dragon-like appearance, with a large mouth and sharp teeth. It is characterized by its aggressive personality and can be very territorial. It's moves include Fire Fang, Crunch, and Outrage."}
{"name":"Larvesta","type1":"bug","desc":"Larvesta is a Fire/Ice-type Pokémon that has a short, armored body with a longer, furry cloak. Its body is a mixture of silver and gold feathers. Larvesta has a striking ability to change color, which is often used for adaptation."}
{"name":"Volcarona","type1":"bug","desc":"Volcarona is a Bug/Fire-type Pokémon that appears as a moth-like Pokémon with a large, spherical body and long, thin legs. Its body is covered in a sparkling, gem-like exoskeleton, and it has a flamboyant, nearly mythical aura. In the wild, Volcarona can spin its cocoon to defend itself, generating a flammable gas and then igniting it to drive predators away with a wave of fire as its protection."}
{"name":"Cobalion","type1":"steel","desc":"Cobalion is a quadruped, draconic Pokémon with a metal body, sporting two curved horns and a number of sharp points along its body. It is known for being one of the three oldest Pokémon, said to have been in existence since the dawn of time. It is known for being highly intelligent and noble."}
{"name":"Terrakion","type1":"rock","desc":"Terrakion has a bulky appearance with a combination of yellow, black, and white on its body. It is known for being brave and courageous, with a strong sense of justice and a desire to protect its allies."}
{"name":"Virizion","type1":"grass","desc":"Virizion is a Steel/Fairy-type Pokémon resembling a deer with a serpentine tail. It is known for its swift movements and gentle nature, yet it can be fierce in combat. Virizion's special moves include Iron Head and Last Resort."}
{"name":"Tornadus","type1":"flying","desc":"Tornadus is a mythical, avian Pokémon with a bird-like body and wings that enable it to generate tornadoes. It is known for its incredible speed and agility, allowing it to fly at high velocities and move with incredible rapidity. Its plumage is said to be incredibly beautiful when it flies."}
{"name":"Thundurus","type1":"electric","desc":"Thundurus is an Electric/Flying-type Pokémon that resembles a Thunderbird from mythology. It has a large body, with darker colors on its wings and a lighter colored underside. It is known for its powerful electrical attacks, and its signature move, Thunderbolt."}
{"name":"Reshiram","type1":"dragon","desc":"Reshiram is a large, serpentine Pokémon with a predominantly blue and red plumage, its body resembling a mix of a serpent and a dragon. It has wings and a long tail that allows it to fly. Reshiram can radiate intense heat from its body that boils water."}
{"name":"Zekrom","type1":"dragon","desc":"Zekrom is a large, dragon-like Pokémon with a mostly black body, electric-blue accents, and glowing red eyes. It has a distinctive hammer-like tail and two pointed horns on its head. It is known for its impressive strength and intimidating presence, with a character that can range from noble to menacing."}
{"name":"Landorus","type1":"ground","desc":"Landorus is a Ground/Flying-type Pokémon with a quadruped like appearance, it has two curved horns and a spiky back. Known for being a powerful and fierce entity, it can sometimes be seen as mischievous. It can learn powerful moves such as Earthquake and Stone Edge."}
{"name":"Kyurem","type1":"dragon","desc":"Kyurem was a giant, powerful dragon-like Pokémon with blue skin. It said to have existed long before any other Pokémon and had a strong sense of self-preservation. By using its special move, Kyurem could transform into Black Kyurem or White Kyurem"}
{"name":"Keldeo","type1":"water","desc":"Keldeo is a White Pokémon with a red spot on its forehead, resembling a crown. It is a Water-Fairy type Pokémon and has a majestic quality about it. In terms of character, it is known for its bravery and strength."}
{"name":"Meloetta","type1":"normal","desc":"Meloetta is a versatile performer that can change its voice depending on the move it wants to use. It has a diminutive, humanoid appearance with a dog-like face, large ears, and a long, flowing mane."}
{"name":"Genesect","type1":"bug","desc":"Genesect is a Bug/Steel-type Pokémon that resembles a genetically enhanced insect. It is typically depicted as having robotic armor and a futuristic design, giving it an otherworldly appearance. Genesect can use high-tech blasters as moves, exemplifying its technological prowess and battle-ready nature."}
{"name":"Chespin","type1":"grass","desc":"Chespin has a hedgehog-like appearance with a blue bottom half, a brown top half including spikes and a face with no visible eyes, nostrils or a mouth. It is typically found in forests and shrublands. It can use its spikes to defend itself and combat. "}
{"name":"Quilladin","type1":"grass","desc":"Quilladin is a grass-type Pokémon with a short, stout body, adorned with quill-like growths. Its cheeks are red and its eyes are dark brown. Type: Grass. It is a formidable and proud fighter, with its roots allow it to sense its surroundings."}
{"name":"Chesnaught","type1":"grass","desc":"Chesnaught is a Grass-type Pokémon known for its appearance as a humanoid tree, with a large main trunk and branches for its arms. It is a rather serious and dedicated character, preferring to focus on its training rather than other aspects of life. In terms of moves, Chesnaught is known for its powerful STAB moves such as Razor Leaf and Solar Beam."}
{"name":"Fennekin","type1":"fire","desc":"Fennekin is a Fire-type starter Pokémon that resembles a fox, with orange and yellow fur. It is known for its agility and playful nature. In terms of its battling capabilities, it is capable of using moves such as Ember, Fire Blast and Flame Charge."}
{"name":"Braixen","type1":"fire","desc":"Braixen is a red-orange anthropomorphic fox-like Pokémon with white and yellow markings. It has fire-type patterns on its ears and tail. As it evolves, it becomes Dedenne-style fire embers on its back, giving it a flame-like appearance."}
{"name":"Delphox","type1":"fire","desc":"A Fire/Psychic-type Pokémon with a fox-like appearance, having red and white fur and a crescent moon on its forehead. It is a Fire-type Pokémon with the power to create illusions. Delphox is known to be fairly aggressive, but despite its fiery personality, it is fiercely loyal to its friends and trainers."}
{"name":"Froakie","type1":"water","desc":"Froakie is an amphibian Pokémon with a blue-green coloration. It has large eyes and a long, thin tongue, with a white belly. It spends most of its time in water, where it can quickly adapt and turn into Frogadier as it evolves into Greninja."}
{"name":"Frogadier","type1":"water","desc":"Frogadier is a Water-type Pokémon that resembles a frog with a bright green complexion and a long body. It has a large, bulbous nose and long legs suitable for jumping. In terms of moves, Frogadier has Water-type abilities as well as jump-based moves which would complement its aquatic nature and jumping ability"}
{"name":"Greninja","type1":"water","desc":"Greninja is a Water/Dark-type Pokémon that has a humanoid body and a turtle shell on its back, with a large fin on its head and claws on its hands. It is known for its ninja-like abilities and is often depicted as a stealthy and agile Pokémon. Greninja can learn a variety of moves, including Water-type attacks like Hydro Pump and Dark-type moves like Razor Leaf."}
{"name":"Bunnelby","type1":"normal","desc":"Bunnelby is a small, rabbit-like Pokémon with a round body, long ears, and a fluffy tail. It is brown and white in color. Bunnelby is known for its quick movements and agile nature."}
{"name":"Diggersby","type1":"normal","desc":"Diggersby has a small body resembling a field mouse with a long, thin body. It has a flat, button-like face and ears that fold back when it is not on the lookout for its surroundings. It has no teeth and a gentle expression which allows it to manipulate its prey while taking away the element of surprise."}
{"name":"Fletchling","type1":"normal","desc":"Fletchling has a small, blue upper body with a fluffy throat and a reddish-brown lower body with a long tail, its legs also having a reddish-brown color."}
{"name":"Fletchinder","type1":"fire","desc":"Fletchinder is a Fire/Flying-type Pokémon, with the appearance of a bird with feathers that are a mix of orange and yellow. It's known for its small wings, but despite this, it is able to fly and generate massive air currents with its wings. As for its character and moves, Fletchinder is known to be very quick and incredibly agile, allowing it to move very fast and dodge attacks with ease. In this, Fletchinder's flying moves are very powerful, and the bird can learn a variety of strikes that make use of the winds' power. Fletchinder may know Ember, Peck and Aerial Ace using its flying capabilities, and its quick and agile nature. Its agile characteristics means that Fletchinder will have powerful advantage when in battles involving speed and power."}
{"name":"Talonflame","type1":"fire","desc":"Talonflame stands on two feet like a pheasant, with its wings slightly spread in a powerful and imposing stance. It's a bit like a proud pheasant and shares its body with some lovely plumage, the flame on its wings casting a warm glow on the atmosphere. Fire-tipped wings make up the main feature of this species that evolves from the flying Pokémon, Honedge."}
{"name":"Scatterbug","type1":"bug","desc":"a small, yellow, bug-type Pokémon with a black and white striped pattern on its wings, having a fluffy body with shorter antennae."}
{"name":"Spewpa","type1":"bug","desc":"Spewpa, the Disguise Pokémon. It has a rounded, fuzzy body with a brown and yellow coloration. It forms Carbink after it burrows deep into the ground"}
{"name":"Vivillon","type1":"bug","desc":"Vivillon is a Bug/Flying-type Pokémon. Its appearance varies depending on its habitat, with different patterns and colors. In the wild, it is known to migrate and be attracted to flowers."}
{"name":"Litleo","type1":"fire","desc":"Litleo is a small, lion-like Pokémon with a reddish-orange mane and a fluffy tail. It is known for its energetic and playful personality. Litleo can learn fire-type moves like Ember and Flame Wheel."}
{"name":"Pyroar","type1":"fire","desc":"Pyroar is a large, lion-like Pokémon with a fluffy mane that can be orange or brown in color. It has a muscular build and a regal appearance."}
{"name":"Flabébé","type1":"fairy","desc":"Flabébé is a small, flower-like Pokémon that is a mixture of a bud, stem, and root. Its petals are a vibrant shade of pink, with white stripes and a golden center. It is often seen in a gentle, serene expression, looking for a flower to bud."}
{"name":"Floette","type1":"fairy","desc":"Floette is a Fairy-type Pokémon that resembles a flower. Its body is primarily composed of delicate petals in various colors, and it has a slender, stem-like body. When in battle, it can summon powerful petals to attack its opponents. It has a gentle and elegant appearance, often seen as a symbol of purity and innocence, and is said to be gentle in nature, but also fiercely protective of its friends."}
{"name":"Florges","type1":"fairy","desc":"Florges is a Quadruped, Ghost/Poison-type Pokemon with a white, petal-like body and a yellow, flower-like head. It is known to be a gentle and welcoming Pokemon that values harmony and beauty. Florges can learn various moves like Charm, Moonblast, and Toxic as its signature moves."}
{"name":"Skiddo","type1":"grass","desc":"Skiddo is a small, donkey-like Pokémon with a brown body, a grey underside, and a saddle-like structure on its back. It is highly energetic and loves to run around on the forest treetops. Skiddo is known for its incredible speed, agility, and endurance, and is capable of learning various moves such as Vine Whip, Rock Blast, and Earthquake."}
{"name":"Gogoat","type1":"grass","desc":"Gogoat are large, powerful goats with  long hair, a white and brown coat. The male Gogoat develop a pair a of long, curved horns, which the females lack. They are often depicted as being gentle and helpful."}
{"name":"Pancham","type1":"fighting","desc":"Pancham is a Normal-type Pokémon that has a heavy body and a flat face, resembling a giant bear. Its rough, rock-like skin is also a characteristic feature. It is known for its ferocity and powerful strength. "}
{"name":"Pangoro","type1":"fighting","desc":"Pangoro has a bear-like appearance and is given a boxing glove accessory on one of its fists; it is covered in red fur and can appear more anthropomorphic when not in its evolved form of Panpour. The evolved form of Pangoro has taken its human-like characteristics more to the forefront when set against the species of  Pansear. Evolved Pangoro is known to have been seen standing upright using its distinctive, club-like arms, in several games in the series."}
{"name":"Furfrou","type1":"normal","desc":"Furfrou is a highly stylized, fashion-conscious Pokémon with a fluffy, full-bodied appearance. It has a predominantly white body with distinct patterns in various colors depending on its style. It can be seen wearing hairstyles and facials similar to human hairstyling. Furfrou is a popular event Pokémon, coming with a variety of styles each with different characteristics."}
{"name":"Espurr","type1":"psychic","desc":"Espurr is a feline-like Pokémon with a rounded body, large ears, and a red nose. It is known to be confident and intelligent, with a gentle disposition. In terms of moves, it can learn moves such as Double Kick, Fury Cuts, and Future Sight."}
{"name":"Meowstic","type1":"psychic","desc":"Meowstic has a humanoid feline appearance. It is highly intelligent and is said to possess psychic powers. Users who build a relationship with it have the power to improve its abilities."}
{"name":"Honedge","type1":"steel","desc":"Honedge is a Steel/Fairy-type Pokémon resembling a samurai with a unique feature of being attached to a fossilized skull, giving it a rather ghostly appearance. It typically has a slender and agile appearance, but the skull can allow it to blend into its surroundings, making it appear ghostly. Honedge is known for its mobility and the ability to counterattack, dealing double damage."}
{"name":"Doublade","type1":"steel","desc":"Doublade is a dual Steel/Dark-type Pokémon with a distinctive appearance, resembling two linked blades. It is known for its intimidating presence and strong sense of loyalty. Doublade's ability to learn powerful moves like Sacred Sword and Iron Head makes it a formidable opponent in battle."}
{"name":"Aegislash","type1":"steel","desc":"Aegislash is a steel pokemon that has the appearance of a knight and his wings resemble a cape with an intricate metal armor. This pokemon is known for its elegant yet regal nature. Its moves include Shadow Sneak and Iron Head."}
{"name":"Spritzee","type1":"fairy","desc":"Spritzee is a Fairy-type Pokémon that has a delicate appearance with a clear body and a pretty flower crown. It is known for being an affectionate, charming and beautiful Pokémon. It is able to learn a variety of Fairy-type moves like Charm, Dazzling Gleam and Mystical Fire."}
{"name":"Aromatisse","type1":"fairy","desc":"Aromatisse is a large, insect-like Pokémon with a red and white striped body. It has a distinctive mustached-like appearance on its face, giving it a comedic look. As a Perfumey type, its character revolves around fragrance, and it can often be seen using its sweet-smelling moves to defend itself or charms its opponents."}
{"name":"Swirlix","type1":"fairy","desc":"Swirlix is a pink, cream-colored Fairy-type Pokémon with a long, silky tail and a small crown of six flowers on its head. It has a playful and mischievous nature, often using its charms to get what it wants. Swirlix is known for its dessert-themed moves, including 'Lick Balm' and 'Infestation'."}
{"name":"Slurpuff","type1":"fairy","desc":"Slurpuff has a pink, rabbit-like body with big, pink ears and a fluffy tail. They are known for their sweet cream-filled pastries that can be used for both self-defense and attack. They are typically found in various pastries and bakeries."}
{"name":"Inkay","type1":"dark","desc":"Inkay is a small, quadruped Pokémon with a round body covered in a dark purple ink sac. Its hands and feet leave no mark on surfaces when its moves are performed. It appears mainly in sea caves and is known to perform as if part of an event in which two of the same kind of Pokémon choose a leader by competing against each other using tricks."}
{"name":"Malamar","type1":"dark","desc":"Malamar is the evolved form of Yungoos"}
{"name":"Binacle","type1":"rock","desc":" Binacle is a type of Pokémon resembling a shellfish-like creature with pincer claws, having a humanoid upper body composed of two shells. The lower shell, formed from coral, helps the upper body for standing, and it displays a mask-like face with both crab and pincer features. It is capable of changing the form of its lower body, having claws and a tail, from Binacle to its evolved form, Barbaracle. It has two different forms and is known for its brutal fighting style with powerful moves like Rock Blast, Shell Smash, and Crunch."}
{"name":"Barbaracle","type1":"rock","desc":"Barbaracle is a fish-like Pokémon with blue and purple markings. They have the ability to communicate through clicks, similar to their Magnitude brethren. It can also use a number of physical moves and holds a high strength stat."}
{"name":"Skrelp","type1":"poison","desc":"Skrelp has a serpent-like body covered in green and yellow sclera that is adorned with toxic secretions. It is a poisonous Pokémon that is said to be able to kill with a single scratch. Skrelp is often found in polluted areas, where its toxic secretions can help it to digest its food. It can exhale toxic gas from its mouth and has a powerful bite."}
{"name":"Dragalge","type1":"poison","desc":"Dragalge is a Poison/Dragon-type Pokémon with a deep purple and pale blue body, featuring a long, slender tail and large eyes. It has been known to be a solitary and stealthy Pokémon. Dragalge can use moves such as Poison Fang and Outrage."}
{"name":"Clauncher","type1":"water","desc":"Clauncher is a Water-type Pokémon. It has a red shell with a snail-like shell mouth on top, with a large 'tail' on its head, its mouth is wide with sharp incisors."}
{"name":"Clawitzer","type1":"water","desc":"Clawitzer is a large, whale shark-like Water-type Pokémon. It has a blue and white body, and is known for its distinctive claw on the end of its tail. Clawitzer is a fierce and prideful species that uses its powerful attacks to make its presence known."}
{"name":"Helioptile","type1":"electric","desc":"Helioptile is a Fire-type Pokémon with a lizard-like body, with sunburned, reptilian features and yellow or white or a mix of various colors, it has no known evolutions. It is able to generate heat from its feet, enabling it to walk on hot sand without getting burned. Helioptile moves with incredible agility, thanks to its massive forelimbs and powerful agility, it can carry a great load. "}
{"name":"Heliolisk","type1":"electric","desc":"Heliolisk has a nearly pure yellow appearance and has a distinctive crest on the top of its head. It has the ability to sense vibrations in the ground and store electricity in its frill. It can generate strong electric attacks from this stored energy."}
{"name":"Tyrunt","type1":"rock","desc":"Tyrunt is a small, blue dinosaur-like Pokémon with a crest on its head and sharp teeth.It has large claws and a long tail.It has a good sense of smell."}
{"name":"Tyrantrum","type1":"rock","desc":"Tyrantrum is a large, quadruped dinosaur Pokémon with a green and orange body. It has a distinctive crest on its head, a long tail, and sharp teeth. Tyrantrum is known for its power and strength, and is often used in battles as a formidable foe."}
{"name":"Amaura","type1":"rock","desc":"Amaura, the Armor Pokémon. Type: Rock/Steel. It has a distinctive appearance, with a massive body and a long, narrow snout. Its character is described as being brave, but also having the tendency to be quiet and reserved. Its notable moves include the powerful Zen Headbutt and Earthquake."}
{"name":"Aurorus","type1":"rock","desc":"Aurorus is a rock-type Pokémon with a primarily quadruped body. Its body is a mix of a triceratops and icicles, giving it a mixed, yet naturally cold and strong appearance. It has many icicles hanging from its head when it creates cold waves."}
{"name":"Sylveon","type1":"fairy","desc":"Sylveon is a very cute and elegant Pokémon with a feline appearance and a slender body, covered in a thick veil of pink fur. Its face is adorned with two small, button-like eyes and a small pink nose. It is said to be a gentle and affectionate Pokémon, often found to be a loyal companion to its trainers. Its moves include Charm, Dazzling Gleam, and Fairy Wind."}
{"name":"Hawlucha","type1":"fighting","desc":"Hawlucha is a human-faced wrestling-Mach Pokémon that resembles a mix between a humanoid and a luchador wrestling mask, and a lutino, with a predominantly brown body, a pinky grey mottled face and forehead, and eyes of a striking orange"}
{"name":"Dedenne","type1":"electric","desc":"Dedenne is a small, quadruped, rodent-like Pokémon with a rounded body and long hair that resembles a squirrel. It has a curly tail and large eyes. Dedenne is known to be curious and mischievous in nature and is said to be able to sense its surroundings through its whiskers."}
{"name":"Carbink","type1":"rock","desc":"Carbink is a Rock-type Pokémon that resembles a carbuncle resembling an egg. It has a glowing rock-like body which shines and a face with cute and slightly naive expression. It uses the hard rocks on its body to protect itself from predators. With smooth movements, it often attracts its prey."}
{"name":"Goomy","type1":"dragon","desc":"Goomy are small, slug-like Pokémon with a soft, white body and a large, round head. They have a distinctive lack of any limbs, and are often seen with a sad expression. They often use gooey secretions to capture and subdue their opponents, and can be trained to use powerful moves like Shadow Ball and Power Gem."}
{"name":"Sliggoo","type1":"dragon","desc":"Sliggoo is a blue, slimy amphibian-like Pokémon with a long, snout-like nose. It has a distinctive pair of fleshy flaps on its neck that it can wiggle, and it has a long, pointed tongue that it uses to catch insects. Sliggoo is often found in areas with fresh water, where it can feed on plants, insects, and small aquatic animals. It is known to be a slow-moving Pokémon, but it can become quite ferocious if provoked."}
{"name":"Goodra","type1":"dragon","desc":"It evolves from Shelmonite by crying. Goodra the dragon-type Pokemon is described as being blue with white markings on it's face. It often exhibits a water-based physiology and has unique characteristics common to draconic Pokémon."}
{"name":"Klefki","type1":"steel","desc":"Klefki is a Steel-type Pokémon that resembles a lantern with a top that resembles a dome or a lid. It has a warm and cheerful appearance with a golden glow emanating from its body. "}
{"name":"Phantump","type1":"ghost","desc":"Phantump resembles a tree with a trunk, branches, and leaves that resemble a face, with a long, curved branch for a body and leafy green hair. It has a small, apple-like fruit on its head, which serves as a nose and mouth. Phantump is described as a stubborn and obstinate Pokémon, having trouble learning from its trainer, and is known to use moves like wood-based attacks, like Wood Hammer and Seed Bomb."}
{"name":"Trevenant","type1":"ghost","desc":"Trevenant is tree-like Pokémon with leaves on its body. It often blends into its surroundings, blending into its tree-like environment. Its vines stretch off in various directions which are even said to have some medicinal properties."}
{"name":"Pumpkaboo","type1":"ghost","desc":"Pumpkaboo is a Ghost/Poison-type Pokémon resembling a jack-o-lantern with a menacing appearance. It is known to have a tough exterior and a lonely character. It can learn powerful moves such as Shadow Sneak and Poison Fang."}
{"name":"Gourgeist","type1":"ghost","desc":"Gourgeist is a Ghost/Fairy-type Pokémon that has the appearance of a pumpkin-like creature. It has a variety of different sizes to make it seem like different sizes of pumpkins and it can use its powerful presence to make anything perfect as it has the second-highest base special stat in its mainline evolution family. Gourgeist can use its moves to attack its opponents and Gourgeist's moves may vary depending on its level depending on its level to access high-attack-power moves like shadow sneak."}
{"name":"Bergmite","type1":"ice","desc":"Bergmite is a blue, walrus-like Pokémon with a thick, icy body. It has large, rounded ears and a small, beaked nose. Bergmite is a gentle creature that is unaware of its surroundings, making it difficult for others to understand it."}
{"name":"Avalugg","type1":"ice","desc":"Avalugg is an Ice/Water-type Pokémon that resembles a walrus. It has a relatively large body and a thick layer of fat to keep it warm in icy waters. It uses its large tusks to break through ice and its powerful body to swim through the ocean."}
{"name":"Noibat","type1":"flying","desc":"Noibat is a dark/flying-type Pokémon with a strange appearance, having a thin, tubular body with a leathery organ on its neck. Its character is often depicted as calm and mysterious. It's known for possessing the unique skill to communicate with others telepathically and uses its agility to dodge attacks, employing moves like Gust, Detect, and Confusion to defend itself."}
{"name":"Noivern","type1":"flying","desc":"Noivern is a dual Flying/ Dragon type Pokémon known for its aerodynamic body with six wings and its ability to fly at sharp velocities, making it one of the fastest Pokémon in the game. It has a lean and athletic body with sharp claws, giving it a sleek and menacing appearance. Noivern can also learn a variety of high-damage moves like Draco Meteor, Outrage, and Dragon Pulse."}
{"name":"Xerneas","type1":"fairy","desc":"Xerneas is a white (or often referred to as fairy-type, as it is believed to appear white in the wild) deer-like Pokémon with a massive antler on its head, which is often associated with fairy lore, and possesses a slender neck and two long ears. It has slender legs found at the bottom which also can assist it in quick getaway."}
{"name":"Yveltal","type1":"dark","desc":"Yveltal, the Destruction Pokémon, is a Dark/Flying-type Pokémon.  It has bat-like wings, a long, skeletal body with thorn-like protrusions, and a distinctive crest on its head. Yveltal is often associated with the 'Darkness Sun' event in which the sun turns dark."}
{"name":"Zygarde","type1":"dragon","desc":"Zygarde is a dual Dragon/Ground-type Pokémon. It has a large, serpentine body that can transform into a more humanoid form, with a long, curved tail and a fin on its head. Zygarde is known for its incredible strength and endurance, and is said to have the power to cover the entire world in its aura."}
{"name":"Diancie","type1":"rock","desc":"Diancie, the Jewel Pokémon. Diancie is a Rock/Fairy-type Pokémon. It resembles a humanoid figure with a translucent body and has a collection of jewels on its head, hands, and feet. Diancie is a rare and jewel-loving Pokémon. It is typically shy and weak when not being nurtured or admired by trainers."}
{"name":"Hoopa","type1":"psychic","desc":"Hoopa is a Psychic/ Ghost-type Pokémon that has the ability to create portals to other dimensions. It has a small, wolf-like body and a large, orb-like body that allows it to travel between dimensions. According to its character, Hoopa can act on its own volition, posing a threat to its ruler, especially if it's happy. Despite this, Hoopa usually acts on command, using its powers to serve its master."}
{"name":"Volcanion","type1":"fire","desc":"Volcanion has a Steam Engine-like body with a distinctive funnel on its back. This powerful water/stream-type fire-type pokemon with a volcano-dwelling theme and is known to be fearless. It is a sturdy Pokemon capable of spewing volcanic magma."}
{"name":"Rowlet","type1":"grass","desc":"Rowlet is a small, nocturnal owl Pokémon with a round belly and large wings. Its face and head resemble those of an owl. It has short legs that end in talons which are black and yellow. "}
{"name":"Dartrix","type1":"grass","desc":"Dartrix has the appearance of a bird of prey, with a yellow beak and brown plumage on its back, ending with a brown line on the back of its neck. Its face is yellow, with white eyes and a red crest on its head. Dartrix is considered to be a fierce and impatient Pokémon. Their moves include \"Pursuit\", \"Flare Blitz\", and \"Dual Chop\"."}
{"name":"Decidueye","type1":"grass","desc":"It can launch sharp, small, bannermen bows from the leaves that sustain it. Its quiver full of bows gives it an age beyond its youthful build. It attacks with any number of the arrows available at its quiver."}
{"name":"Litten","type1":"fire","desc":"Litten is a Fire-type cat-like Pokémon with fluffy orange fur. It has pink accents on its face, and it has the ability to generate heat from its fluffy fur. By rubbing its cheek against its arm, Litten generates sparks and uses them to shock its opponent. Its flame-like fur is always burning with strong flames."}
{"name":"Torracat","type1":"fire","desc":"Torracat is a Fire-type Pokémon that resembles a tiger-like creature. It has a muscular body and short tail with a smaller, fox-like head. It has enhanced senses of smell and can climb steep places to knock opponents to the ground."}
{"name":"Incineroar","type1":"fire","desc":"Incineroar is a large, muscular Fire/Dark-type Pokémon with a athletic build. It has a red and yellow body with a distinctive 'scar' above its left eyebrow. It is known for its intimidating presence and powerful attacks."}
{"name":"Popplio","type1":"water","desc":"A Marine Pokémon. It inflates its body with air, making a balloon-like shape."}
{"name":"Brionne","type1":"water","desc":"At 10 feet 7 inches, the Eeveelutions' overall height is the largest among the group; the fluffy wolf-like creature is an Electric-type. Its fluffy fur gives it the appearance of a wolf but could prove to be an advantage or a disadvantage during actual encounters. Brionne can commonly possess the moves Thunder Bolt and Shadow Ball."}
{"name":"Primarina","type1":"water","desc":"Primarina is a marine Pokémon with a big voice that lives in the ocean. It has a mostly white body with a mermaid-like tail and has beautiful, bright blue hair. With its captivating singing voice and its ability to create powerful bubbles, Primarina becomes a challenging foe in battle with moves like Aqua Jet and Charm."}
{"name":"Pikipek","type1":"normal","desc":"Pikipek has a black beak and white markings on its face. A yellow patch is on its mask. It has rough, tawny feathers. This bird Pokémon's body is reminiscent of an olive-drab kestrel. Pikeppek has a kestrel-like face with black and white and a yellow color combination. Due to its bird-like body, Pikeppek has sharp talons. Compared to its cousin this is larger. It lives in sandy lands. It has less aggressive nature."}
{"name":"Trumbeak","type1":"normal","desc":"Trumbeak is a Normal/Flying-type Pokémon that resembles a bird with a mixture of yellow and black feathers. It has a distinctive beak and is known for its energetic and confident personality. Its moves include Peck, Flock Watch, and Razor Wind."}
{"name":"Toucannon","type1":"normal","desc":"Toucannon is a bird Pokémon with peacock feathers on its head and a strong, black beak. It has the ability to store cannonballs in its tail feather. It is known for its 'battling spirit', which makes it fiercely competitive when facing opponents. This powerful bird-type Pokémon specializes in its versatile and unpredictable moves. Toucannon can be found in the wild around Imitation Forest, Tall Grass, and some regional areas, but it is most commonly caught in Rock Tunnel or the wild with a High catch rate."}
{"name":"Yungoos","type1":"normal","desc":"Yungoos is a wolf-like Pokémon with a stocky build, long ears, and a distinctive ' V' shape on the chest. In the wild, Yungoos acts fiercely but will growl at its allies for food, highlighting its confrontational temperament. It has a few sharp, flat bony parts that can use to cut bananas along with other fruits, to eat,"}
{"name":"Gumshoos","type1":"normal","desc":"Gumshoos is a Normal-type Pokémon resembling a raccoon dog. It has a thick, brown coat and a distinctive black ring around its neck. It is known for its love of sniffing out food and can be quite territorial."}
{"name":"Grubbin","type1":"bug","desc":"Grubbin's grub-like body, on its upper back has shell-like protrusions with six black stripes. Grubbin is a slow moving bug type Pokemon. It's known for evolves into its final form, Stonjew  when traded. Grubbin has the ability by the name of Vital spirit is now a part of bug."}
{"name":"Charjabug","type1":"bug","desc":"Charjabug is a yellow, cricket-like Pokémon, with green on its back and black on its eyes, antennae, and spikes, with six sharp spikes on its back. It is known for being quiet and friendly, and has a habit of walking around with its long antennae used as a 'hand' to balance. In battle, it uses move Electric STABs, when its electric powder stored on its back explodes it charges its body."}
{"name":"Vikavolt","type1":"bug","desc":"Vikavolt to appear as a large, blue insectoid Pokémon with a thick, rounded carapace and six claw-like legs. Its body seems to discharge electricity and it also has big wings that appear to resemble those of a beetle, but with a bumblebee body, also it has a relatively small, spherical body and is blue and yellow in color. It is said that Vikavolt can also emit lightning bolts from its own body."}
{"name":"Crabrawler","type1":"fighting","desc":"Crabrawler has a body that resembles a boxer, with its exterior a mixture of blue-grey and green shell that it obtained from its food, a blue shell in the underside, that can close to get flat when threatened. Crabrawler has short legs and with a pincer-looking hand at the end. The two sharp pincers used when they throw their punches could make its opponent back away instantly. While it lacks in its intelligence and training, Crabrawler possesses incredible power. This boxers Pokémon's strength, toughness, and quick movements makes its victories all but inevitable."}
{"name":"Crabominable","type1":"fighting","desc":"A powerful, humanoid yeti that lives in the mountains. It has a harsh environment to live in with long sharp claws at the end of its heavily muscular hands and powerful appearance. It uses its pincer-like claws to move on its feet and fight its enemies."}
{"name":"Oricorio","type1":"fire","desc":"Oricorio is a bird Pokémon that has four different Bird forms, each of which corresponds to a different culture. In their usual form, Oricorio has three long feathers on its neck with bright colors, has red feathers found on the underside of its wings with feathers around its head with the final one at the back. They are known to dance to communicate, and have been known to travel within dance circles and battle for love."}
{"name":"Cutiefly","type1":"bug","desc":"Cutiefly is a small insect-like Pokémon with a yellow and red body. It has a distinctive pair of wings on its back and a long, antennae-like structure on its head. In terms of character, Cutiefly is described as being very sleepy and loves to lounge around all day."}
{"name":"Ribombee","type1":"bug","desc":"Ribombee is a Bug/Fairy-type Pokémon with a bee-like appearance, having a shiny yellow body with black wings and legs. It has a cute and innocent expression on its face, giving it a friendly and approachable demeanor. It is known to learn moves such as Hone Claws, Bug Buzz, and Ancient Power, which it can use to its advantage in battle."}
{"name":"Rockruff","type1":"rock","desc":"Rockruff are small, canine Pokémon with fur that is either brown or a mix of brown and gray. They resemble puppies but with a rock in the bottom, that sticks out with their tongue out at the corner of their mouth."}
{"name":"Lycanroc","type1":"rock","desc":"This Pokémon resembles a raccoon dog. It has a large head, a bushy tail, and ears that seem to be constantly perked up. As its 'Midnight Form', it grows darkness in many night dark places. It evolves from Rockruff when traded. Lycanroc excels at swift physical attacks much like Rockruff."}
{"name":"Wishiwashi","type1":"water","desc":"Wishiwashi is a Water-type Pokémon resembling a school of minnows. It has a slender body and its ability to change color helps it blend in. Its school is made up of individual Wishiwashi."}
{"name":"Mareanie","type1":"poison","desc":"Mareanie is a dual Water/Poison-type Pokemon that resembles a red leg worm. It has a pair of glowing eyes and a pair of forelegs that are adapted for crawling. It can perform a variety of moves, including Poison Fang, Crunch, and Agile Guard."}
{"name":"Toxapex","type1":"poison","desc":"Toxapex is a Water/Poison-type Pokémon that has a blue, jellyfish-like body with a beak-like mouth and a poisonous sting. It is known for its agility and is said to be able to withstand a significant amount of damage before being defeated. Toxapex's moves include Poison Fang, Sludge Bomb, and Recover."}
{"name":"Mudbray","type1":"ground","desc":"Mudbray has a sturdy, quadrupedal body with a brownish-red color, resembling a donkey. It has a long, brown mane running along its neck and a pair of small ears. Mudbray is a mild-mannered Pokémon, but it can become aggressive when provoked, and it can move its opponents with a series of swift kicks. Mudbray knows a variety of moves including Mud Sport, Mud Shot, and Earthquake."}
{"name":"Mudsdale","type1":"ground","desc":"Mudsdale has a sturdy build and its muddied fur is generally dark brown or brown, with a white saddle-like marking on its shoulders and a black mane around its neck. It is driven by a strong will and possesses a bold, cheerful character. It can learn powerful ground-type moves such as Earthquake and Stone Edge."}
{"name":"Dewpider","type1":"water","desc":"Dewpider is a Water/Bug-type Pokémon that resembles a spider, with its body and legs resembling those of a large spider. It can use its long fingers to climb up plants and pull itself up to reach food. It can use its web-like hands to swing between buildings and plant heights."}
{"name":"Araquanid","type1":"water","desc":"Araquanid, also known as Water Bug Pokémon, is a Water/Psychic-type Pokémon. It has the appearance of a large spider with a long, thin body covered in a wavy, water-like pattern. Araquanid is known to be a quiet and elusive Pokémon."}
{"name":"Fomantis","type1":"grass","desc":"Fomantis appears as a insect-like Pokémon with a fragile, leaf-like body. It has two small legs and cannot walk but has a long, thin tail that acts as a counterbalance to its body. Fomantis has two big, innocent-looking eyes on top of its leafy head and a long, thin fang-like structure attached to the end of its long, thin tongue. When struggling, its leaves become wilted."}
{"name":"Lurantis","type1":"grass","desc":"Lurantis is a Grass-type Pokémon that has a large, lily pad-like center of florets, six petals that resemble a flower's, and three leaf-like protrusions that resemble a stem. As Lurantis is a Flower Pokémon, it is a symbol of peace and it appears to be in a tranquil mood most of the time. Lurantis is known to attack its opponents using its sharp petals and long stem."}
{"name":"Morelull","type1":"grass","desc":"Morelull is a small, sentient seed Pokémon that has a large, mushrooms cap on its head. It is usually found in forests and grasslands, and has been known to glow softly in the dark. It has the ability to move and change color in response to its environment."}
{"name":"Shiinotic","type1":"grass","desc":"Shiinotic is a Grass/Poison-type Pokémon that resembles a giant spider plant. It has a vibrant green and yellow appearance with a distinctive bloom of flowers on its head. In terms of character, Shiinotic is known to be a calm, gentle creature that can heal itself through photosynthesis."}
{"name":"Salandit","type1":"poison","desc":" Description:  Salandit has a long, snake-like body that resembles a molten lava. It has a poisonous tail and a pair of bulging eyes, resembling magma. When threatened, it can secrete a toxic sweat from its fangs. "}
{"name":"Salazzle","type1":"poison","desc":"Salazzle, the Lava Spender Pokémon, is a Poison/Fire-type Pokémon that resembles a fox-like creature. It has a slender build, orange and red fur, and a distinctive 'mane' of longer fur around its neck. Salazzle is known to be fiercely competitive and has a variety of moves at its disposal, including Fire Blast, Lava Plume, and Will-O-Wisp."}
{"name":"Stufful","type1":"normal","desc":"Stuffy is a small, bear-like Pokémon with a fluffy, cream-colored body, a pink nose, and a large, fluffy key on its back. It has big, round eyes and cute facial expressions. Stuffy can evolve into Slurpuff, gaining even more size and a lot of newfound confidence."}
{"name":"Bewear","type1":"normal","desc":"Bewear has a large bear-like body with a sloth-like appearance and a pink tongue. In terms of character, Bewear is known to be aggressive and likes to cause trouble. Its moves include Body Press, Hammer Arm, and Stone Edge."}
{"name":"Bounsweet","type1":"grass","desc":"Bounsweet is a short, rounded Pokémon with a pale orange body. It has short arms and a round face with two long, curly antennae-like stalks on its head. Bounsweet has a sweet aroma that attracts various insects."}
{"name":"Steenee","type1":"grass","desc":"Steenee is a Grass-type Pokémon that resembles a small, rabbit-like creature with a slender build. It has a green and white body with a long, leafy tail and can be found in meadows and forests. Steenee is known to be gentle and laid back, often seen relaxing in the sun or picking grass to eat."}
{"name":"Tsareena","type1":"grass","desc":"Tsareena is a Grass-type Pokémon. It has a tall and slender appearance with large, leafy green arms and legs. Its torso is often depicted with vibrant green flowers and pink highlights, with a cap of a long, vibrant green leaf."}
{"name":"Comfey","type1":"fairy","desc":"Comfey is a small, elegant Pokémon with a delicate appearance. It resembles a doll or a porcelain figure, with a slender body and a crown-like structure on its head. It is known for its peaceful and gentle nature."}
{"name":"Oranguru","type1":"normal","desc":"Oranguru, the Teacher Pokémon. It bears a small, hairy crown on its head and has long arms. It is said to be highly intelligent and capable of using psychic powers to read the thoughts of its foes."}
{"name":"Passimian","type1":"fighting","desc":"a large, simian Pokémon with dark orange fur and a long, thin tail. It has a strong build and can be quite aggressive. It can learn various fighting moves, such as Close Combat and Hammer Arm."}
{"name":"Wimpod","type1":"bug","desc":"Wimpod is a Bug/Steel-type Pokémon that appears as a crustacean with a long, thin body similar to a prawn. It is known for its timid and cautious nature. Wimpod is able to use various moves such as Bug Bite, Pin Missile, and Metal Claw."}
{"name":"Golisopod","type1":"bug","desc":"Golisopod is a dual Water/Bug-type Pokémon. It has a blue body resembling a crab's carapace, with a pair of claw-like arms and a long, curved shell on its back. Golisopod is known for its swift movement and ability to deal powerful physical attacks."}
{"name":"Sandygast","type1":"ghost","desc":"Sandygast is a Ghost/Water-type Pokémon that resembles a glowing, sandy creature with a face and large, empty eye sockets. It has a very calm demeanor, seeming to be at peace with the world around it. Sandygast typically uses the move Sand Attack and can transform itself into a Phantom Zone allowing it to disappear from the battlefield."}
{"name":"Palossand","type1":"ghost","desc":"Palossand are undead creatures resembling skeletal fingers covered in dirt and moss, with iridescent fabrics to help them ward off wildsand and maintain their form. They have a pale and ghostly complexion, usually in a tranquil environment. Palossand possess a calming aura that assists with moving massive objects and calming the spirits of the living and the dead. They are able to move upon using their sandy, earthy counterparts, known as sandshoes and gloves.  Some types of Palossand have natural red glow emanating from the places within their fingers. Palossand make great additions to the Pokémon battling world with its immense power and sheer, unique beauty."}
{"name":"Pyukumuku","type1":"water","desc":"Pyukumuku are known to be white, mushroom-like Pokémon. They are typically rounded in shape with a soft, white cap and can be seen to have red spots or patterns on their caps. These spots can appear in various patterns, giving each Pyukumuku its unique appearance."}
{"name":"Type: Null","type1":"normal","desc":"Silvaner is a Ground/Steel-type Pokémon that resembles a mixture of a groundhog and a train. It has a large, brown body with a long, pointed snout and a pair of large, round ears on its head. Silvaner is known for its 'engine' move, Dragon Dance, and 'tunneling' move, Dig."}
{"name":"Silvally","type1":"normal","desc":"Silvally is the final evolution of Type: Null and looks like a pale pony with gray and silver colors, with its mane an iridescent flowing spire. Its pony has 'ancient beast designs' like a ancient animal. It has a wide variety of dishes to influence its moves."}
{"name":"Minior","type1":"rock","desc":"Minior, the Meteorite Pokémon is the evolved form of Relicanth. It is a Rock-type Pokémon that resembles a meteorite, with a dark gray and brown color pattern, and its body is covered with a mass of fragments from space. It has a cold demeanor and a level of intelligence, but is still driven to find other fragments to grow."}
{"name":"Komala","type1":"normal","desc":"Komala is a Normal-type Pokémon that has the ability to sleep for long periods of time while moving, allowing it to walk while dreaming. It has a sheep-like appearance and a gentle nature. Komala is known to possess the move 'Body Slam'."}
{"name":"Turtonator","type1":"fire","desc":"Turtonator is a Fire/Dragon-type Pokémon that has the appearance of a turtle with armor plating made of fire, giving it a menacing look. It is characterized as a fierce and intimidating creature due to its robust body and fierce gaze. It learns moves such as Flame Wheel and Dragon Dance, which align with its Fire and Dragon typing."}
{"name":"Togedemaru","type1":"electric","desc":"Togedemaru is a small, rodent-like Pokémon with a rodent-like appearance, sporting large, red eyes, and possessing a predominantly brown body, with a few white markings on its face, white fur under the feet and tail and an axel which is metallic and brown with a round wooden body and it has a ring which reflects light around its cylindrical lower torso, the metallic brown in axel is in line with the metallic light and patterned wooden ring running through the center lower cylindrical body.Togedemaru, is known as a playful, curious, and gentle Pokémon. it has the ability to perform any kind of lightning fast movements such as dodge movements, therefore giving it a high speed."}
{"name":"Mimikyu","type1":"ghost","desc":"Mimikyu is the Pokémon League's mascot, dressed in a Pikachu onesie. It has a white, orange, and pink coloring with a bit of a creepy, doll-like appearance in the anime. As for moves Mimikyu is commonly known for its use of Shadow Ball and Sludge Bomb."}
{"name":"Bruxish","type1":"water","desc":"Bruxish are fish-like Pokémon with brown and white coloration. They often have aggressive behaviors and when threatened, they will display threatening behaviors. They know moves such as Bubble, Harden, and Mist Ball."}
{"name":"Drampa","type1":"normal","desc":"Drampa's arms and body closely resemble those of a gorilla, but it also has a long, flat snout. They typically dwell in remote valleys and mountainous terrain. It is known to fiercely dislike humans."}
{"name":"Dhelmise","type1":"ghost","desc":"a plant-dragon type with a body resembling a vine with many thorns and a long tongue like a whip with a pinkish white and yellowish green color scheme "}
{"name":"Jangmo-o","type1":"dragon","desc":"Jangmo-o is a reptilian Pokémon with a primarily orange body and blue accents. It is known to be a calm creature with a caring nature. Jangmo-o's abilities include the moves Stone Edge, Crunch, and Dragon Dance as part of its formidable arsenal."}
{"name":"Hakamo-o","type1":"dragon","desc":"Hakamo-o are serpent-like Water/Dragon-type Pokémon with a combination of red and blue scales that resemble a boxing glove or a hand. They are known to be fierce and strong Pokemon, that focus on physical strength and speed. Their ideal moves are Head Butt, Low Kick and Stone Edge and Thrash."}
{"name":"Kommo-o","type1":"dragon","desc":"Kommo-o is a quadruped, humanoid Pokémon with a blue or white body and a pink or yellow face. It has a number of fluffy red tufts on its head and a blue, serpent-like structure on its back. Kommo-o is known for its unique and powerful moves, including X-Scissor and Dragon Dance."}
{"name":"Tapu Koko","type1":"electric","desc":"Tapu Koko, the Electromind Pokémon. The myth that Tapu Koko was once a being of pure lightning has long since been lost to history, but the striking thunderbolt-shaped markings on its body remain a testament to its origins."}
{"name":"Tapu Lele","type1":"psychic","desc":"Tapu Lele is a pink, quadruped Pokémon with a large oval head, a heart-shaped marking on its forehead, and a slender, rabbit-like body. It has a pair of large, round ears on the top of its head, and a long, slender tail. Tapu Lele is known to be the guardian of the Alola region's Aetherlin Village, and is said to possess a strong connection to the night sky and the beauty of the stars."}
{"name":"Tapu Bulu","type1":"grass","desc":"Tapu Bulu is a fairy/fighting-type Pokémon that is one of the four guardian deities of Alola. It has a large, wing-like structure on its back, which allows it to sense the surroundings and defend its partners. Tapu Bulu can create large barriers to protect itself and its allies from harm, and has the ability to sense the emotions of those around it."}
{"name":"Tapu Fini","type1":"water","desc":"Tapu Fini has a regal, calmer appearance and is associated with the island of Akala. She is a member of the four guardian deities and keeps the balance of nature. Tapu Fini is known to be gentle, yet she can show a fierce side when threatened."}
{"name":"Cosmog","type1":"psychic","desc":"Cosmog is a Small, celestial object Pokémon that is a pale purple rectangular box or ball that occasionally flails its four limbs. It is said to be a precursor to the creation of the universe and the origins of other matter. Its description is said to be based on the Big Bang in Cosmog and can use moves that seem to directly affect the universe including moves that can teleport the user."}
{"name":"Cosmoem","type1":"psychic","desc":"Cosmoem is a pair of round, spherical bodies containing a large, egg-like structure that eventually develops into a Celesteela or a Solgaleo due to the moon or sun falling. Cosmoem is rather dim-witted and only looks up once in its very brief lifespan. When at night, under moonlight, this Pokémon takes the Solgaleo form, and by daylight, it evolves into Celesteela."}
{"name":"Solgaleo","type1":"psychic","desc":"Solgaleo is a large, lion-like Pokémon with a gold body covered in golden plates and red markings, a crescent moon on its forehead. It has a noble and regal appearance, being the Solbringers \"Holy Pokémon\". Solgaleo can learn powerful moves such as Arcanine and Magician-like moves."}
{"name":"Lunala","type1":"psychic","desc":"Lunala is a quadruped, ghost/dragon-type Pokémon. Its appearance is characterized by a large, crescent moon-like shape on its forehead. It has the ability to wield powerful lunar energy, which it uses to cast a variety of psychic and dragon-type moves."}
{"name":"Nihilego","type1":"rock","desc":"Nihilego is a Poison/Dark-type Pokémon with a toxic gas-like appearance, featuring a slimy and elongated body. Its character is that of a menacing and sneaky presence with a tendency to silence those it desires to assimilate. Its possible moves include Poison Fang, Dark Pulse, and Sludge Bomb."}
{"name":"Buzzwole","type1":"bug","desc":"Buzzwole is a large, insectoid Pokémon with a bulky, yellow body and a distinctive red and black pattern on its back. It has six legs with broad paws and a pair of sharp claws on each leg. Buzzwole is known for its extreme force and is a powerhouse in battle."}
{"name":"Pheromosa","type1":"bug","desc":"Pheromosa is a Bug/Fighting-type Pokémon that has a slender, high-speed body with a primarily blue coloration, as well as long, elongated legs that give it enhanced agility and speed. It is highly aggressive and is known for its intense competitiveness and quick actions. Its moves include Air Cutter, High Jump Kick, and Acrobatics."}
{"name":"Xurkitree","type1":"electric","desc":"Xurkitree is a Electric-type Pokémon. it has a strong, sturdy body with red as its primary color and yellow on its tail and on the flower on top of its head, with a strong vine-like attachment to its body that is also yellow. "}
{"name":"Celesteela","type1":"steel","desc":"A Steel-type Pokémon resembling a mechanical bird with wings made of steel, it's known for having a rather intimidating appearance."}
{"name":"Kartana","type1":"grass","desc":"Kartana resembles a cross between a katana and a scythe, with thin arms, a small torso and a large scythe-like blade that extends from its hilt."}
{"name":"Guzzlord","type1":"dark","desc":"It has a pig-like body with a rounded belly and looks like it has swallowed a balloon. Its facial expressions change the most when it’s hungry. It can be taught many physical moves by its trainer."}
{"name":"Necrozma","type1":"psychic","desc":"Necrozma is a legendary, dragon/fairy-type Pokémon said to reside in Ultra Space. It has a metallic, armor-like appearance with a geometric shape, symbolizing its connection to space. Necrozma can transform into Dawn Wings and Dusk Mane, and possesses the ability to use Ultra Burst attacks."}
{"name":"Magearna","type1":"steel","desc":"Magearna is a steel/fairy-type robot Pokémon that resembles a humanoid figure with a mechanical body. It has a mechanical appearance with copper components and two large white spheres on its back. Its ability is to create and control magical circles. The move it can perform is Magic Sword. Also, its metal body lets it perform a metal blade called Magic Edge."}
